FreeRTOS/FreeRTOS/FreeRTOS/Demo/ARM7_LPC2138_Rowley/LPC21xx.h
/* Copyright (c) 2009 Rowley Associates Limited. */
/* */
/* This file may be distributed under the terms of the License Agreement */
/* provided with this software. */
/* */
/* THIS FILE IS PROVIDED AS IS WITH NO WARRANTY OF ANY KIND, INCLUDING THE */
/* WARRANTY OF DESIGN, MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE. */

#ifndef LPC21xx_h
#define LPC21xx_h

#define FIO_BASE                                      0x3FFFC000

#define FIO0DIR                                       ( *( volatile unsigned long * ) 0x3FFFC000 )
#define FIO0DIR_OFFSET                                0x0

#define FIO0DIR0                                      ( *( volatile unsigned char * ) 0x3FFFC000 )
#define FIO0DIR0_OFFSET                               0x0

#define FIO0DIR1                                      ( *( volatile unsigned char * ) 0x3FFFC001 )
#define FIO0DIR1_OFFSET                               0x1

#define FIO0DIR2                                      ( *( volatile unsigned char * ) 0x3FFFC002 )
#define FIO0DIR2_OFFSET                               0x2

#define FIO0DIR3                                      ( *( volatile unsigned char * ) 0x3FFFC003 )
#define FIO0DIR3_OFFSET                               0x3

#define FIO0DIRL                                      ( *( volatile unsigned short * ) 0x3FFFC000 )
#define FIO0DIRL_OFFSET                               0x0

#define FIO0DIRH                                      ( *( volatile unsigned short * ) 0x3FFFC002 )
#define FIO0DIRH_OFFSET                               0x2

#define FIO0MASK                                      ( *( volatile unsigned long * ) 0x3FFFC010 )
#define FIO0MASK_OFFSET                               0x10

#define FIO0MASK0                                     ( *( volatile unsigned char * ) 0x3FFFC010 )
#define FIO0MASK0_OFFSET                              0x10

#define FIO0MASK1                                     ( *( volatile unsigned char * ) 0x3FFFC011 )
#define FIO0MASK1_OFFSET                              0x11

#define FIO0MASK2                                     ( *( volatile unsigned char * ) 0x3FFFC012 )
#define FIO0MASK2_OFFSET                              0x12

#define FIO0MASK3                                     ( *( volatile unsigned char * ) 0x3FFFC013 )
#define FIO0MASK3_OFFSET                              0x13

#define FIO0MASKL                                     ( *( volatile unsigned short * ) 0x3FFFC010 )
#define FIO0MASKL_OFFSET                              0x10

#define FIO0MASKH                                     ( *( volatile unsigned short * ) 0x3FFFC012 )
#define FIO0MASKH_OFFSET                              0x12

#define FIO0PIN                                       ( *( volatile unsigned long * ) 0x3FFFC014 )
#define FIO0PIN_OFFSET                                0x14

#define FIO0PIN0                                      ( *( volatile unsigned char * ) 0x3FFFC014 )
#define FIO0PIN0_OFFSET                               0x14

#define FIO0PIN1                                      ( *( volatile unsigned char * ) 0x3FFFC015 )
#define FIO0PIN1_OFFSET                               0x15

#define FIO0PIN2                                      ( *( volatile unsigned char * ) 0x3FFFC016 )
#define FIO0PIN2_OFFSET                               0x16

#define FIO0PIN3                                      ( *( volatile unsigned char * ) 0x3FFFC017 )
#define FIO0PIN3_OFFSET                               0x17

#define FIO0PINL                                      ( *( volatile unsigned short * ) 0x3FFFC014 )
#define FIO0PINL_OFFSET                               0x14

#define FIO0PINH                                      ( *( volatile unsigned short * ) 0x3FFFC016 )
#define FIO0PINH_OFFSET                               0x16

#define FIO0SET                                       ( *( volatile unsigned long * ) 0x3FFFC018 )
#define FIO0SET_OFFSET                                0x18

#define FIO0SET0                                      ( *( volatile unsigned char * ) 0x3FFFC018 )
#define FIO0SET0_OFFSET                               0x18

#define FIO0SET1                                      ( *( volatile unsigned char * ) 0x3FFFC019 )
#define FIO0SET1_OFFSET                               0x19

#define FIO0SET2                                      ( *( volatile unsigned char * ) 0x3FFFC01A )
#define FIO0SET2_OFFSET                               0x1A

#define FIO0SET3                                      ( *( volatile unsigned char * ) 0x3FFFC01B )
#define FIO0SET3_OFFSET                               0x1B

#define FIO0SETL                                      ( *( volatile unsigned short * ) 0x3FFFC018 )
#define FIO0SETL_OFFSET                               0x18

#define FIO0SETH                                      ( *( volatile unsigned short * ) 0x3FFFC01A )
#define FIO0SETH_OFFSET                               0x1A

#define FIO0CLR                                       ( *( volatile unsigned long * ) 0x3FFFC01C )
#define FIO0CLR_OFFSET                                0x1C

#define FIO0CLR0                                      ( *( volatile unsigned char * ) 0x3FFFC01C )
#define FIO0CLR0_OFFSET                               0x1C

#define FIO0CLR1                                      ( *( volatile unsigned char * ) 0x3FFFC01D )
#define FIO0CLR1_OFFSET                               0x1D

#define FIO0CLR2                                      ( *( volatile unsigned char * ) 0x3FFFC01E )
#define FIO0CLR2_OFFSET                               0x1E

#define FIO0CLR3                                      ( *( volatile unsigned char * ) 0x3FFFC01F )
#define FIO0CLR3_OFFSET                               0x1F

#define FIO0CLRL                                      ( *( volatile unsigned short * ) 0x3FFFC01C )
#define FIO0CLRL_OFFSET                               0x1C

#define FIO0CLRH                                      ( *( volatile unsigned short * ) 0x3FFFC01E )
#define FIO0CLRH_OFFSET                               0x1E

