FreeRTOS/FreeRTOS/FreeRTOS/Demo/ARM7_LPC2138_Rowley/LPC21xx.h
#define FIO1DIR                                       ( *( volatile unsigned long * ) 0x3FFFC020 )
#define FIO1DIR_OFFSET                                0x20

#define FIO1DIR0                                      ( *( volatile unsigned char * ) 0x3FFFC020 )
#define FIO1DIR0_OFFSET                               0x20

#define FIO1DIR1                                      ( *( volatile unsigned char * ) 0x3FFFC021 )
#define FIO1DIR1_OFFSET                               0x21

#define FIO1DIR2                                      ( *( volatile unsigned char * ) 0x3FFFC022 )
#define FIO1DIR2_OFFSET                               0x22

#define FIO1DIR3                                      ( *( volatile unsigned char * ) 0x3FFFC023 )
#define FIO1DIR3_OFFSET                               0x23

#define FIO1DIRL                                      ( *( volatile unsigned short * ) 0x3FFFC020 )
#define FIO1DIRL_OFFSET                               0x20

#define FIO1DIRH                                      ( *( volatile unsigned short * ) 0x3FFFC022 )
#define FIO1DIRH_OFFSET                               0x22

#define FIO1MASK                                      ( *( volatile unsigned long * ) 0x3FFFC030 )
#define FIO1MASK_OFFSET                               0x30

#define FIO1MASK0                                     ( *( volatile unsigned char * ) 0x3FFFC030 )
#define FIO1MASK0_OFFSET                              0x30

#define FIO1MASK1                                     ( *( volatile unsigned char * ) 0x3FFFC031 )
#define FIO1MASK1_OFFSET                              0x31

#define FIO1MASK2                                     ( *( volatile unsigned char * ) 0x3FFFC032 )
#define FIO1MASK2_OFFSET                              0x32

#define FIO1MASK3                                     ( *( volatile unsigned char * ) 0x3FFFC033 )
#define FIO1MASK3_OFFSET                              0x33

#define FIO1MASKL                                     ( *( volatile unsigned short * ) 0x3FFFC030 )
#define FIO1MASKL_OFFSET                              0x30

#define FIO1MASKH                                     ( *( volatile unsigned short * ) 0x3FFFC032 )
#define FIO1MASKH_OFFSET                              0x32

#define FIO1PIN                                       ( *( volatile unsigned long * ) 0x3FFFC034 )
#define FIO1PIN_OFFSET                                0x34

#define FIO1PIN0                                      ( *( volatile unsigned char * ) 0x3FFFC034 )
#define FIO1PIN0_OFFSET                               0x34

#define FIO1PIN1                                      ( *( volatile unsigned char * ) 0x3FFFC035 )
#define FIO1PIN1_OFFSET                               0x35

#define FIO1PIN2                                      ( *( volatile unsigned char * ) 0x3FFFC036 )
#define FIO1PIN2_OFFSET                               0x36

#define FIO1PIN3                                      ( *( volatile unsigned char * ) 0x3FFFC037 )
#define FIO1PIN3_OFFSET                               0x37

#define FIO1PINL                                      ( *( volatile unsigned short * ) 0x3FFFC034 )
#define FIO1PINL_OFFSET                               0x34

#define FIO1PINH                                      ( *( volatile unsigned short * ) 0x3FFFC036 )
#define FIO1PINH_OFFSET                               0x36

#define FIO1SET                                       ( *( volatile unsigned long * ) 0x3FFFC038 )
#define FIO1SET_OFFSET                                0x38

#define FIO1SET0                                      ( *( volatile unsigned char * ) 0x3FFFC038 )
#define FIO1SET0_OFFSET                               0x38

#define FIO1SET1                                      ( *( volatile unsigned char * ) 0x3FFFC039 )
#define FIO1SET1_OFFSET                               0x39

#define FIO1SET2                                      ( *( volatile unsigned char * ) 0x3FFFC03A )
#define FIO1SET2_OFFSET                               0x3A

#define FIO1SET3                                      ( *( volatile unsigned char * ) 0x3FFFC03B )
#define FIO1SET3_OFFSET                               0x3B

#define FIO1SETL                                      ( *( volatile unsigned short * ) 0x3FFFC038 )
#define FIO1SETL_OFFSET                               0x38

#define FIO1SETH                                      ( *( volatile unsigned short * ) 0x3FFFC03A )
#define FIO1SETH_OFFSET                               0x3A

#define FIO1CLR                                       ( *( volatile unsigned long * ) 0x3FFFC03C )
#define FIO1CLR_OFFSET                                0x3C

#define FIO1CLR0                                      ( *( volatile unsigned char * ) 0x3FFFC03C )
#define FIO1CLR0_OFFSET                               0x3C

#define FIO1CLR1                                      ( *( volatile unsigned char * ) 0x3FFFC03D )
#define FIO1CLR1_OFFSET                               0x3D

#define FIO1CLR2                                      ( *( volatile unsigned char * ) 0x3FFFC03E )
#define FIO1CLR2_OFFSET                               0x3E

#define FIO1CLR3                                      ( *( volatile unsigned char * ) 0x3FFFC03F )
#define FIO1CLR3_OFFSET                               0x3F

#define FIO1CLRL                                      ( *( volatile unsigned short * ) 0x3FFFC03C )
#define FIO1CLRL_OFFSET                               0x3C

#define FIO1CLRH                                      ( *( volatile unsigned short * ) 0x3FFFC03E )
#define FIO1CLRH_OFFSET                               0x3E

#define WDT_BASE                                      0xE0000000

#define WDMOD                                         ( *( volatile unsigned long * ) 0xE0000000 )
#define WDMOD_OFFSET                                  0x0
#define WDMOD_WDEN_MASK                               0x1
#define WDMOD_WDEN                                    0x1
#define WDMOD_WDEN_BIT                                0
#define WDMOD_WDRESET_MASK                            0x2
#define WDMOD_WDRESET                                 0x2
#define WDMOD_WDRESET_BIT                             1
#define WDMOD_WDTOF_MASK                              0x4
#define WDMOD_WDTOF                                   0x4
#define WDMOD_WDTOF_BIT                               2
#define WDMOD_WDINT_MASK                              0x8
#define WDMOD_WDINT                                   0x8
#define WDMOD_WDINT_BIT                               3

