FreeRTOS/FreeRTOS/FreeRTOS/Demo/ARM7_LPC2138_Rowley/LPC21xx.h
#define WDTC                                          ( *( volatile unsigned long * ) 0xE0000004 )
#define WDTC_OFFSET                                   0x4

#define WDFEED                                        ( *( volatile unsigned long * ) 0xE0000008 )
#define WDFEED_OFFSET                                 0x8

#define WDTV                                          ( *( volatile unsigned long * ) 0xE000000C )
#define WDTV_OFFSET                                   0xC

#define TIMER0_BASE                                   0xE0004000

#define T0IR                                          ( *( volatile unsigned char * ) 0xE0004000 )
#define T0IR_OFFSET                                   0x0
#define T0IR_MR0_MASK                                 0x1
#define T0IR_MR0                                      0x1
#define T0IR_MR0_BIT                                  0
#define T0IR_MR1_MASK                                 0x2
#define T0IR_MR1                                      0x2
#define T0IR_MR1_BIT                                  1
#define T0IR_MR2_MASK                                 0x4
#define T0IR_MR2                                      0x4
#define T0IR_MR2_BIT                                  2
#define T0IR_MR3_MASK                                 0x8
#define T0IR_MR3                                      0x8
#define T0IR_MR3_BIT                                  3
#define T0IR_CR0_MASK                                 0x10
#define T0IR_CR0                                      0x10
#define T0IR_CR0_BIT                                  4
#define T0IR_CR1_MASK                                 0x20
#define T0IR_CR1                                      0x20
#define T0IR_CR1_BIT                                  5
#define T0IR_CR2_MASK                                 0x40
#define T0IR_CR2                                      0x40
#define T0IR_CR2_BIT                                  6
#define T0IR_CR3_MASK                                 0x80
#define T0IR_CR3                                      0x80
#define T0IR_CR3_BIT                                  7

#define T0TCR                                         ( *( volatile unsigned char * ) 0xE0004004 )
#define T0TCR_OFFSET                                  0x4
#define T0TCR_Counter_Enable_MASK                     0x1
#define T0TCR_Counter_Enable                          0x1
#define T0TCR_Counter_Enable_BIT                      0
#define T0TCR_Counter_Reset_MASK                      0x2
#define T0TCR_Counter_Reset                           0x2
#define T0TCR_Counter_Reset_BIT                       1

#define T0TC                                          ( *( volatile unsigned long * ) 0xE0004008 )
#define T0TC_OFFSET                                   0x8

#define T0PR                                          ( *( volatile unsigned long * ) 0xE000400C )
#define T0PR_OFFSET                                   0xC

#define T0PC                                          ( *( volatile unsigned long * ) 0xE0004010 )
#define T0PC_OFFSET                                   0x10

#define T0MCR                                         ( *( volatile unsigned short * ) 0xE0004014 )
#define T0MCR_OFFSET                                  0x14
#define T0MCR_MR0I_MASK                               0x1
#define T0MCR_MR0I                                    0x1
#define T0MCR_MR0I_BIT                                0
#define T0MCR_MR0R_MASK                               0x2
#define T0MCR_MR0R                                    0x2
#define T0MCR_MR0R_BIT                                1
#define T0MCR_MR0S_MASK                               0x4
#define T0MCR_MR0S                                    0x4
#define T0MCR_MR0S_BIT                                2
#define T0MCR_MR1I_MASK                               0x8
#define T0MCR_MR1I                                    0x8
#define T0MCR_MR1I_BIT                                3
#define T0MCR_MR1R_MASK                               0x10
#define T0MCR_MR1R                                    0x10
#define T0MCR_MR1R_BIT                                4
#define T0MCR_MR1S_MASK                               0x20
#define T0MCR_MR1S                                    0x20
#define T0MCR_MR1S_BIT                                5
#define T0MCR_MR2I_MASK                               0x40
#define T0MCR_MR2I                                    0x40
#define T0MCR_MR2I_BIT                                6
#define T0MCR_MR2R_MASK                               0x80
#define T0MCR_MR2R                                    0x80
#define T0MCR_MR2R_BIT                                7
#define T0MCR_MR2S_MASK                               0x100
#define T0MCR_MR2S                                    0x100
#define T0MCR_MR2S_BIT                                8
#define T0MCR_MR3I_MASK                               0x200
#define T0MCR_MR3I                                    0x200
#define T0MCR_MR3I_BIT                                9
#define T0MCR_MR3R_MASK                               0x400
#define T0MCR_MR3R                                    0x400
#define T0MCR_MR3R_BIT                                10
#define T0MCR_MR3S_MASK                               0x800
#define T0MCR_MR3S                                    0x800
#define T0MCR_MR3S_BIT                                11

#define T0MR0                                         ( *( volatile unsigned long * ) 0xE0004018 )
#define T0MR0_OFFSET                                  0x18

#define T0MR1                                         ( *( volatile unsigned long * ) 0xE000401C )
#define T0MR1_OFFSET                                  0x1C

#define T0MR2                                         ( *( volatile unsigned long * ) 0xE0004020 )
#define T0MR2_OFFSET                                  0x20

#define T0MR3                                         ( *( volatile unsigned long * ) 0xE0004024 )
#define T0MR3_OFFSET                                  0x24

#define T0CCR                                         ( *( volatile unsigned short * ) 0xE0004028 )
#define T0CCR_OFFSET                                  0x28
#define T0CCR_CAP0RE_MASK                             0x1
#define T0CCR_CAP0RE                                  0x1
#define T0CCR_CAP0RE_BIT                              0
#define T0CCR_CAP0FE_MASK                             0x2
#define T0CCR_CAP0FE                                  0x2
#define T0CCR_CAP0FE_BIT                              1
#define T0CCR_CAP0I_MASK                              0x4
#define T0CCR_CAP0I                                   0x4
#define T0CCR_CAP0I_BIT                               2
#define T0CCR_CAP1RE_MASK                             0x8
#define T0CCR_CAP1RE                                  0x8
#define T0CCR_CAP1RE_BIT                              3
#define T0CCR_CAP1FE_MASK                             0x10
#define T0CCR_CAP1FE                                  0x10
#define T0CCR_CAP1FE_BIT                              4
#define T0CCR_CAP1I_MASK                              0x20
#define T0CCR_CAP1I                                   0x20
#define T0CCR_CAP1I_BIT                               5
#define T0CCR_CAP2RE_MASK                             0x40
#define T0CCR_CAP2RE                                  0x40
#define T0CCR_CAP2RE_BIT                              6
#define T0CCR_CAP2FE_MASK                             0x80
#define T0CCR_CAP2FE                                  0x80
#define T0CCR_CAP2FE_BIT                              7
#define T0CCR_CAP2I_MASK                              0x100
#define T0CCR_CAP2I                                   0x100
#define T0CCR_CAP2I_BIT                               8
#define T0CCR_CAP3RE_MASK                             0x200
#define T0CCR_CAP3RE                                  0x200
#define T0CCR_CAP3RE_BIT                              9
#define T0CCR_CAP3FE_MASK                             0x400
#define T0CCR_CAP3FE                                  0x400
#define T0CCR_CAP3FE_BIT                              10
#define T0CCR_CAP3I_MASK                              0x800
#define T0CCR_CAP3I                                   0x800
#define T0CCR_CAP3I_BIT                               11

#define T0CR0                                         ( *( volatile unsigned long * ) 0xE000402C )
#define T0CR0_OFFSET                                  0x2C

