FreeRTOS/FreeRTOS/FreeRTOS/Demo/ARM7_LPC2138_Rowley/LPC21xx.h
#define T0CR1                                         ( *( volatile unsigned long * ) 0xE0004030 )
#define T0CR1_OFFSET                                  0x30

#define T0CR2                                         ( *( volatile unsigned long * ) 0xE0004034 )
#define T0CR2_OFFSET                                  0x34

#define T0CR3                                         ( *( volatile unsigned long * ) 0xE0004038 )
#define T0CR3_OFFSET                                  0x38

#define T0EMR                                         ( *( volatile unsigned short * ) 0xE000403C )
#define T0EMR_OFFSET                                  0x3C
#define T0EMR_EM0_MASK                                0x1
#define T0EMR_EM0                                     0x1
#define T0EMR_EM0_BIT                                 0
#define T0EMR_EM1_MASK                                0x2
#define T0EMR_EM1                                     0x2
#define T0EMR_EM1_BIT                                 1
#define T0EMR_EM2_MASK                                0x4
#define T0EMR_EM2                                     0x4
#define T0EMR_EM2_BIT                                 2
#define T0EMR_EM3_MASK                                0x8
#define T0EMR_EM3                                     0x8
#define T0EMR_EM3_BIT                                 3
#define T0EMR_EMC0_MASK                               0x30
#define T0EMR_EMC0_BIT                                4
#define T0EMR_EMC1_MASK                               0xC0
#define T0EMR_EMC1_BIT                                6
#define T0EMR_EMC2_MASK                               0x300
#define T0EMR_EMC2_BIT                                8
#define T0EMR_EMC3_MASK                               0xC00
#define T0EMR_EMC3_BIT                                10

#define T0CTCR                                        ( *( volatile unsigned long * ) 0xE0004070 )
#define T0CTCR_OFFSET                                 0x70
#define T0CTCR_Counter_Timer_Mode_MASK                0x3
#define T0CTCR_Counter_Timer_Mode_BIT                 0
#define T0CTCR_Count_Input_Select_MASK                0xC
#define T0CTCR_Count_Input_Select_BIT                 2

#define TIMER1_BASE                                   0xE0008000

#define T1IR                                          ( *( volatile unsigned char * ) 0xE0008000 )
#define T1IR_OFFSET                                   0x0
#define T1IR_MR0_MASK                                 0x1
#define T1IR_MR0                                      0x1
#define T1IR_MR0_BIT                                  0
#define T1IR_MR1_MASK                                 0x2
#define T1IR_MR1                                      0x2
#define T1IR_MR1_BIT                                  1
#define T1IR_MR2_MASK                                 0x4
#define T1IR_MR2                                      0x4
#define T1IR_MR2_BIT                                  2
#define T1IR_MR3_MASK                                 0x8
#define T1IR_MR3                                      0x8
#define T1IR_MR3_BIT                                  3
#define T1IR_CR0_MASK                                 0x10
#define T1IR_CR0                                      0x10
#define T1IR_CR0_BIT                                  4
#define T1IR_CR1_MASK                                 0x20
#define T1IR_CR1                                      0x20
#define T1IR_CR1_BIT                                  5
#define T1IR_CR2_MASK                                 0x40
#define T1IR_CR2                                      0x40
#define T1IR_CR2_BIT                                  6
#define T1IR_CR3_MASK                                 0x80
#define T1IR_CR3                                      0x80
#define T1IR_CR3_BIT                                  7

#define T1TCR                                         ( *( volatile unsigned char * ) 0xE0008004 )
#define T1TCR_OFFSET                                  0x4
#define T1TCR_Counter_Enable_MASK                     0x1
#define T1TCR_Counter_Enable                          0x1
#define T1TCR_Counter_Enable_BIT                      0
#define T1TCR_Counter_Reset_MASK                      0x2
#define T1TCR_Counter_Reset                           0x2
#define T1TCR_Counter_Reset_BIT                       1

#define T1TC                                          ( *( volatile unsigned long * ) 0xE0008008 )
#define T1TC_OFFSET                                   0x8

#define T1PR                                          ( *( volatile unsigned long * ) 0xE000800C )
#define T1PR_OFFSET                                   0xC

#define T1PC                                          ( *( volatile unsigned long * ) 0xE0008010 )
#define T1PC_OFFSET                                   0x10

#define T1MCR                                         ( *( volatile unsigned short * ) 0xE0008014 )
#define T1MCR_OFFSET                                  0x14
#define T1MCR_MR0I_MASK                               0x1
#define T1MCR_MR0I                                    0x1
#define T1MCR_MR0I_BIT                                0
#define T1MCR_MR0R_MASK                               0x2
#define T1MCR_MR0R                                    0x2
#define T1MCR_MR0R_BIT                                1
#define T1MCR_MR0S_MASK                               0x4
#define T1MCR_MR0S                                    0x4
#define T1MCR_MR0S_BIT                                2
#define T1MCR_MR1I_MASK                               0x8
#define T1MCR_MR1I                                    0x8
#define T1MCR_MR1I_BIT                                3
#define T1MCR_MR1R_MASK                               0x10
#define T1MCR_MR1R                                    0x10
#define T1MCR_MR1R_BIT                                4
#define T1MCR_MR1S_MASK                               0x20
#define T1MCR_MR1S                                    0x20
#define T1MCR_MR1S_BIT                                5
#define T1MCR_MR2I_MASK                               0x40
#define T1MCR_MR2I                                    0x40
#define T1MCR_MR2I_BIT                                6
#define T1MCR_MR2R_MASK                               0x80
#define T1MCR_MR2R                                    0x80
#define T1MCR_MR2R_BIT                                7
#define T1MCR_MR2S_MASK                               0x100
#define T1MCR_MR2S                                    0x100
#define T1MCR_MR2S_BIT                                8
#define T1MCR_MR3I_MASK                               0x200
#define T1MCR_MR3I                                    0x200
#define T1MCR_MR3I_BIT                                9
#define T1MCR_MR3R_MASK                               0x400
#define T1MCR_MR3R                                    0x400
#define T1MCR_MR3R_BIT                                10
#define T1MCR_MR3S_MASK                               0x800
#define T1MCR_MR3S                                    0x800
#define T1MCR_MR3S_BIT                                11

#define T1MR0                                         ( *( volatile unsigned long * ) 0xE0008018 )
#define T1MR0_OFFSET                                  0x18

#define T1MR1                                         ( *( volatile unsigned long * ) 0xE000801C )
#define T1MR1_OFFSET                                  0x1C

#define T1MR2                                         ( *( volatile unsigned long * ) 0xE0008020 )
#define T1MR2_OFFSET                                  0x20

#define T1MR3                                         ( *( volatile unsigned long * ) 0xE0008024 )
#define T1MR3_OFFSET                                  0x24

