FreeRTOS/FreeRTOS/FreeRTOS/Demo/ARM7_LPC2138_Rowley/LPC21xx.h
#define T1CCR                                         ( *( volatile unsigned short * ) 0xE0008028 )
#define T1CCR_OFFSET                                  0x28
#define T1CCR_CAP0RE_MASK                             0x1
#define T1CCR_CAP0RE                                  0x1
#define T1CCR_CAP0RE_BIT                              0
#define T1CCR_CAP0FE_MASK                             0x2
#define T1CCR_CAP0FE                                  0x2
#define T1CCR_CAP0FE_BIT                              1
#define T1CCR_CAP0I_MASK                              0x4
#define T1CCR_CAP0I                                   0x4
#define T1CCR_CAP0I_BIT                               2
#define T1CCR_CAP1RE_MASK                             0x8
#define T1CCR_CAP1RE                                  0x8
#define T1CCR_CAP1RE_BIT                              3
#define T1CCR_CAP1FE_MASK                             0x10
#define T1CCR_CAP1FE                                  0x10
#define T1CCR_CAP1FE_BIT                              4
#define T1CCR_CAP1I_MASK                              0x20
#define T1CCR_CAP1I                                   0x20
#define T1CCR_CAP1I_BIT                               5
#define T1CCR_CAP2RE_MASK                             0x40
#define T1CCR_CAP2RE                                  0x40
#define T1CCR_CAP2RE_BIT                              6
#define T1CCR_CAP2FE_MASK                             0x80
#define T1CCR_CAP2FE                                  0x80
#define T1CCR_CAP2FE_BIT                              7
#define T1CCR_CAP2I_MASK                              0x100
#define T1CCR_CAP2I                                   0x100
#define T1CCR_CAP2I_BIT                               8
#define T1CCR_CAP3RE_MASK                             0x200
#define T1CCR_CAP3RE                                  0x200
#define T1CCR_CAP3RE_BIT                              9
#define T1CCR_CAP3FE_MASK                             0x400
#define T1CCR_CAP3FE                                  0x400
#define T1CCR_CAP3FE_BIT                              10
#define T1CCR_CAP3I_MASK                              0x800
#define T1CCR_CAP3I                                   0x800
#define T1CCR_CAP3I_BIT                               11

#define T1CR0                                         ( *( volatile unsigned long * ) 0xE000802C )
#define T1CR0_OFFSET                                  0x2C

#define T1CR1                                         ( *( volatile unsigned long * ) 0xE0008030 )
#define T1CR1_OFFSET                                  0x30

#define T1CR2                                         ( *( volatile unsigned long * ) 0xE0008034 )
#define T1CR2_OFFSET                                  0x34

#define T1CR3                                         ( *( volatile unsigned long * ) 0xE0008038 )
#define T1CR3_OFFSET                                  0x38

#define T1EMR                                         ( *( volatile unsigned short * ) 0xE000803C )
#define T1EMR_OFFSET                                  0x3C
#define T1EMR_EM0_MASK                                0x1
#define T1EMR_EM0                                     0x1
#define T1EMR_EM0_BIT                                 0
#define T1EMR_EM1_MASK                                0x2
#define T1EMR_EM1                                     0x2
#define T1EMR_EM1_BIT                                 1
#define T1EMR_EM2_MASK                                0x4
#define T1EMR_EM2                                     0x4
#define T1EMR_EM2_BIT                                 2
#define T1EMR_EM3_MASK                                0x8
#define T1EMR_EM3                                     0x8
#define T1EMR_EM3_BIT                                 3
#define T1EMR_EMC0_MASK                               0x30
#define T1EMR_EMC0_BIT                                4
#define T1EMR_EMC1_MASK                               0xC0
#define T1EMR_EMC1_BIT                                6
#define T1EMR_EMC2_MASK                               0x300
#define T1EMR_EMC2_BIT                                8
#define T1EMR_EMC3_MASK                               0xC00
#define T1EMR_EMC3_BIT                                10

#define T1CTCR                                        ( *( volatile unsigned long * ) 0xE0008070 )
#define T1CTCR_OFFSET                                 0x70
#define T1CTCR_Counter_Timer_Mode_MASK                0x3
#define T1CTCR_Counter_Timer_Mode_BIT                 0
#define T1CTCR_Count_Input_Select_MASK                0xC
#define T1CTCR_Count_Input_Select_BIT                 2

#define UART0_BASE                                    0xE000C000

#define U0RBR                                         ( *( volatile unsigned char * ) 0xE000C000 )
#define U0RBR_OFFSET                                  0x0

#define U0THR                                         ( *( volatile unsigned char * ) 0xE000C000 )
#define U0THR_OFFSET                                  0x0

#define U0DLL                                         ( *( volatile unsigned char * ) 0xE000C000 )
#define U0DLL_OFFSET                                  0x0

#define U0DLM                                         ( *( volatile unsigned char * ) 0xE000C004 )
#define U0DLM_OFFSET                                  0x4

#define U0IER                                         ( *( volatile unsigned long * ) 0xE000C004 )
#define U0IER_OFFSET                                  0x4
#define U0IER_RBR_Interrupt_Enable_MASK               0x1
#define U0IER_RBR_Interrupt_Enable                    0x1
#define U0IER_RBR_Interrupt_Enable_BIT                0
#define U0IER_THRE_Interrupt_Enable_MASK              0x2
#define U0IER_THRE_Interrupt_Enable                   0x2
#define U0IER_THRE_Interrupt_Enable_BIT               1
#define U0IER_Rx_Line_Status_Interrupt_Enable_MASK    0x4
#define U0IER_Rx_Line_Status_Interrupt_Enable         0x4
#define U0IER_Rx_Line_Status_Interrupt_Enable_BIT     2
#define U0IER_ABTOIntEn_MASK                          0x100
#define U0IER_ABTOIntEn                               0x100
#define U0IER_ABTOIntEn_BIT                           8
#define U0IER_ABEOIntEn_MASK                          0x200
#define U0IER_ABEOIntEn                               0x200
#define U0IER_ABEOIntEn_BIT                           9

#define U0IIR                                         ( *( volatile unsigned long * ) 0xE000C008 )
#define U0IIR_OFFSET                                  0x8
#define U0IIR_Interrupt_Pending_MASK                  0x1
#define U0IIR_Interrupt_Pending                       0x1
#define U0IIR_Interrupt_Pending_BIT                   0
#define U0IIR_Interrupt_Identification_MASK           0xE
#define U0IIR_Interrupt_Identification_BIT            1
#define U0IIR_FIFO_Enable_MASK                        0xC0
#define U0IIR_FIFO_Enable_BIT                         6
#define U0IIR_ABTOInt_MASK                            0x100
#define U0IIR_ABTOInt                                 0x100
#define U0IIR_ABTOInt_BIT                             8
#define U0IIR_ABEOInt_MASK                            0x200
#define U0IIR_ABEOInt                                 0x200
#define U0IIR_ABEOInt_BIT                             9

#define U0FCR                                         ( *( volatile unsigned char * ) 0xE000C008 )
#define U0FCR_OFFSET                                  0x8
#define U0FCR_FIFO_Enable_MASK                        0x1
#define U0FCR_FIFO_Enable                             0x1
#define U0FCR_FIFO_Enable_BIT                         0
#define U0FCR_Rx_FIFO_Reset_MASK                      0x2
#define U0FCR_Rx_FIFO_Reset                           0x2
#define U0FCR_Rx_FIFO_Reset_BIT                       1
#define U0FCR_Tx_FIFO_Reset_MASK                      0x4
#define U0FCR_Tx_FIFO_Reset                           0x4
#define U0FCR_Tx_FIFO_Reset_BIT                       2
#define U0FCR_Rx_Trigger_Level_Select_MASK            0xC0
#define U0FCR_Rx_Trigger_Level_Select_BIT             6

#define U0LCR                                         ( *( volatile unsigned char * ) 0xE000C00C )
#define U0LCR_OFFSET                                  0xC
#define U0LCR_Word_Length_Select_MASK                 0x3
#define U0LCR_Word_Length_Select_BIT                  0
#define U0LCR_Stop_Bit_Select_MASK                    0x4
#define U0LCR_Stop_Bit_Select                         0x4
#define U0LCR_Stop_Bit_Select_BIT                     2
#define U0LCR_Parity_Enable_MASK                      0x8
#define U0LCR_Parity_Enable                           0x8
#define U0LCR_Parity_Enable_BIT                       3
#define U0LCR_Parity_Select_MASK                      0x30
#define U0LCR_Parity_Select_BIT                       4
#define U0LCR_Break_Control_MASK                      0x40
#define U0LCR_Break_Control                           0x40
#define U0LCR_Break_Control_BIT                       6
#define U0LCR_Divisor_Latch_Access_Bit_MASK           0x80
#define U0LCR_Divisor_Latch_Access_Bit                0x80
#define U0LCR_Divisor_Latch_Access_Bit_BIT            7

#define U0LSR                                         ( *( volatile unsigned char * ) 0xE000C014 )
#define U0LSR_OFFSET                                  0x14
#define U0LSR_RDR_MASK                                0x1
#define U0LSR_RDR                                     0x1
#define U0LSR_RDR_BIT                                 0
#define U0LSR_OE_MASK                                 0x2
#define U0LSR_OE                                      0x2
#define U0LSR_OE_BIT                                  1
#define U0LSR_PE_MASK                                 0x4
#define U0LSR_PE                                      0x4
#define U0LSR_PE_BIT                                  2
#define U0LSR_FE_MASK                                 0x8
#define U0LSR_FE                                      0x8
#define U0LSR_FE_BIT                                  3
#define U0LSR_BI_MASK                                 0x10
#define U0LSR_BI                                      0x10
#define U0LSR_BI_BIT                                  4
#define U0LSR_THRE_MASK                               0x20
#define U0LSR_THRE                                    0x20
#define U0LSR_THRE_BIT                                5
#define U0LSR_TEMT_MASK                               0x40
#define U0LSR_TEMT                                    0x40
#define U0LSR_TEMT_BIT                                6
#define U0LSR_RXFE_MASK                               0x80
#define U0LSR_RXFE                                    0x80
#define U0LSR_RXFE_BIT                                7

#define U0SCR                                         ( *( volatile unsigned char * ) 0xE000C01C )
#define U0SCR_OFFSET                                  0x1C

