FreeRTOS/FreeRTOS/FreeRTOS/Demo/ARM7_LPC2138_Rowley/LPC21xx.h
#define U0ACR                                         ( *( volatile unsigned long * ) 0xE000C020 )
#define U0ACR_OFFSET                                  0x20
#define U0ACR_Start_MASK                              0x1
#define U0ACR_Start                                   0x1
#define U0ACR_Start_BIT                               0
#define U0ACR_Mode_MASK                               0x2
#define U0ACR_Mode                                    0x2
#define U0ACR_Mode_BIT                                1
#define U0ACR_AutoRestart_MASK                        0x4
#define U0ACR_AutoRestart                             0x4
#define U0ACR_AutoRestart_BIT                         2
#define U0ACR_ABEOIntClr_MASK                         0x100
#define U0ACR_ABEOIntClr                              0x100
#define U0ACR_ABEOIntClr_BIT                          8
#define U0ACR_ABTOIntClr_MASK                         0x200
#define U0ACR_ABTOIntClr                              0x200
#define U0ACR_ABTOIntClr_BIT                          9

#define U0FDR                                         ( *( volatile unsigned long * ) 0xE000C028 )
#define U0FDR_OFFSET                                  0x28
#define U0FDR_DIVADDVAL_MASK                          0xF
#define U0FDR_DIVADDVAL_BIT                           0
#define U0FDR_MULVAL_MASK                             0xF0
#define U0FDR_MULVAL_BIT                              4

#define U0TER                                         ( *( volatile unsigned char * ) 0xE000C030 )
#define U0TER_OFFSET                                  0x30
#define U0TER_TXEN_MASK                               0x80
#define U0TER_TXEN                                    0x80
#define U0TER_TXEN_BIT                                7

#define UART1_BASE                                    0xE0010000

#define U1RBR                                         ( *( volatile unsigned char * ) 0xE0010000 )
#define U1RBR_OFFSET                                  0x0

#define U1THR                                         ( *( volatile unsigned char * ) 0xE0010000 )
#define U1THR_OFFSET                                  0x0

#define U1DLL                                         ( *( volatile unsigned char * ) 0xE0010000 )
#define U1DLL_OFFSET                                  0x0

#define U1DLM                                         ( *( volatile unsigned char * ) 0xE0010004 )
#define U1DLM_OFFSET                                  0x4

#define U1IER                                         ( *( volatile unsigned long * ) 0xE0010004 )
#define U1IER_OFFSET                                  0x4
#define U1IER_RBR_Interrupt_Enable_MASK               0x1
#define U1IER_RBR_Interrupt_Enable                    0x1
#define U1IER_RBR_Interrupt_Enable_BIT                0
#define U1IER_THRE_Interrupt_Enable_MASK              0x2
#define U1IER_THRE_Interrupt_Enable                   0x2
#define U1IER_THRE_Interrupt_Enable_BIT               1
#define U1IER_Rx_Line_Status_Interrupt_Enable_MASK    0x4
#define U1IER_Rx_Line_Status_Interrupt_Enable         0x4
#define U1IER_Rx_Line_Status_Interrupt_Enable_BIT     2
#define U1IER_Modem_Status_Interrupt_Enable_MASK      0x8
#define U1IER_Modem_Status_Interrupt_Enable           0x8
#define U1IER_Modem_Status_Interrupt_Enable_BIT       3
#define U1IER_CTS_Interrupt_Enable_MASK               0x80
#define U1IER_CTS_Interrupt_Enable                    0x80
#define U1IER_CTS_Interrupt_Enable_BIT                7
#define U1IER_ABTOIntEn_MASK                          0x100
#define U1IER_ABTOIntEn                               0x100
#define U1IER_ABTOIntEn_BIT                           8
#define U1IER_ABEOIntEn_MASK                          0x200
#define U1IER_ABEOIntEn                               0x200
#define U1IER_ABEOIntEn_BIT                           9

#define U1IIR                                         ( *( volatile unsigned long * ) 0xE0010008 )
#define U1IIR_OFFSET                                  0x8
#define U1IIR_Interrupt_Pending_MASK                  0x1
#define U1IIR_Interrupt_Pending                       0x1
#define U1IIR_Interrupt_Pending_BIT                   0
#define U1IIR_Interrupt_Identification_MASK           0xE
#define U1IIR_Interrupt_Identification_BIT            1
#define U1IIR_FIFO_Enable_MASK                        0xC0
#define U1IIR_FIFO_Enable_BIT                         6
#define U1IIR_ABEOInt_MASK                            0x100
#define U1IIR_ABEOInt                                 0x100
#define U1IIR_ABEOInt_BIT                             8
#define U1IIR_ABTOInt_MASK                            0x200
#define U1IIR_ABTOInt                                 0x200
#define U1IIR_ABTOInt_BIT                             9

#define U1FCR                                         ( *( volatile unsigned char * ) 0xE0010008 )
#define U1FCR_OFFSET                                  0x8
#define U1FCR_FIFO_Enable_MASK                        0x1
#define U1FCR_FIFO_Enable                             0x1
#define U1FCR_FIFO_Enable_BIT                         0
#define U1FCR_Rx_FIFO_Reset_MASK                      0x2
#define U1FCR_Rx_FIFO_Reset                           0x2
#define U1FCR_Rx_FIFO_Reset_BIT                       1
#define U1FCR_Tx_FIFO_Reset_MASK                      0x4
#define U1FCR_Tx_FIFO_Reset                           0x4
#define U1FCR_Tx_FIFO_Reset_BIT                       2
#define U1FCR_Rx_Trigger_Level_Select_MASK            0xC0
#define U1FCR_Rx_Trigger_Level_Select_BIT             6

#define U1LCR                                         ( *( volatile unsigned char * ) 0xE001000C )
#define U1LCR_OFFSET                                  0xC
#define U1LCR_Word_Length_Select_MASK                 0x3
#define U1LCR_Word_Length_Select_BIT                  0
#define U1LCR_Stop_Bit_Select_MASK                    0x4
#define U1LCR_Stop_Bit_Select                         0x4
#define U1LCR_Stop_Bit_Select_BIT                     2
#define U1LCR_Parity_Enable_MASK                      0x8
#define U1LCR_Parity_Enable                           0x8
#define U1LCR_Parity_Enable_BIT                       3
#define U1LCR_Parity_Select_MASK                      0x30
#define U1LCR_Parity_Select_BIT                       4
#define U1LCR_Break_Control_MASK                      0x40
#define U1LCR_Break_Control                           0x40
#define U1LCR_Break_Control_BIT                       6
#define U1LCR_Divisor_Latch_Access_Bit_MASK           0x80
#define U1LCR_Divisor_Latch_Access_Bit                0x80
#define U1LCR_Divisor_Latch_Access_Bit_BIT            7

#define U1MCR                                         ( *( volatile unsigned char * ) 0xE0010010 )
#define U1MCR_OFFSET                                  0x10
#define U1MCR_DTR_Control_MASK                        0x1
#define U1MCR_DTR_Control                             0x1
#define U1MCR_DTR_Control_BIT                         0
#define U1MCR_RTS_Control_MASK                        0x2
#define U1MCR_RTS_Control                             0x2
#define U1MCR_RTS_Control_BIT                         1
#define U1MCR_Loopback_Mode_Select_MASK               0x10
#define U1MCR_Loopback_Mode_Select                    0x10
#define U1MCR_Loopback_Mode_Select_BIT                4
#define U1MCR_RTSen_MASK                              0x40
#define U1MCR_RTSen                                   0x40
#define U1MCR_RTSen_BIT                               6
#define U1MCR_CTSen_MASK                              0x80
#define U1MCR_CTSen                                   0x80
#define U1MCR_CTSen_BIT                               7

