FreeRTOS/FreeRTOS/FreeRTOS/Demo/ARM7_LPC2138_Rowley/LPC21xx.h
#define U1LSR                                         ( *( volatile unsigned char * ) 0xE0010014 )
#define U1LSR_OFFSET                                  0x14
#define U1LSR_RDR_MASK                                0x1
#define U1LSR_RDR                                     0x1
#define U1LSR_RDR_BIT                                 0
#define U1LSR_OE_MASK                                 0x2
#define U1LSR_OE                                      0x2
#define U1LSR_OE_BIT                                  1
#define U1LSR_PE_MASK                                 0x4
#define U1LSR_PE                                      0x4
#define U1LSR_PE_BIT                                  2
#define U1LSR_FE_MASK                                 0x8
#define U1LSR_FE                                      0x8
#define U1LSR_FE_BIT                                  3
#define U1LSR_BI_MASK                                 0x10
#define U1LSR_BI                                      0x10
#define U1LSR_BI_BIT                                  4
#define U1LSR_THRE_MASK                               0x20
#define U1LSR_THRE                                    0x20
#define U1LSR_THRE_BIT                                5
#define U1LSR_TEMT_MASK                               0x40
#define U1LSR_TEMT                                    0x40
#define U1LSR_TEMT_BIT                                6
#define U1LSR_RXFE_MASK                               0x80
#define U1LSR_RXFE                                    0x80
#define U1LSR_RXFE_BIT                                7

#define U1MSR                                         ( *( volatile unsigned char * ) 0xE0010018 )
#define U1MSR_OFFSET                                  0x18
#define U1MSR_Delta_CTS_MASK                          0x1
#define U1MSR_Delta_CTS                               0x1
#define U1MSR_Delta_CTS_BIT                           0
#define U1MSR_Delta_DSR_MASK                          0x2
#define U1MSR_Delta_DSR                               0x2
#define U1MSR_Delta_DSR_BIT                           1
#define U1MSR_Trailing_Edge_RI_MASK                   0x4
#define U1MSR_Trailing_Edge_RI                        0x4
#define U1MSR_Trailing_Edge_RI_BIT                    2
#define U1MSR_Delta_DCD_MASK                          0x8
#define U1MSR_Delta_DCD                               0x8
#define U1MSR_Delta_DCD_BIT                           3
#define U1MSR_CTS_MASK                                0x10
#define U1MSR_CTS                                     0x10
#define U1MSR_CTS_BIT                                 4
#define U1MSR_DSR_MASK                                0x20
#define U1MSR_DSR                                     0x20
#define U1MSR_DSR_BIT                                 5
#define U1MSR_RI_MASK                                 0x40
#define U1MSR_RI                                      0x40
#define U1MSR_RI_BIT                                  6
#define U1MSR_DCD_MASK                                0x80
#define U1MSR_DCD                                     0x80
#define U1MSR_DCD_BIT                                 7

#define U1SCR                                         ( *( volatile unsigned char * ) 0xE001001C )
#define U1SCR_OFFSET                                  0x1C

#define U1ACR                                         ( *( volatile unsigned long * ) 0xE0010020 )
#define U1ACR_OFFSET                                  0x20
#define U1ACR_Start_MASK                              0x1
#define U1ACR_Start                                   0x1
#define U1ACR_Start_BIT                               0
#define U1ACR_Mode_MASK                               0x2
#define U1ACR_Mode                                    0x2
#define U1ACR_Mode_BIT                                1
#define U1ACR_AutoRestart_MASK                        0x4
#define U1ACR_AutoRestart                             0x4
#define U1ACR_AutoRestart_BIT                         2
#define U1ACR_ABEOIntClr_MASK                         0x100
#define U1ACR_ABEOIntClr                              0x100
#define U1ACR_ABEOIntClr_BIT                          8
#define U1ACR_ABTOIntClr_MASK                         0x200
#define U1ACR_ABTOIntClr                              0x200
#define U1ACR_ABTOIntClr_BIT                          9

#define U1FDR                                         ( *( volatile unsigned long * ) 0xE0010028 )
#define U1FDR_OFFSET                                  0x28
#define U1FDR_DIVADDVAL_MASK                          0xF
#define U1FDR_DIVADDVAL_BIT                           0
#define U1FDR_MULVAL_MASK                             0xF0
#define U1FDR_MULVAL_BIT                              4

#define U1TER                                         ( *( volatile unsigned char * ) 0xE0010030 )
#define U1TER_OFFSET                                  0x30
#define U1TER_TXEN_MASK                               0x80
#define U1TER_TXEN                                    0x80
#define U1TER_TXEN_BIT                                7

#define PWM_BASE                                      0xE0014000

#define PWMIR                                         ( *( volatile unsigned long * ) 0xE0014000 )
#define PWMIR_OFFSET                                  0x0
#define PWMIR_PWMMR0_Interrupt_MASK                   0x1
#define PWMIR_PWMMR0_Interrupt                        0x1
#define PWMIR_PWMMR0_Interrupt_BIT                    0
#define PWMIR_PWMMR1_Interrupt_MASK                   0x2
#define PWMIR_PWMMR1_Interrupt                        0x2
#define PWMIR_PWMMR1_Interrupt_BIT                    1
#define PWMIR_PWMMR2_Interrupt_MASK                   0x4
#define PWMIR_PWMMR2_Interrupt                        0x4
#define PWMIR_PWMMR2_Interrupt_BIT                    2
#define PWMIR_PWMMR3_Interrupt_MASK                   0x8
#define PWMIR_PWMMR3_Interrupt                        0x8
#define PWMIR_PWMMR3_Interrupt_BIT                    3
#define PWMIR_PWMMR4_Interrupt_MASK                   0x100
#define PWMIR_PWMMR4_Interrupt                        0x100
#define PWMIR_PWMMR4_Interrupt_BIT                    8
#define PWMIR_PWMMR5_Interrupt_MASK                   0x200
#define PWMIR_PWMMR5_Interrupt                        0x200
#define PWMIR_PWMMR5_Interrupt_BIT                    9
#define PWMIR_PWMMR6_Interrupt_MASK                   0x400
#define PWMIR_PWMMR6_Interrupt                        0x400
#define PWMIR_PWMMR6_Interrupt_BIT                    10

#define PWMTCR                                        ( *( volatile unsigned long * ) 0xE0014004 )
#define PWMTCR_OFFSET                                 0x4
#define PWMTCR_Counter_Enable_MASK                    0x1
#define PWMTCR_Counter_Enable                         0x1
#define PWMTCR_Counter_Enable_BIT                     0
#define PWMTCR_Counter_Reset_MASK                     0x2
#define PWMTCR_Counter_Reset                          0x2
#define PWMTCR_Counter_Reset_BIT                      1
#define PWMTCR_PWM_Enable_MASK                        0x8
#define PWMTCR_PWM_Enable                             0x8
#define PWMTCR_PWM_Enable_BIT                         3

#define PWMTC                                         ( *( volatile unsigned long * ) 0xE0014008 )
#define PWMTC_OFFSET                                  0x8

#define PWMPR                                         ( *( volatile unsigned long * ) 0xE001400C )
#define PWMPR_OFFSET                                  0xC

#define PWMPC                                         ( *( volatile unsigned long * ) 0xE0014010 )
#define PWMPC_OFFSET                                  0x10

#define PWMMCR                                        ( *( volatile unsigned long * ) 0xE0014014 )
#define PWMMCR_OFFSET                                 0x14
#define PWMMCR_PWMMR0I_MASK                           0x1
#define PWMMCR_PWMMR0I                                0x1
#define PWMMCR_PWMMR0I_BIT                            0
#define PWMMCR_PWMMR0R_MASK                           0x2
#define PWMMCR_PWMMR0R                                0x2
#define PWMMCR_PWMMR0R_BIT                            1
#define PWMMCR_PWMMR0S_MASK                           0x4
#define PWMMCR_PWMMR0S                                0x4
#define PWMMCR_PWMMR0S_BIT                            2
#define PWMMCR_PWMMR1I_MASK                           0x8
#define PWMMCR_PWMMR1I                                0x8
#define PWMMCR_PWMMR1I_BIT                            3
#define PWMMCR_PWMMR1R_MASK                           0x10
#define PWMMCR_PWMMR1R                                0x10
#define PWMMCR_PWMMR1R_BIT                            4
#define PWMMCR_PWMMR1S_MASK                           0x20
#define PWMMCR_PWMMR1S                                0x20
#define PWMMCR_PWMMR1S_BIT                            5
#define PWMMCR_PWMMR2I_MASK                           0x40
#define PWMMCR_PWMMR2I                                0x40
#define PWMMCR_PWMMR2I_BIT                            6
#define PWMMCR_PWMMR2R_MASK                           0x80
#define PWMMCR_PWMMR2R                                0x80
#define PWMMCR_PWMMR2R_BIT                            7
#define PWMMCR_PWMMR2S_MASK                           0x100
#define PWMMCR_PWMMR2S                                0x100
#define PWMMCR_PWMMR2S_BIT                            8
#define PWMMCR_PWMMR3I_MASK                           0x200
#define PWMMCR_PWMMR3I                                0x200
#define PWMMCR_PWMMR3I_BIT                            9
#define PWMMCR_PWMMR3R_MASK                           0x400
#define PWMMCR_PWMMR3R                                0x400
#define PWMMCR_PWMMR3R_BIT                            10
#define PWMMCR_PWMMR3S_MASK                           0x800
#define PWMMCR_PWMMR3S                                0x800
#define PWMMCR_PWMMR3S_BIT                            11
#define PWMMCR_PWMMR4I_MASK                           0x1000
#define PWMMCR_PWMMR4I                                0x1000
#define PWMMCR_PWMMR4I_BIT                            12
#define PWMMCR_PWMMR4R_MASK                           0x2000
#define PWMMCR_PWMMR4R                                0x2000
#define PWMMCR_PWMMR4R_BIT                            13
#define PWMMCR_PWMMR4S_MASK                           0x4000
#define PWMMCR_PWMMR4S                                0x4000
#define PWMMCR_PWMMR4S_BIT                            14
#define PWMMCR_PWMMR5I_MASK                           0x8000
#define PWMMCR_PWMMR5I                                0x8000
#define PWMMCR_PWMMR5I_BIT                            15
#define PWMMCR_PWMMR5R_MASK                           0x10000
#define PWMMCR_PWMMR5R                                0x10000
#define PWMMCR_PWMMR5R_BIT                            16
#define PWMMCR_PWMMR5S_MASK                           0x20000
#define PWMMCR_PWMMR5S                                0x20000
#define PWMMCR_PWMMR5S_BIT                            17
#define PWMMCR_PWMMR6I_MASK                           0x40000
#define PWMMCR_PWMMR6I                                0x40000
#define PWMMCR_PWMMR6I_BIT                            18
#define PWMMCR_PWMMR6R_MASK                           0x80000
#define PWMMCR_PWMMR6R                                0x80000
#define PWMMCR_PWMMR6R_BIT                            19
#define PWMMCR_PWMMR6S_MASK                           0x100000
#define PWMMCR_PWMMR6S                                0x100000
#define PWMMCR_PWMMR6S_BIT                            20

#define PWMMR0                                        ( *( volatile unsigned long * ) 0xE0014018 )
#define PWMMR0_OFFSET                                 0x18

#define PWMMR1                                        ( *( volatile unsigned long * ) 0xE001401C )
#define PWMMR1_OFFSET                                 0x1C

#define PWMMR2                                        ( *( volatile unsigned long * ) 0xE0014020 )
#define PWMMR2_OFFSET                                 0x20

