FreeRTOS/FreeRTOS/FreeRTOS/Demo/ARM7_LPC2138_Rowley/LPC21xx.h
#define PWMMR3                                        ( *( volatile unsigned long * ) 0xE0014024 )
#define PWMMR3_OFFSET                                 0x24

#define PWMMR4                                        ( *( volatile unsigned long * ) 0xE0014040 )
#define PWMMR4_OFFSET                                 0x40

#define PWMMR5                                        ( *( volatile unsigned long * ) 0xE0014044 )
#define PWMMR5_OFFSET                                 0x44

#define PWMMR6                                        ( *( volatile unsigned long * ) 0xE0014048 )
#define PWMMR6_OFFSET                                 0x48

#define PWMPCR                                        ( *( volatile unsigned long * ) 0xE001404C )
#define PWMPCR_OFFSET                                 0x4C
#define PWMPCR_PWMSEL2_MASK                           0x4
#define PWMPCR_PWMSEL2                                0x4
#define PWMPCR_PWMSEL2_BIT                            2
#define PWMPCR_PWMSEL3_MASK                           0x8
#define PWMPCR_PWMSEL3                                0x8
#define PWMPCR_PWMSEL3_BIT                            3
#define PWMPCR_PWMSEL4_MASK                           0x10
#define PWMPCR_PWMSEL4                                0x10
#define PWMPCR_PWMSEL4_BIT                            4
#define PWMPCR_PWMSEL5_MASK                           0x20
#define PWMPCR_PWMSEL5                                0x20
#define PWMPCR_PWMSEL5_BIT                            5
#define PWMPCR_PWMSEL6_MASK                           0x40
#define PWMPCR_PWMSEL6                                0x40
#define PWMPCR_PWMSEL6_BIT                            6
#define PWMPCR_PWMENA1_MASK                           0x200
#define PWMPCR_PWMENA1                                0x200
#define PWMPCR_PWMENA1_BIT                            9
#define PWMPCR_PWMENA2_MASK                           0x400
#define PWMPCR_PWMENA2                                0x400
#define PWMPCR_PWMENA2_BIT                            10
#define PWMPCR_PWMENA3_MASK                           0x800
#define PWMPCR_PWMENA3                                0x800
#define PWMPCR_PWMENA3_BIT                            11
#define PWMPCR_PWMENA4_MASK                           0x1000
#define PWMPCR_PWMENA4                                0x1000
#define PWMPCR_PWMENA4_BIT                            12
#define PWMPCR_PWMENA5_MASK                           0x2000
#define PWMPCR_PWMENA5                                0x2000
#define PWMPCR_PWMENA5_BIT                            13
#define PWMPCR_PWMENA6_MASK                           0x4000
#define PWMPCR_PWMENA6                                0x4000
#define PWMPCR_PWMENA6_BIT                            14

#define PWMLER                                        ( *( volatile unsigned long * ) 0xE0014050 )
#define PWMLER_OFFSET                                 0x50
#define PWMLER_Enable_PWM_Match_0_Latch_MASK          0x1
#define PWMLER_Enable_PWM_Match_0_Latch               0x1
#define PWMLER_Enable_PWM_Match_0_Latch_BIT           0
#define PWMLER_Enable_PWM_Match_1_Latch_MASK          0x2
#define PWMLER_Enable_PWM_Match_1_Latch               0x2
#define PWMLER_Enable_PWM_Match_1_Latch_BIT           1
#define PWMLER_Enable_PWM_Match_2_Latch_MASK          0x4
#define PWMLER_Enable_PWM_Match_2_Latch               0x4
#define PWMLER_Enable_PWM_Match_2_Latch_BIT           2
#define PWMLER_Enable_PWM_Match_3_Latch_MASK          0x8
#define PWMLER_Enable_PWM_Match_3_Latch               0x8
#define PWMLER_Enable_PWM_Match_3_Latch_BIT           3
#define PWMLER_Enable_PWM_Match_4_Latch_MASK          0x10
#define PWMLER_Enable_PWM_Match_4_Latch               0x10
#define PWMLER_Enable_PWM_Match_4_Latch_BIT           4
#define PWMLER_Enable_PWM_Match_5_Latch_MASK          0x20
#define PWMLER_Enable_PWM_Match_5_Latch               0x20
#define PWMLER_Enable_PWM_Match_5_Latch_BIT           5
#define PWMLER_Enable_PWM_Match_6_Latch_MASK          0x40
#define PWMLER_Enable_PWM_Match_6_Latch               0x40
#define PWMLER_Enable_PWM_Match_6_Latch_BIT           6

#define I2C_BASE                                      0xE001C000

#define I2CONSET                                      ( *( volatile unsigned char * ) 0xE001C000 )
#define I2CONSET_OFFSET                               0x0
#define I2CONSET_AA_MASK                              0x4
#define I2CONSET_AA                                   0x4
#define I2CONSET_AA_BIT                               2
#define I2CONSET_SI_MASK                              0x8
#define I2CONSET_SI                                   0x8
#define I2CONSET_SI_BIT                               3
#define I2CONSET_STO_MASK                             0x10
#define I2CONSET_STO                                  0x10
#define I2CONSET_STO_BIT                              4
#define I2CONSET_STA_MASK                             0x20
#define I2CONSET_STA                                  0x20
#define I2CONSET_STA_BIT                              5
#define I2CONSET_I2EN_MASK                            0x40
#define I2CONSET_I2EN                                 0x40
#define I2CONSET_I2EN_BIT                             6

#define I2STAT                                        ( *( volatile unsigned char * ) 0xE001C004 )
#define I2STAT_OFFSET                                 0x4
#define I2STAT_Status_MASK                            0xF8
#define I2STAT_Status_BIT                             3

#define I2DAT                                         ( *( volatile unsigned char * ) 0xE001C008 )
#define I2DAT_OFFSET                                  0x8

#define I2ADR                                         ( *( volatile unsigned char * ) 0xE001C00C )
#define I2ADR_OFFSET                                  0xC
#define I2ADR_GC_MASK                                 0x1
#define I2ADR_GC                                      0x1
#define I2ADR_GC_BIT                                  0
#define I2ADR_Address_MASK                            0x7E
#define I2ADR_Address_BIT                             1

#define I2SCLH                                        ( *( volatile unsigned short * ) 0xE001C010 )
#define I2SCLH_OFFSET                                 0x10

#define I2SCLL                                        ( *( volatile unsigned short * ) 0xE001C014 )
#define I2SCLL_OFFSET                                 0x14

#define I2CONCLR                                      ( *( volatile unsigned char * ) 0xE001C018 )
#define I2CONCLR_OFFSET                               0x18
#define I2CONCLR_AAC_MASK                             0x4
#define I2CONCLR_AAC                                  0x4
#define I2CONCLR_AAC_BIT                              2
#define I2CONCLR_SIC_MASK                             0x8
#define I2CONCLR_SIC                                  0x8
#define I2CONCLR_SIC_BIT                              3
#define I2CONCLR_STAC_MASK                            0x20
#define I2CONCLR_STAC                                 0x20
#define I2CONCLR_STAC_BIT                             5
#define I2CONCLR_I2ENC_MASK                           0x40
#define I2CONCLR_I2ENC                                0x40
#define I2CONCLR_I2ENC_BIT                            6

#define SPI0_BASE                                     0xE0020000

#define S0SPCR                                        ( *( volatile unsigned short * ) 0xE0020000 )
#define S0SPCR_OFFSET                                 0x0
#define S0SPCR_BitEnable_MASK                         0x4
#define S0SPCR_BitEnable                              0x4
#define S0SPCR_BitEnable_BIT                          2
#define S0SPCR_CPHA_MASK                              0x8
#define S0SPCR_CPHA                                   0x8
#define S0SPCR_CPHA_BIT                               3
#define S0SPCR_CPOL_MASK                              0x10
#define S0SPCR_CPOL                                   0x10
#define S0SPCR_CPOL_BIT                               4
#define S0SPCR_MSTR_MASK                              0x20
#define S0SPCR_MSTR                                   0x20
#define S0SPCR_MSTR_BIT                               5
#define S0SPCR_LSBF_MASK                              0x40
#define S0SPCR_LSBF                                   0x40
#define S0SPCR_LSBF_BIT                               6
#define S0SPCR_SPIE_MASK                              0x80
#define S0SPCR_SPIE                                   0x80
#define S0SPCR_SPIE_BIT                               7
#define S0SPCR_BITS_MASK                              0xF00
#define S0SPCR_BITS_BIT                               8

