FreeRTOS/FreeRTOS/FreeRTOS/Demo/ARM7_LPC2138_Rowley/LPC21xx.h
#define S0SPSR                                        ( *( volatile unsigned char * ) 0xE0020004 )
#define S0SPSR_OFFSET                                 0x4
#define S0SPSR_ABRT_MASK                              0x8
#define S0SPSR_ABRT                                   0x8
#define S0SPSR_ABRT_BIT                               3
#define S0SPSR_MODF_MASK                              0x10
#define S0SPSR_MODF                                   0x10
#define S0SPSR_MODF_BIT                               4
#define S0SPSR_ROVR_MASK                              0x20
#define S0SPSR_ROVR                                   0x20
#define S0SPSR_ROVR_BIT                               5
#define S0SPSR_WCOL_MASK                              0x40
#define S0SPSR_WCOL                                   0x40
#define S0SPSR_WCOL_BIT                               6
#define S0SPSR_SPIF_MASK                              0x80
#define S0SPSR_SPIF                                   0x80
#define S0SPSR_SPIF_BIT                               7

#define S0SPDR                                        ( *( volatile unsigned short * ) 0xE0020008 )
#define S0SPDR_OFFSET                                 0x8

#define S0SPCCR                                       ( *( volatile unsigned char * ) 0xE002000C )
#define S0SPCCR_OFFSET                                0xC

#define S0SPINT                                       ( *( volatile unsigned char * ) 0xE002001C )
#define S0SPINT_OFFSET                                0x1C

#define RTC_BASE                                      0xE0024000

#define ILR                                           ( *( volatile unsigned long * ) 0xE0024000 )
#define ILR_OFFSET                                    0x0
#define ILR_RTCCIF_MASK                               0x1
#define ILR_RTCCIF                                    0x1
#define ILR_RTCCIF_BIT                                0
#define ILR_RTCALF_MASK                               0x2
#define ILR_RTCALF                                    0x2
#define ILR_RTCALF_BIT                                1

#define CTC                                           ( *( volatile unsigned long * ) 0xE0024004 )
#define CTC_OFFSET                                    0x4
#define CTC_Clock_Tick_Counter_MASK                   0xFFFE
#define CTC_Clock_Tick_Counter_BIT                    1

#define CCR                                           ( *( volatile unsigned long * ) 0xE0024008 )
#define CCR_OFFSET                                    0x8
#define CCR_CLKEN_MASK                                0x1
#define CCR_CLKEN                                     0x1
#define CCR_CLKEN_BIT                                 0
#define CCR_CTCRST_MASK                               0x2
#define CCR_CTCRST                                    0x2
#define CCR_CTCRST_BIT                                1
#define CCR_CTTEST_MASK                               0xC
#define CCR_CTTEST_BIT                                2

#define CIIR                                          ( *( volatile unsigned long * ) 0xE002400C )
#define CIIR_OFFSET                                   0xC
#define CIIR_IMSEC_MASK                               0x1
#define CIIR_IMSEC                                    0x1
#define CIIR_IMSEC_BIT                                0
#define CIIR_IMMIN_MASK                               0x2
#define CIIR_IMMIN                                    0x2
#define CIIR_IMMIN_BIT                                1
#define CIIR_IMHOUR_MASK                              0x4
#define CIIR_IMHOUR                                   0x4
#define CIIR_IMHOUR_BIT                               2
#define CIIR_IMDOM_MASK                               0x8
#define CIIR_IMDOM                                    0x8
#define CIIR_IMDOM_BIT                                3
#define CIIR_IMDOW_MASK                               0x10
#define CIIR_IMDOW                                    0x10
#define CIIR_IMDOW_BIT                                4
#define CIIR_IMDOY_MASK                               0x20
#define CIIR_IMDOY                                    0x20
#define CIIR_IMDOY_BIT                                5
#define CIIR_IMMON_MASK                               0x40
#define CIIR_IMMON                                    0x40
#define CIIR_IMMON_BIT                                6
#define CIIR_IMYEAR_MASK                              0x80
#define CIIR_IMYEAR                                   0x80
#define CIIR_IMYEAR_BIT                               7

#define AMR                                           ( *( volatile unsigned long * ) 0xE0024010 )
#define AMR_OFFSET                                    0x10
#define AMR_AMRSEC_MASK                               0x1
#define AMR_AMRSEC                                    0x1
#define AMR_AMRSEC_BIT                                0
#define AMR_AMRMIN_MASK                               0x2
#define AMR_AMRMIN                                    0x2
#define AMR_AMRMIN_BIT                                1
#define AMR_AMRHOUR_MASK                              0x4
#define AMR_AMRHOUR                                   0x4
#define AMR_AMRHOUR_BIT                               2
#define AMR_AMRDOM_MASK                               0x8
#define AMR_AMRDOM                                    0x8
#define AMR_AMRDOM_BIT                                3
#define AMR_AMRDOW_MASK                               0x10
#define AMR_AMRDOW                                    0x10
#define AMR_AMRDOW_BIT                                4
#define AMR_AMRDOY_MASK                               0x20
#define AMR_AMRDOY                                    0x20
#define AMR_AMRDOY_BIT                                5
#define AMR_AMRMON_MASK                               0x40
#define AMR_AMRMON                                    0x40
#define AMR_AMRMON_BIT                                6
#define AMR_AMRYEAR_MASK                              0x80
#define AMR_AMRYEAR                                   0x80
#define AMR_AMRYEAR_BIT                               7

#define CTIME0                                        ( *( volatile unsigned long * ) 0xE0024014 )
#define CTIME0_OFFSET                                 0x14
#define CTIME0_Seconds_MASK                           0x3F
#define CTIME0_Seconds_BIT                            0
#define CTIME0_Minutes_MASK                           0x3F00
#define CTIME0_Minutes_BIT                            8
#define CTIME0_Hours_MASK                             0x1F0000
#define CTIME0_Hours_BIT                              16
#define CTIME0_Day_of_Week_MASK                       0x7000000
#define CTIME0_Day_of_Week_BIT                        24

