FreeRTOS/FreeRTOS/FreeRTOS/Demo/ARM7_LPC2138_Rowley/LPC21xx.h
#define CTIME1                                        ( *( volatile unsigned long * ) 0xE0024018 )
#define CTIME1_OFFSET                                 0x18
#define CTIME1_Day_of_Month_MASK                      0x1F
#define CTIME1_Day_of_Month_BIT                       0
#define CTIME1_Month_MASK                             0xF00
#define CTIME1_Month_BIT                              8
#define CTIME1_Year_MASK                              0xFFF0000
#define CTIME1_Year_BIT                               16

#define CTIME2                                        ( *( volatile unsigned long * ) 0xE002401C )
#define CTIME2_OFFSET                                 0x1C
#define CTIME2_Day_of_Year_MASK                       0xFFF
#define CTIME2_Day_of_Year_BIT                        0

#define SEC                                           ( *( volatile unsigned long * ) 0xE0024020 )
#define SEC_OFFSET                                    0x20

#define MIN                                           ( *( volatile unsigned long * ) 0xE0024024 )
#define MIN_OFFSET                                    0x24

#define HOUR                                          ( *( volatile unsigned long * ) 0xE0024028 )
#define HOUR_OFFSET                                   0x28

#define DOM                                           ( *( volatile unsigned long * ) 0xE002402C )
#define DOM_OFFSET                                    0x2C

#define DOW                                           ( *( volatile unsigned long * ) 0xE0024030 )
#define DOW_OFFSET                                    0x30

#define DOY                                           ( *( volatile unsigned long * ) 0xE0024034 )
#define DOY_OFFSET                                    0x34

#define MONTH                                         ( *( volatile unsigned long * ) 0xE0024038 )
#define MONTH_OFFSET                                  0x38

#define YEAR                                          ( *( volatile unsigned long * ) 0xE002403C )
#define YEAR_OFFSET                                   0x3C

#define ALSEC                                         ( *( volatile unsigned long * ) 0xE0024060 )
#define ALSEC_OFFSET                                  0x60

#define ALMIN                                         ( *( volatile unsigned long * ) 0xE0024064 )
#define ALMIN_OFFSET                                  0x64

#define ALHOUR                                        ( *( volatile unsigned long * ) 0xE0024068 )
#define ALHOUR_OFFSET                                 0x68

#define ALDOM                                         ( *( volatile unsigned long * ) 0xE002406C )
#define ALDOM_OFFSET                                  0x6C

#define ALDOW                                         ( *( volatile unsigned long * ) 0xE0024070 )
#define ALDOW_OFFSET                                  0x70

#define ALDOY                                         ( *( volatile unsigned long * ) 0xE0024074 )
#define ALDOY_OFFSET                                  0x74

#define ALMON                                         ( *( volatile unsigned long * ) 0xE0024078 )
#define ALMON_OFFSET                                  0x78

#define ALYEAR                                        ( *( volatile unsigned long * ) 0xE002407C )
#define ALYEAR_OFFSET                                 0x7C

#define PREINT                                        ( *( volatile unsigned long * ) 0xE0024080 )
#define PREINT_OFFSET                                 0x80

#define PREFRAC                                       ( *( volatile unsigned long * ) 0xE0024084 )
#define PREFRAC_OFFSET                                0x84

#define GPIO_BASE                                     0xE0028000

#define IO0PIN                                        ( *( volatile unsigned long * ) 0xE0028000 )
#define IO0PIN_OFFSET                                 0x0

#define IO0SET                                        ( *( volatile unsigned long * ) 0xE0028004 )
#define IO0SET_OFFSET                                 0x4

#define IO0DIR                                        ( *( volatile unsigned long * ) 0xE0028008 )
#define IO0DIR_OFFSET                                 0x8

#define IO0CLR                                        ( *( volatile unsigned long * ) 0xE002800C )
#define IO0CLR_OFFSET                                 0xC

#define IO1PIN                                        ( *( volatile unsigned long * ) 0xE0028010 )
#define IO1PIN_OFFSET                                 0x10

#define IO1SET                                        ( *( volatile unsigned long * ) 0xE0028014 )
#define IO1SET_OFFSET                                 0x14

#define IO1DIR                                        ( *( volatile unsigned long * ) 0xE0028018 )
#define IO1DIR_OFFSET                                 0x18

#define IO1CLR                                        ( *( volatile unsigned long * ) 0xE002801C )
#define IO1CLR_OFFSET                                 0x1C

#define PCB_BASE                                      0xE002C000

#define PINSEL0                                       ( *( volatile unsigned long * ) 0xE002C000 )
#define PINSEL0_OFFSET                                0x0
#define PINSEL0_P0_0_MASK                             0x3
#define PINSEL0_P0_0_BIT                              0
#define PINSEL0_P0_1_MASK                             0xC
#define PINSEL0_P0_1_BIT                              2
#define PINSEL0_P0_2_MASK                             0x30
#define PINSEL0_P0_2_BIT                              4
#define PINSEL0_P0_3_MASK                             0xC0
#define PINSEL0_P0_3_BIT                              6
#define PINSEL0_P0_4_MASK                             0x300
#define PINSEL0_P0_4_BIT                              8
#define PINSEL0_P0_5_MASK                             0xC00
#define PINSEL0_P0_5_BIT                              10
#define PINSEL0_P0_6_MASK                             0x3000
#define PINSEL0_P0_6_BIT                              12
#define PINSEL0_P0_7_MASK                             0xC000
#define PINSEL0_P0_7_BIT                              14
#define PINSEL0_P0_8_MASK                             0x30000
#define PINSEL0_P0_8_BIT                              16
#define PINSEL0_P0_9_MASK                             0xC0000
#define PINSEL0_P0_9_BIT                              18
#define PINSEL0_P0_10_MASK                            0x300000
#define PINSEL0_P0_10_BIT                             20
#define PINSEL0_P0_11_MASK                            0xC00000
#define PINSEL0_P0_11_BIT                             22
#define PINSEL0_P0_12_MASK                            0x3000000
#define PINSEL0_P0_12_BIT                             24
#define PINSEL0_P0_13_MASK                            0xC000000
#define PINSEL0_P0_13_BIT                             26
#define PINSEL0_P0_14_MASK                            0x30000000
#define PINSEL0_P0_14_BIT                             28
#define PINSEL0_P0_15_MASK                            0xC0000000
#define PINSEL0_P0_15_BIT                             30

