FreeRTOS/FreeRTOS/FreeRTOS/Demo/ARM7_LPC2138_Rowley/LPC21xx.h
#define PINSEL1                                       ( *( volatile unsigned long * ) 0xE002C004 )
#define PINSEL1_OFFSET                                0x4
#define PINSEL1_P0_16_MASK                            0x3
#define PINSEL1_P0_16_BIT                             0
#define PINSEL1_P0_17_MASK                            0xC
#define PINSEL1_P0_17_BIT                             2
#define PINSEL1_P0_18_MASK                            0x30
#define PINSEL1_P0_18_BIT                             4
#define PINSEL1_P0_19_MASK                            0xC0
#define PINSEL1_P0_19_BIT                             6
#define PINSEL1_P0_20_MASK                            0x300
#define PINSEL1_P0_20_BIT                             8
#define PINSEL1_P0_21_MASK                            0xC00
#define PINSEL1_P0_21_BIT                             10
#define PINSEL1_P0_22_MASK                            0x3000
#define PINSEL1_P0_22_BIT                             12
#define PINSEL1_P0_23_MASK                            0xC000
#define PINSEL1_P0_23_BIT                             14
#define PINSEL1_P0_24_MASK                            0x30000
#define PINSEL1_P0_24_BIT                             16
#define PINSEL1_P0_25_MASK                            0xC0000
#define PINSEL1_P0_25_BIT                             18
#define PINSEL1_P0_26_MASK                            0x300000
#define PINSEL1_P0_26_BIT                             20
#define PINSEL1_P0_27_MASK                            0xC00000
#define PINSEL1_P0_27_BIT                             22
#define PINSEL1_P0_28_MASK                            0x3000000
#define PINSEL1_P0_28_BIT                             24
#define PINSEL1_P0_29_MASK                            0xC000000
#define PINSEL1_P0_29_BIT                             26
#define PINSEL1_P0_30_MASK                            0x30000000
#define PINSEL1_P0_30_BIT                             28
#define PINSEL1_P0_31_MASK                            0xC0000000
#define PINSEL1_P0_31_BIT                             30

#define PINSEL2                                       ( *( volatile unsigned long * ) 0xE002C014 )
#define PINSEL2_OFFSET                                0x14
#define PINSEL2_GPIO_DEBUG_MASK                       0x4
#define PINSEL2_GPIO_DEBUG                            0x4
#define PINSEL2_GPIO_DEBUG_BIT                        2
#define PINSEL2_GPIO_TRACE_MASK                       0x8
#define PINSEL2_GPIO_TRACE                            0x8
#define PINSEL2_GPIO_TRACE_BIT                        3

#define SPI1_BASE                                     0xE0030000

#define S1SPCR                                        ( *( volatile unsigned short * ) 0xE0030000 )
#define S1SPCR_OFFSET                                 0x0
#define S1SPCR_BitEnable_MASK                         0x4
#define S1SPCR_BitEnable                              0x4
#define S1SPCR_BitEnable_BIT                          2
#define S1SPCR_CPHA_MASK                              0x8
#define S1SPCR_CPHA                                   0x8
#define S1SPCR_CPHA_BIT                               3
#define S1SPCR_CPOL_MASK                              0x10
#define S1SPCR_CPOL                                   0x10
#define S1SPCR_CPOL_BIT                               4
#define S1SPCR_MSTR_MASK                              0x20
#define S1SPCR_MSTR                                   0x20
#define S1SPCR_MSTR_BIT                               5
#define S1SPCR_LSBF_MASK                              0x40
#define S1SPCR_LSBF                                   0x40
#define S1SPCR_LSBF_BIT                               6
#define S1SPCR_SPIE_MASK                              0x80
#define S1SPCR_SPIE                                   0x80
#define S1SPCR_SPIE_BIT                               7
#define S1SPCR_BITS_MASK                              0xF00
#define S1SPCR_BITS_BIT                               8

#define S1SPSR                                        ( *( volatile unsigned char * ) 0xE0030004 )
#define S1SPSR_OFFSET                                 0x4
#define S1SPSR_ABRT_MASK                              0x8
#define S1SPSR_ABRT                                   0x8
#define S1SPSR_ABRT_BIT                               3
#define S1SPSR_MODF_MASK                              0x10
#define S1SPSR_MODF                                   0x10
#define S1SPSR_MODF_BIT                               4
#define S1SPSR_ROVR_MASK                              0x20
#define S1SPSR_ROVR                                   0x20
#define S1SPSR_ROVR_BIT                               5
#define S1SPSR_WCOL_MASK                              0x40
#define S1SPSR_WCOL                                   0x40
#define S1SPSR_WCOL_BIT                               6
#define S1SPSR_SPIF_MASK                              0x80
#define S1SPSR_SPIF                                   0x80
#define S1SPSR_SPIF_BIT                               7

#define S1SPDR                                        ( *( volatile unsigned short * ) 0xE0030008 )
#define S1SPDR_OFFSET                                 0x8

#define S1SPCCR                                       ( *( volatile unsigned char * ) 0xE003000C )
#define S1SPCCR_OFFSET                                0xC

#define S1SPINT                                       ( *( volatile unsigned char * ) 0xE003001C )
#define S1SPINT_OFFSET                                0x1C

#define AD_BASE                                       0xE0034000

#define ADCR                                          ( *( volatile unsigned * ) 0xE0034000 )
#define ADCR_OFFSET                                   0x0
#define ADCR_SEL_MASK                                 0xFF
#define ADCR_SEL_BIT                                  0
#define ADCR_CLKDIV_MASK                              0xFF00
#define ADCR_CLKDIV_BIT                               8
#define ADCR_BURST_MASK                               0x10000
#define ADCR_BURST                                    0x10000
#define ADCR_BURST_BIT                                16
#define ADCR_CLKS_MASK                                0xE0000
#define ADCR_CLKS_BIT                                 17
#define ADCR_PDN_MASK                                 0x200000
#define ADCR_PDN                                      0x200000
#define ADCR_PDN_BIT                                  21
#define ADCR_START_MASK                               0x7000000
#define ADCR_START_BIT                                24
#define ADCR_EDGE_MASK                                0x8000000
#define ADCR_EDGE                                     0x8000000
#define ADCR_EDGE_BIT                                 27

