FreeRTOS/FreeRTOS/FreeRTOS/Demo/ARM7_LPC2138_Rowley/LPC21xx.h
#define ADGDR                                         ( *( volatile unsigned * ) 0xE0034004 )
#define ADGDR_OFFSET                                  0x4
#define ADGDR_RESULT_MASK                             0xFFC0
#define ADGDR_RESULT_BIT                              6
#define ADGDR_CHN_MASK                                0x7000000
#define ADGDR_CHN_BIT                                 24
#define ADGDR_OVERUN_MASK                             0x40000000
#define ADGDR_OVERUN                                  0x40000000
#define ADGDR_OVERUN_BIT                              30
#define ADGDR_DONE_MASK                               0x80000000
#define ADGDR_DONE                                    0x80000000
#define ADGDR_DONE_BIT                                31

#define ADINTEN                                       ( *( volatile unsigned * ) 0xE003400C )
#define ADINTEN_OFFSET                                0xC
#define ADINTEN_ADINTEN0_MASK                         0x1
#define ADINTEN_ADINTEN0                              0x1
#define ADINTEN_ADINTEN0_BIT                          0
#define ADINTEN_ADINTEN1_MASK                         0x2
#define ADINTEN_ADINTEN1                              0x2
#define ADINTEN_ADINTEN1_BIT                          1
#define ADINTEN_ADINTEN2_MASK                         0x4
#define ADINTEN_ADINTEN2                              0x4
#define ADINTEN_ADINTEN2_BIT                          2
#define ADINTEN_ADINTEN3_MASK                         0x8
#define ADINTEN_ADINTEN3                              0x8
#define ADINTEN_ADINTEN3_BIT                          3
#define ADINTEN_ADINTEN4_MASK                         0x10
#define ADINTEN_ADINTEN4                              0x10
#define ADINTEN_ADINTEN4_BIT                          4
#define ADINTEN_ADINTEN5_MASK                         0x20
#define ADINTEN_ADINTEN5                              0x20
#define ADINTEN_ADINTEN5_BIT                          5
#define ADINTEN_ADINTEN6_MASK                         0x40
#define ADINTEN_ADINTEN6                              0x40
#define ADINTEN_ADINTEN6_BIT                          6
#define ADINTEN_ADINTEN7_MASK                         0x80
#define ADINTEN_ADINTEN7                              0x80
#define ADINTEN_ADINTEN7_BIT                          7
#define ADINTEN_ADGINTEN_MASK                         0x100
#define ADINTEN_ADGINTEN                              0x100
#define ADINTEN_ADGINTEN_BIT                          8

#define ADDR0                                         ( *( volatile unsigned * ) 0xE0034010 )
#define ADDR0_OFFSET                                  0x10
#define ADDR0_RESULT_MASK                             0xFFC0
#define ADDR0_RESULT_BIT                              6
#define ADDR0_OVERRUN_MASK                            0x40000000
#define ADDR0_OVERRUN                                 0x40000000
#define ADDR0_OVERRUN_BIT                             30
#define ADDR0_DONE_MASK                               0x80000000
#define ADDR0_DONE                                    0x80000000
#define ADDR0_DONE_BIT                                31

#define ADDR1                                         ( *( volatile unsigned * ) 0xE0034014 )
#define ADDR1_OFFSET                                  0x14
#define ADDR1_RESULT_MASK                             0xFFC0
#define ADDR1_RESULT_BIT                              6
#define ADDR1_OVERRUN_MASK                            0x40000000
#define ADDR1_OVERRUN                                 0x40000000
#define ADDR1_OVERRUN_BIT                             30
#define ADDR1_DONE_MASK                               0x80000000
#define ADDR1_DONE                                    0x80000000
#define ADDR1_DONE_BIT                                31

#define ADDR2                                         ( *( volatile unsigned * ) 0xE0034018 )
#define ADDR2_OFFSET                                  0x18
#define ADDR2_RESULT_MASK                             0xFFC0
#define ADDR2_RESULT_BIT                              6
#define ADDR2_OVERRUN_MASK                            0x40000000
#define ADDR2_OVERRUN                                 0x40000000
#define ADDR2_OVERRUN_BIT                             30
#define ADDR2_DONE_MASK                               0x80000000
#define ADDR2_DONE                                    0x80000000
#define ADDR2_DONE_BIT                                31

#define ADDR3                                         ( *( volatile unsigned * ) 0xE003401C )
#define ADDR3_OFFSET                                  0x1C
#define ADDR3_RESULT_MASK                             0xFFC0
#define ADDR3_RESULT_BIT                              6
#define ADDR3_OVERRUN_MASK                            0x40000000
#define ADDR3_OVERRUN                                 0x40000000
#define ADDR3_OVERRUN_BIT                             30
#define ADDR3_DONE_MASK                               0x80000000
#define ADDR3_DONE                                    0x80000000
#define ADDR3_DONE_BIT                                31

#define ADDR4                                         ( *( volatile unsigned * ) 0xE0034020 )
#define ADDR4_OFFSET                                  0x20
#define ADDR4_RESULT_MASK                             0xFFC0
#define ADDR4_RESULT_BIT                              6
#define ADDR4_OVERRUN_MASK                            0x40000000
#define ADDR4_OVERRUN                                 0x40000000
#define ADDR4_OVERRUN_BIT                             30
#define ADDR4_DONE_MASK                               0x80000000
#define ADDR4_DONE                                    0x80000000
#define ADDR4_DONE_BIT                                31

#define ADDR5                                         ( *( volatile unsigned * ) 0xE0034024 )
#define ADDR5_OFFSET                                  0x24
#define ADDR5_RESULT_MASK                             0xFFC0
#define ADDR5_RESULT_BIT                              6
#define ADDR5_OVERRUN_MASK                            0x40000000
#define ADDR5_OVERRUN                                 0x40000000
#define ADDR5_OVERRUN_BIT                             30
#define ADDR5_DONE_MASK                               0x80000000
#define ADDR5_DONE                                    0x80000000
#define ADDR5_DONE_BIT                                31

#define ADDR6                                         ( *( volatile unsigned * ) 0xE0034028 )
#define ADDR6_OFFSET                                  0x28
#define ADDR6_RESULT_MASK                             0xFFC0
#define ADDR6_RESULT_BIT                              6
#define ADDR6_OVERRUN_MASK                            0x40000000
#define ADDR6_OVERRUN                                 0x40000000
#define ADDR6_OVERRUN_BIT                             30
#define ADDR6_DONE_MASK                               0x80000000
#define ADDR6_DONE                                    0x80000000
#define ADDR6_DONE_BIT                                31

#define ADDR7                                         ( *( volatile unsigned * ) 0xE003402C )
#define ADDR7_OFFSET                                  0x2C
#define ADDR7_RESULT_MASK                             0xFFC0
#define ADDR7_RESULT_BIT                              6
#define ADDR7_OVERRUN_MASK                            0x40000000
#define ADDR7_OVERRUN                                 0x40000000
#define ADDR7_OVERRUN_BIT                             30
#define ADDR7_DONE_MASK                               0x80000000
#define ADDR7_DONE                                    0x80000000
#define ADDR7_DONE_BIT                                31

#define ADSTAT                                        ( *( volatile unsigned * ) 0xE0034030 )
#define ADSTAT_OFFSET                                 0x30
#define ADSTAT_DONE0_MASK                             0x1
#define ADSTAT_DONE0                                  0x1
#define ADSTAT_DONE0_BIT                              0
#define ADSTAT_DONE1_MASK                             0x2
#define ADSTAT_DONE1                                  0x2
#define ADSTAT_DONE1_BIT                              1
#define ADSTAT_DONE2_MASK                             0x4
#define ADSTAT_DONE2                                  0x4
#define ADSTAT_DONE2_BIT                              2
#define ADSTAT_DONE3_MASK                             0x8
#define ADSTAT_DONE3                                  0x8
#define ADSTAT_DONE3_BIT                              3
#define ADSTAT_DONE4_MASK                             0x10
#define ADSTAT_DONE4                                  0x10
#define ADSTAT_DONE4_BIT                              4
#define ADSTAT_DONE5_MASK                             0x20
#define ADSTAT_DONE5                                  0x20
#define ADSTAT_DONE5_BIT                              5
#define ADSTAT_DONE6_MASK                             0x40
#define ADSTAT_DONE6                                  0x40
#define ADSTAT_DONE6_BIT                              6
#define ADSTAT_DONE7_MASK                             0x80
#define ADSTAT_DONE7                                  0x80
#define ADSTAT_DONE7_BIT                              7
#define ADSTAT_OVERRUN0_MASK                          0x100
#define ADSTAT_OVERRUN0                               0x100
#define ADSTAT_OVERRUN0_BIT                           8
#define ADSTAT_OVERRUN1_MASK                          0x200
#define ADSTAT_OVERRUN1                               0x200
#define ADSTAT_OVERRUN1_BIT                           9
#define ADSTAT_OVERRUN2_MASK                          0x400
#define ADSTAT_OVERRUN2                               0x400
#define ADSTAT_OVERRUN2_BIT                           10
#define ADSTAT_OVERRUN3_MASK                          0x800
#define ADSTAT_OVERRUN3                               0x800
#define ADSTAT_OVERRUN3_BIT                           11
#define ADSTAT_OVERRUN4_MASK                          0x1000
#define ADSTAT_OVERRUN4                               0x1000
#define ADSTAT_OVERRUN4_BIT                           12
#define ADSTAT_OVERRUN5_MASK                          0x2000
#define ADSTAT_OVERRUN5                               0x2000
#define ADSTAT_OVERRUN5_BIT                           13
#define ADSTAT_OVERRUN6_MASK                          0x4000
#define ADSTAT_OVERRUN6                               0x4000
#define ADSTAT_OVERRUN6_BIT                           14
#define ADSTAT_OVERRUN7_MASK                          0x8000
#define ADSTAT_OVERRUN7                               0x8000
#define ADSTAT_OVERRUN7_BIT                           15
#define ADSTAT_ADINT_MASK                             0x10000
#define ADSTAT_ADINT                                  0x10000
#define ADSTAT_ADINT_BIT                              16

#define CAN_BASE                                      0xE0038000

