FreeRTOS/FreeRTOS/FreeRTOS/Demo/ARM7_LPC2138_Rowley/LPC21xx.h
#define AFMR                                          ( *( volatile unsigned long * ) 0xE003C000 )
#define AFMR_OFFSET                                   0x4000
#define AFMR_AccOff_MASK                              0x1
#define AFMR_AccOff                                   0x1
#define AFMR_AccOff_BIT                               0
#define AFMR_AccBP_MASK                               0x2
#define AFMR_AccBP                                    0x2
#define AFMR_AccBP_BIT                                1
#define AFMR_eFCAN_MASK                               0x4
#define AFMR_eFCAN                                    0x4
#define AFMR_eFCAN_BIT                                2

#define SFF_sa                                        ( *( volatile unsigned long * ) 0xE003C004 )
#define SFF_sa_OFFSET                                 0x4004

#define SFF_GRP_sa                                    ( *( volatile unsigned long * ) 0xE003C008 )
#define SFF_GRP_sa_OFFSET                             0x4008

#define EFF_sa                                        ( *( volatile unsigned long * ) 0xE003C00C )
#define EFF_sa_OFFSET                                 0x400C

#define EFF_GRP_sa                                    ( *( volatile unsigned long * ) 0xE003C010 )
#define EFF_GRP_sa_OFFSET                             0x4010

#define ENDofTable                                    ( *( volatile unsigned long * ) 0xE003C014 )
#define ENDofTable_OFFSET                             0x4014

#define LUTerrAd                                      ( *( volatile unsigned long * ) 0xE003C018 )
#define LUTerrAd_OFFSET                               0x4018

#define LUTerr                                        ( *( volatile unsigned long * ) 0xE003C01C )
#define LUTerr_OFFSET                                 0x401C

#define CANTxSR                                       ( *( volatile unsigned long * ) 0xE0040000 )
#define CANTxSR_OFFSET                                0x8000
#define CANTxSR_TS1_MASK                              0x1
#define CANTxSR_TS1                                   0x1
#define CANTxSR_TS1_BIT                               0
#define CANTxSR_TS2_MASK                              0x2
#define CANTxSR_TS2                                   0x2
#define CANTxSR_TS2_BIT                               1
#define CANTxSR_TS3_MASK                              0x4
#define CANTxSR_TS3                                   0x4
#define CANTxSR_TS3_BIT                               2
#define CANTxSR_TS4_MASK                              0x8
#define CANTxSR_TS4                                   0x8
#define CANTxSR_TS4_BIT                               3
#define CANTxSR_TBS1_MASK                             0x100
#define CANTxSR_TBS1                                  0x100
#define CANTxSR_TBS1_BIT                              8
#define CANTxSR_TBS2_MASK                             0x200
#define CANTxSR_TBS2                                  0x200
#define CANTxSR_TBS2_BIT                              9
#define CANTxSR_TBS3_MASK                             0x400
#define CANTxSR_TBS3                                  0x400
#define CANTxSR_TBS3_BIT                              10
#define CANTxSR_TBS4_MASK                             0x800
#define CANTxSR_TBS4                                  0x800
#define CANTxSR_TBS4_BIT                              11
#define CANTxSR_TCS1_MASK                             0x10000
#define CANTxSR_TCS1                                  0x10000
#define CANTxSR_TCS1_BIT                              16
#define CANTxSR_TCS2_MASK                             0x20000
#define CANTxSR_TCS2                                  0x20000
#define CANTxSR_TCS2_BIT                              17
#define CANTxSR_TCS3_MASK                             0x40000
#define CANTxSR_TCS3                                  0x40000
#define CANTxSR_TCS3_BIT                              18
#define CANTxSR_TCS4_MASK                             0x80000
#define CANTxSR_TCS4                                  0x80000
#define CANTxSR_TCS4_BIT                              19

#define CANRxSR                                       ( *( volatile unsigned long * ) 0xE0040004 )
#define CANRxSR_OFFSET                                0x8004
#define CANRxSR_RS1_MASK                              0x1
#define CANRxSR_RS1                                   0x1
#define CANRxSR_RS1_BIT                               0
#define CANRxSR_RS2_MASK                              0x2
#define CANRxSR_RS2                                   0x2
#define CANRxSR_RS2_BIT                               1
#define CANRxSR_RS3_MASK                              0x4
#define CANRxSR_RS3                                   0x4
#define CANRxSR_RS3_BIT                               2
#define CANRxSR_RS4_MASK                              0x8
#define CANRxSR_RS4                                   0x8
#define CANRxSR_RS4_BIT                               3
#define CANRxSR_RB1_MASK                              0x100
#define CANRxSR_RB1                                   0x100
#define CANRxSR_RB1_BIT                               8
#define CANRxSR_RB2_MASK                              0x200
#define CANRxSR_RB2                                   0x200
#define CANRxSR_RB2_BIT                               9
#define CANRxSR_RB3_MASK                              0x400
#define CANRxSR_RB3                                   0x400
#define CANRxSR_RB3_BIT                               10
#define CANRxSR_RB4_MASK                              0x800
#define CANRxSR_RB4                                   0x800
#define CANRxSR_RB4_BIT                               11
#define CANRxSR_DOS1_MASK                             0x10000
#define CANRxSR_DOS1                                  0x10000
#define CANRxSR_DOS1_BIT                              16
#define CANRxSR_DOS2_MASK                             0x20000
#define CANRxSR_DOS2                                  0x20000
#define CANRxSR_DOS2_BIT                              17
#define CANRxSR_DOS3_MASK                             0x40000
#define CANRxSR_DOS3                                  0x40000
#define CANRxSR_DOS3_BIT                              18
#define CANRxSR_DOS4_MASK                             0x80000
#define CANRxSR_DOS4                                  0x80000
#define CANRxSR_DOS4_BIT                              19

