FreeRTOS/FreeRTOS/FreeRTOS/Demo/ARM7_LPC2138_Rowley/LPC21xx.h
#define CANMSR                                        ( *( volatile unsigned long * ) 0xE0040008 )
#define CANMSR_OFFSET                                 0x8008
#define CANMSR_ES1_MASK                               0x1
#define CANMSR_ES1                                    0x1
#define CANMSR_ES1_BIT                                0
#define CANMSR_ES2_MASK                               0x2
#define CANMSR_ES2                                    0x2
#define CANMSR_ES2_BIT                                1
#define CANMSR_ES3_MASK                               0x4
#define CANMSR_ES3                                    0x4
#define CANMSR_ES3_BIT                                2
#define CANMSR_ES4_MASK                               0x8
#define CANMSR_ES4                                    0x8
#define CANMSR_ES4_BIT                                3
#define CANMSR_BS1_MASK                               0x100
#define CANMSR_BS1                                    0x100
#define CANMSR_BS1_BIT                                8
#define CANMSR_BS2_MASK                               0x200
#define CANMSR_BS2                                    0x200
#define CANMSR_BS2_BIT                                9
#define CANMSR_BS3_MASK                               0x400
#define CANMSR_BS3                                    0x400
#define CANMSR_BS3_BIT                                10
#define CANMSR_BS4_MASK                               0x800
#define CANMSR_BS4                                    0x800
#define CANMSR_BS4_BIT                                11

#define CAN1_BASE                                     0xE0044000

#define C1MOD                                         ( *( volatile unsigned long * ) 0xE0044000 )
#define CAN1MOD                                       C1MOD
#define C1MOD_OFFSET                                  0x0
#define CAN1MOD_OFFSET                                C1MOD_OFFSET
#define C1MOD_RM_MASK                                 0x1
#define CAN1MOD_RM_MASK                               C1MOD_RM_MASK
#define C1MOD_RM                                      0x1
#define CAN1MOD_RM                                    C1MOD_RM
#define C1MOD_RM_BIT                                  0
#define CAN1MOD_RM_BIT                                C1MOD_RM_BIT
#define C1MOD_LOM_MASK                                0x2
#define CAN1MOD_LOM_MASK                              C1MOD_LOM_MASK
#define C1MOD_LOM                                     0x2
#define CAN1MOD_LOM                                   C1MOD_LOM
#define C1MOD_LOM_BIT                                 1
#define CAN1MOD_LOM_BIT                               C1MOD_LOM_BIT
#define C1MOD_STM_MASK                                0x4
#define CAN1MOD_STM_MASK                              C1MOD_STM_MASK
#define C1MOD_STM                                     0x4
#define CAN1MOD_STM                                   C1MOD_STM
#define C1MOD_STM_BIT                                 2
#define CAN1MOD_STM_BIT                               C1MOD_STM_BIT
#define C1MOD_TPM_MASK                                0x8
#define CAN1MOD_TPM_MASK                              C1MOD_TPM_MASK
#define C1MOD_TPM                                     0x8
#define CAN1MOD_TPM                                   C1MOD_TPM
#define C1MOD_TPM_BIT                                 3
#define CAN1MOD_TPM_BIT                               C1MOD_TPM_BIT
#define C1MOD_SM_MASK                                 0x10
#define CAN1MOD_SM_MASK                               C1MOD_SM_MASK
#define C1MOD_SM                                      0x10
#define CAN1MOD_SM                                    C1MOD_SM
#define C1MOD_SM_BIT                                  4
#define CAN1MOD_SM_BIT                                C1MOD_SM_BIT
#define C1MOD_RPM_MASK                                0x20
#define CAN1MOD_RPM_MASK                              C1MOD_RPM_MASK
#define C1MOD_RPM                                     0x20
#define CAN1MOD_RPM                                   C1MOD_RPM
#define C1MOD_RPM_BIT                                 5
#define CAN1MOD_RPM_BIT                               C1MOD_RPM_BIT
#define C1MOD_TM_MASK                                 0x80
#define CAN1MOD_TM_MASK                               C1MOD_TM_MASK
#define C1MOD_TM                                      0x80
#define CAN1MOD_TM                                    C1MOD_TM
#define C1MOD_TM_BIT                                  7
#define CAN1MOD_TM_BIT                                C1MOD_TM_BIT

#define C1CMR                                         ( *( volatile unsigned long * ) 0xE0044004 )
#define CAN1CMR                                       C1CMR
#define C1CMR_OFFSET                                  0x4
#define CAN1CMR_OFFSET                                C1CMR_OFFSET
#define C1CMR_TR_MASK                                 0x1
#define CAN1CMR_TR_MASK                               C1CMR_TR_MASK
#define C1CMR_TR                                      0x1
#define CAN1CMR_TR                                    C1CMR_TR
#define C1CMR_TR_BIT                                  0
#define CAN1CMR_TR_BIT                                C1CMR_TR_BIT
#define C1CMR_AT_MASK                                 0x2
#define CAN1CMR_AT_MASK                               C1CMR_AT_MASK
#define C1CMR_AT                                      0x2
#define CAN1CMR_AT                                    C1CMR_AT
#define C1CMR_AT_BIT                                  1
#define CAN1CMR_AT_BIT                                C1CMR_AT_BIT
#define C1CMR_RRB_MASK                                0x4
#define CAN1CMR_RRB_MASK                              C1CMR_RRB_MASK
#define C1CMR_RRB                                     0x4
#define CAN1CMR_RRB                                   C1CMR_RRB
#define C1CMR_RRB_BIT                                 2
#define CAN1CMR_RRB_BIT                               C1CMR_RRB_BIT
#define C1CMR_CDO_MASK                                0x8
#define CAN1CMR_CDO_MASK                              C1CMR_CDO_MASK
#define C1CMR_CDO                                     0x8
#define CAN1CMR_CDO                                   C1CMR_CDO
#define C1CMR_CDO_BIT                                 3
#define CAN1CMR_CDO_BIT                               C1CMR_CDO_BIT
#define C1CMR_SRR_MASK                                0x10
#define CAN1CMR_SRR_MASK                              C1CMR_SRR_MASK
#define C1CMR_SRR                                     0x10
#define CAN1CMR_SRR                                   C1CMR_SRR
#define C1CMR_SRR_BIT                                 4
#define CAN1CMR_SRR_BIT                               C1CMR_SRR_BIT
#define C1CMR_STB1_MASK                               0x20
#define CAN1CMR_STB1_MASK                             C1CMR_STB1_MASK
#define C1CMR_STB1                                    0x20
#define CAN1CMR_STB1                                  C1CMR_STB1
#define C1CMR_STB1_BIT                                5
#define CAN1CMR_STB1_BIT                              C1CMR_STB1_BIT
#define C1CMR_STB2_MASK                               0x40
#define CAN1CMR_STB2_MASK                             C1CMR_STB2_MASK
#define C1CMR_STB2                                    0x40
#define CAN1CMR_STB2                                  C1CMR_STB2
#define C1CMR_STB2_BIT                                6
#define CAN1CMR_STB2_BIT                              C1CMR_STB2_BIT
#define C1CMR_STB3_MASK                               0x80
#define CAN1CMR_STB3_MASK                             C1CMR_STB3_MASK
#define C1CMR_STB3                                    0x80
#define CAN1CMR_STB3                                  C1CMR_STB3
#define C1CMR_STB3_BIT                                7
#define CAN1CMR_STB3_BIT                              C1CMR_STB3_BIT

#define C1GSR                                         ( *( volatile unsigned long * ) 0xE0044008 )
#define CAN1GSR                                       C1GSR
#define C1GSR_OFFSET                                  0x8
#define CAN1GSR_OFFSET                                C1GSR_OFFSET
#define C1GSR_RBS_MASK                                0x1
#define CAN1GSR_RBS_MASK                              C1GSR_RBS_MASK
#define C1GSR_RBS                                     0x1
#define CAN1GSR_RBS                                   C1GSR_RBS
#define C1GSR_RBS_BIT                                 0
#define CAN1GSR_RBS_BIT                               C1GSR_RBS_BIT
#define C1GSR_DOS_MASK                                0x2
#define CAN1GSR_DOS_MASK                              C1GSR_DOS_MASK
#define C1GSR_DOS                                     0x2
#define CAN1GSR_DOS                                   C1GSR_DOS
#define C1GSR_DOS_BIT                                 1
#define CAN1GSR_DOS_BIT                               C1GSR_DOS_BIT
#define C1GSR_TBS_MASK                                0x4
#define CAN1GSR_TBS_MASK                              C1GSR_TBS_MASK
#define C1GSR_TBS                                     0x4
#define CAN1GSR_TBS                                   C1GSR_TBS
#define C1GSR_TBS_BIT                                 2
#define CAN1GSR_TBS_BIT                               C1GSR_TBS_BIT
#define C1GSR_TCS_MASK                                0x8
#define CAN1GSR_TCS_MASK                              C1GSR_TCS_MASK
#define C1GSR_TCS                                     0x8
#define CAN1GSR_TCS                                   C1GSR_TCS
#define C1GSR_TCS_BIT                                 3
#define CAN1GSR_TCS_BIT                               C1GSR_TCS_BIT
#define C1GSR_RS_MASK                                 0x10
#define CAN1GSR_RS_MASK                               C1GSR_RS_MASK
#define C1GSR_RS                                      0x10
#define CAN1GSR_RS                                    C1GSR_RS
#define C1GSR_RS_BIT                                  4
#define CAN1GSR_RS_BIT                                C1GSR_RS_BIT
#define C1GSR_TS_MASK                                 0x20
#define CAN1GSR_TS_MASK                               C1GSR_TS_MASK
#define C1GSR_TS                                      0x20
#define CAN1GSR_TS                                    C1GSR_TS
#define C1GSR_TS_BIT                                  5
#define CAN1GSR_TS_BIT                                C1GSR_TS_BIT
#define C1GSR_ES_MASK                                 0x40
#define CAN1GSR_ES_MASK                               C1GSR_ES_MASK
#define C1GSR_ES                                      0x40
#define CAN1GSR_ES                                    C1GSR_ES
#define C1GSR_ES_BIT                                  6
#define CAN1GSR_ES_BIT                                C1GSR_ES_BIT
#define C1GSR_BS_MASK                                 0x80
#define CAN1GSR_BS_MASK                               C1GSR_BS_MASK
#define C1GSR_BS                                      0x80
#define CAN1GSR_BS                                    C1GSR_BS
#define C1GSR_BS_BIT                                  7
#define CAN1GSR_BS_BIT                                C1GSR_BS_BIT
#define C1GSR_RXERR_MASK                              0xFF0000
#define CAN1GSR_RXERR_MASK                            C1GSR_RXERR_MASK
#define C1GSR_RXERR_BIT                               16
#define CAN1GSR_RXERR_BIT                             C1GSR_RXERR_BIT
#define C1GSR_TXERR_MASK                              0xFF000000
#define CAN1GSR_TXERR_MASK                            C1GSR_TXERR_MASK
#define C1GSR_TXERR_BIT                               24
#define CAN1GSR_TXERR_BIT                             C1GSR_TXERR_BIT

#define C1ICR                                         ( *( volatile unsigned long * ) 0xE004400C )
#define CAN1ICR                                       C1ICR
#define C1ICR_OFFSET                                  0xC
#define CAN1ICR_OFFSET                                C1ICR_OFFSET
#define C1ICR_RI_MASK                                 0x1
#define CAN1ICR_RI_MASK                               C1ICR_RI_MASK
#define C1ICR_RI                                      0x1
#define CAN1ICR_RI                                    C1ICR_RI
#define C1ICR_RI_BIT                                  0
#define CAN1ICR_RI_BIT                                C1ICR_RI_BIT
#define C1ICR_TI1_MASK                                0x2
#define CAN1ICR_TI1_MASK                              C1ICR_TI1_MASK
#define C1ICR_TI1                                     0x2
#define CAN1ICR_TI1                                   C1ICR_TI1
#define C1ICR_TI1_BIT                                 1
#define CAN1ICR_TI1_BIT                               C1ICR_TI1_BIT
#define C1ICR_EI_MASK                                 0x4
#define CAN1ICR_EI_MASK                               C1ICR_EI_MASK
#define C1ICR_EI                                      0x4
#define CAN1ICR_EI                                    C1ICR_EI
#define C1ICR_EI_BIT                                  2
#define CAN1ICR_EI_BIT                                C1ICR_EI_BIT
#define C1ICR_DOI_MASK                                0x8
#define CAN1ICR_DOI_MASK                              C1ICR_DOI_MASK
#define C1ICR_DOI                                     0x8
#define CAN1ICR_DOI                                   C1ICR_DOI
#define C1ICR_DOI_BIT                                 3
#define CAN1ICR_DOI_BIT                               C1ICR_DOI_BIT
#define C1ICR_WUI_MASK                                0x10
#define CAN1ICR_WUI_MASK                              C1ICR_WUI_MASK
#define C1ICR_WUI                                     0x10
#define CAN1ICR_WUI                                   C1ICR_WUI
#define C1ICR_WUI_BIT                                 4
#define CAN1ICR_WUI_BIT                               C1ICR_WUI_BIT
#define C1ICR_EPI_MASK                                0x20
#define CAN1ICR_EPI_MASK                              C1ICR_EPI_MASK
#define C1ICR_EPI                                     0x20
#define CAN1ICR_EPI                                   C1ICR_EPI
#define C1ICR_EPI_BIT                                 5
#define CAN1ICR_EPI_BIT                               C1ICR_EPI_BIT
#define C1ICR_ALI_MASK                                0x40
#define CAN1ICR_ALI_MASK                              C1ICR_ALI_MASK
#define C1ICR_ALI                                     0x40
#define CAN1ICR_ALI                                   C1ICR_ALI
#define C1ICR_ALI_BIT                                 6
#define CAN1ICR_ALI_BIT                               C1ICR_ALI_BIT
#define C1ICR_BEI_MASK                                0x80
#define CAN1ICR_BEI_MASK                              C1ICR_BEI_MASK
#define C1ICR_BEI                                     0x80
#define CAN1ICR_BEI                                   C1ICR_BEI
#define C1ICR_BEI_BIT                                 7
#define CAN1ICR_BEI_BIT                               C1ICR_BEI_BIT
#define C1ICR_IDI_MASK                                0x100
#define CAN1ICR_IDI_MASK                              C1ICR_IDI_MASK
#define C1ICR_IDI                                     0x100
#define CAN1ICR_IDI                                   C1ICR_IDI
#define C1ICR_IDI_BIT                                 8
#define CAN1ICR_IDI_BIT                               C1ICR_IDI_BIT
#define C1ICR_TI2_MASK                                0x200
#define CAN1ICR_TI2_MASK                              C1ICR_TI2_MASK
#define C1ICR_TI2                                     0x200
#define CAN1ICR_TI2                                   C1ICR_TI2
#define C1ICR_TI2_BIT                                 9
#define CAN1ICR_TI2_BIT                               C1ICR_TI2_BIT
#define C1ICR_TI3_MASK                                0x400
#define CAN1ICR_TI3_MASK                              C1ICR_TI3_MASK
#define C1ICR_TI3                                     0x400
#define CAN1ICR_TI3                                   C1ICR_TI3
#define C1ICR_TI3_BIT                                 10
#define CAN1ICR_TI3_BIT                               C1ICR_TI3_BIT
#define C1ICR_ERRBIT_MASK                             0x1F0000
#define CAN1ICR_ERRBIT_MASK                           C1ICR_ERRBIT_MASK
#define C1ICR_ERRBIT_BIT                              16
#define CAN1ICR_ERRBIT_BIT                            C1ICR_ERRBIT_BIT
#define C1ICR_ERRDIR_MASK                             0x200000
#define CAN1ICR_ERRDIR_MASK                           C1ICR_ERRDIR_MASK
#define C1ICR_ERRDIR                                  0x200000
#define CAN1ICR_ERRDIR                                C1ICR_ERRDIR
#define C1ICR_ERRDIR_BIT                              21
#define CAN1ICR_ERRDIR_BIT                            C1ICR_ERRDIR_BIT
#define C1ICR_ERRC_MASK                               0xC00000
#define CAN1ICR_ERRC_MASK                             C1ICR_ERRC_MASK
#define C1ICR_ERRC_BIT                                22
#define CAN1ICR_ERRC_BIT                              C1ICR_ERRC_BIT
#define C1ICR_ALCBIT_MASK                             0x1F000000
#define CAN1ICR_ALCBIT_MASK                           C1ICR_ALCBIT_MASK
#define C1ICR_ALCBIT_BIT                              24
#define CAN1ICR_ALCBIT_BIT                            C1ICR_ALCBIT_BIT

