FreeRTOS/FreeRTOS/FreeRTOS/Demo/ARM7_LPC2138_Rowley/LPC21xx.h
#define C1IER                                         ( *( volatile unsigned long * ) 0xE0044010 )
#define CAN1IER                                       C1IER
#define C1IER_OFFSET                                  0x10
#define CAN1IER_OFFSET                                C1IER_OFFSET
#define C1IER_RIE_MASK                                0x1
#define CAN1IER_RIE_MASK                              C1IER_RIE_MASK
#define C1IER_RIE                                     0x1
#define CAN1IER_RIE                                   C1IER_RIE
#define C1IER_RIE_BIT                                 0
#define CAN1IER_RIE_BIT                               C1IER_RIE_BIT
#define C1IER_TIE1_MASK                               0x2
#define CAN1IER_TIE1_MASK                             C1IER_TIE1_MASK
#define C1IER_TIE1                                    0x2
#define CAN1IER_TIE1                                  C1IER_TIE1
#define C1IER_TIE1_BIT                                1
#define CAN1IER_TIE1_BIT                              C1IER_TIE1_BIT
#define C1IER_EIE_MASK                                0x4
#define CAN1IER_EIE_MASK                              C1IER_EIE_MASK
#define C1IER_EIE                                     0x4
#define CAN1IER_EIE                                   C1IER_EIE
#define C1IER_EIE_BIT                                 2
#define CAN1IER_EIE_BIT                               C1IER_EIE_BIT
#define C1IER_DOIE_MASK                               0x8
#define CAN1IER_DOIE_MASK                             C1IER_DOIE_MASK
#define C1IER_DOIE                                    0x8
#define CAN1IER_DOIE                                  C1IER_DOIE
#define C1IER_DOIE_BIT                                3
#define CAN1IER_DOIE_BIT                              C1IER_DOIE_BIT
#define C1IER_WUIE_MASK                               0x10
#define CAN1IER_WUIE_MASK                             C1IER_WUIE_MASK
#define C1IER_WUIE                                    0x10
#define CAN1IER_WUIE                                  C1IER_WUIE
#define C1IER_WUIE_BIT                                4
#define CAN1IER_WUIE_BIT                              C1IER_WUIE_BIT
#define C1IER_EPIE_MASK                               0x20
#define CAN1IER_EPIE_MASK                             C1IER_EPIE_MASK
#define C1IER_EPIE                                    0x20
#define CAN1IER_EPIE                                  C1IER_EPIE
#define C1IER_EPIE_BIT                                5
#define CAN1IER_EPIE_BIT                              C1IER_EPIE_BIT
#define C1IER_ALIE_MASK                               0x40
#define CAN1IER_ALIE_MASK                             C1IER_ALIE_MASK
#define C1IER_ALIE                                    0x40
#define CAN1IER_ALIE                                  C1IER_ALIE
#define C1IER_ALIE_BIT                                6
#define CAN1IER_ALIE_BIT                              C1IER_ALIE_BIT
#define C1IER_BEIE_MASK                               0x80
#define CAN1IER_BEIE_MASK                             C1IER_BEIE_MASK
#define C1IER_BEIE                                    0x80
#define CAN1IER_BEIE                                  C1IER_BEIE
#define C1IER_BEIE_BIT                                7
#define CAN1IER_BEIE_BIT                              C1IER_BEIE_BIT
#define C1IER_IDIE_MASK                               0x100
#define CAN1IER_IDIE_MASK                             C1IER_IDIE_MASK
#define C1IER_IDIE                                    0x100
#define CAN1IER_IDIE                                  C1IER_IDIE
#define C1IER_IDIE_BIT                                8
#define CAN1IER_IDIE_BIT                              C1IER_IDIE_BIT
#define C1IER_TIE2_MASK                               0x200
#define CAN1IER_TIE2_MASK                             C1IER_TIE2_MASK
#define C1IER_TIE2                                    0x200
#define CAN1IER_TIE2                                  C1IER_TIE2
#define C1IER_TIE2_BIT                                9
#define CAN1IER_TIE2_BIT                              C1IER_TIE2_BIT
#define C1IER_TIE3_MASK                               0x400
#define CAN1IER_TIE3_MASK                             C1IER_TIE3_MASK
#define C1IER_TIE3                                    0x400
#define CAN1IER_TIE3                                  C1IER_TIE3
#define C1IER_TIE3_BIT                                10
#define CAN1IER_TIE3_BIT                              C1IER_TIE3_BIT

#define C1BTR                                         ( *( volatile unsigned long * ) 0xE0044014 )
#define CAN1BTR                                       C1BTR
#define C1BTR_OFFSET                                  0x14
#define CAN1BTR_OFFSET                                C1BTR_OFFSET
#define C1BTR_BRP_MASK                                0x3FF
#define CAN1BTR_BRP_MASK                              C1BTR_BRP_MASK
#define C1BTR_BRP_BIT                                 0
#define CAN1BTR_BRP_BIT                               C1BTR_BRP_BIT
#define C1BTR_SJW_MASK                                0xC000
#define CAN1BTR_SJW_MASK                              C1BTR_SJW_MASK
#define C1BTR_SJW_BIT                                 14
#define CAN1BTR_SJW_BIT                               C1BTR_SJW_BIT
#define C1BTR_TSEG1_MASK                              0xF0000
#define CAN1BTR_TSEG1_MASK                            C1BTR_TSEG1_MASK
#define C1BTR_TSEG1_BIT                               16
#define CAN1BTR_TSEG1_BIT                             C1BTR_TSEG1_BIT
#define C1BTR_TSEG2_MASK                              0x700000
#define CAN1BTR_TSEG2_MASK                            C1BTR_TSEG2_MASK
#define C1BTR_TSEG2_BIT                               20
#define CAN1BTR_TSEG2_BIT                             C1BTR_TSEG2_BIT
#define C1BTR_SAM_MASK                                0x800000
#define CAN1BTR_SAM_MASK                              C1BTR_SAM_MASK
#define C1BTR_SAM                                     0x800000
#define CAN1BTR_SAM                                   C1BTR_SAM
#define C1BTR_SAM_BIT                                 23
#define CAN1BTR_SAM_BIT                               C1BTR_SAM_BIT

#define C1EWL                                         ( *( volatile unsigned long * ) 0xE0044018 )
#define CAN1EWL                                       C1EWL
#define C1EWL_OFFSET                                  0x18
#define CAN1EWL_OFFSET                                C1EWL_OFFSET
#define C1EWL_EWL_MASK                                0xFF
#define CAN1EWL_EWL_MASK                              C1EWL_EWL_MASK
#define C1EWL_EWL_BIT                                 0
#define CAN1EWL_EWL_BIT                               C1EWL_EWL_BIT

#define C1SR                                          ( *( volatile unsigned long * ) 0xE004401C )
#define CAN1SR                                        C1SR
#define C1SR_OFFSET                                   0x1C
#define CAN1SR_OFFSET                                 C1SR_OFFSET
#define C1SR_RBS_MASK                                 0x1
#define CAN1SR_RBS_MASK                               C1SR_RBS_MASK
#define C1SR_RBS                                      0x1
#define CAN1SR_RBS                                    C1SR_RBS
#define C1SR_RBS_BIT                                  0
#define CAN1SR_RBS_BIT                                C1SR_RBS_BIT
#define C1SR_DOS_MASK                                 0x2
#define CAN1SR_DOS_MASK                               C1SR_DOS_MASK
#define C1SR_DOS                                      0x2
#define CAN1SR_DOS                                    C1SR_DOS
#define C1SR_DOS_BIT                                  1
#define CAN1SR_DOS_BIT                                C1SR_DOS_BIT
#define C1SR_TBS1_MASK                                0x4
#define CAN1SR_TBS1_MASK                              C1SR_TBS1_MASK
#define C1SR_TBS1                                     0x4
#define CAN1SR_TBS1                                   C1SR_TBS1
#define C1SR_TBS1_BIT                                 2
#define CAN1SR_TBS1_BIT                               C1SR_TBS1_BIT
#define C1SR_TCS1_MASK                                0x8
#define CAN1SR_TCS1_MASK                              C1SR_TCS1_MASK
#define C1SR_TCS1                                     0x8
#define CAN1SR_TCS1                                   C1SR_TCS1
#define C1SR_TCS1_BIT                                 3
#define CAN1SR_TCS1_BIT                               C1SR_TCS1_BIT
#define C1SR_RS_MASK                                  0x10
#define CAN1SR_RS_MASK                                C1SR_RS_MASK
#define C1SR_RS                                       0x10
#define CAN1SR_RS                                     C1SR_RS
#define C1SR_RS_BIT                                   4
#define CAN1SR_RS_BIT                                 C1SR_RS_BIT
#define C1SR_TS1_MASK                                 0x20
#define CAN1SR_TS1_MASK                               C1SR_TS1_MASK
#define C1SR_TS1                                      0x20
#define CAN1SR_TS1                                    C1SR_TS1
#define C1SR_TS1_BIT                                  5
#define CAN1SR_TS1_BIT                                C1SR_TS1_BIT
#define C1SR_ES_MASK                                  0x40
#define CAN1SR_ES_MASK                                C1SR_ES_MASK
#define C1SR_ES                                       0x40
#define CAN1SR_ES                                     C1SR_ES
#define C1SR_ES_BIT                                   6
#define CAN1SR_ES_BIT                                 C1SR_ES_BIT
#define C1SR_BS_MASK                                  0x80
#define CAN1SR_BS_MASK                                C1SR_BS_MASK
#define C1SR_BS                                       0x80
#define CAN1SR_BS                                     C1SR_BS
#define C1SR_BS_BIT                                   7
#define CAN1SR_BS_BIT                                 C1SR_BS_BIT
#define C1SR_RBS2_MASK                                0x100
#define CAN1SR_RBS2_MASK                              C1SR_RBS2_MASK
#define C1SR_RBS2                                     0x100
#define CAN1SR_RBS2                                   C1SR_RBS2
#define C1SR_RBS2_BIT                                 8
#define CAN1SR_RBS2_BIT                               C1SR_RBS2_BIT
#define C1SR_DOS2_MASK                                0x200
#define CAN1SR_DOS2_MASK                              C1SR_DOS2_MASK
#define C1SR_DOS2                                     0x200
#define CAN1SR_DOS2                                   C1SR_DOS2
#define C1SR_DOS2_BIT                                 9
#define CAN1SR_DOS2_BIT                               C1SR_DOS2_BIT
#define C1SR_TBS2_MASK                                0x400
#define CAN1SR_TBS2_MASK                              C1SR_TBS2_MASK
#define C1SR_TBS2                                     0x400
#define CAN1SR_TBS2                                   C1SR_TBS2
#define C1SR_TBS2_BIT                                 10
#define CAN1SR_TBS2_BIT                               C1SR_TBS2_BIT
#define C1SR_TCS2_MASK                                0x800
#define CAN1SR_TCS2_MASK                              C1SR_TCS2_MASK
#define C1SR_TCS2                                     0x800
#define CAN1SR_TCS2                                   C1SR_TCS2
#define C1SR_TCS2_BIT                                 11
#define CAN1SR_TCS2_BIT                               C1SR_TCS2_BIT
#define C1SR_RS2_MASK                                 0x1000
#define CAN1SR_RS2_MASK                               C1SR_RS2_MASK
#define C1SR_RS2                                      0x1000
#define CAN1SR_RS2                                    C1SR_RS2
#define C1SR_RS2_BIT                                  12
#define CAN1SR_RS2_BIT                                C1SR_RS2_BIT
#define C1SR_TS2_MASK                                 0x2000
#define CAN1SR_TS2_MASK                               C1SR_TS2_MASK
#define C1SR_TS2                                      0x2000
#define CAN1SR_TS2                                    C1SR_TS2
#define C1SR_TS2_BIT                                  13
#define CAN1SR_TS2_BIT                                C1SR_TS2_BIT
#define C1SR_ES2_MASK                                 0x4000
#define CAN1SR_ES2_MASK                               C1SR_ES2_MASK
#define C1SR_ES2                                      0x4000
#define CAN1SR_ES2                                    C1SR_ES2
#define C1SR_ES2_BIT                                  14
#define CAN1SR_ES2_BIT                                C1SR_ES2_BIT
#define C1SR_BS2_MASK                                 0x8000
#define CAN1SR_BS2_MASK                               C1SR_BS2_MASK
#define C1SR_BS2                                      0x8000
#define CAN1SR_BS2                                    C1SR_BS2
#define C1SR_BS2_BIT                                  15
#define CAN1SR_BS2_BIT                                C1SR_BS2_BIT
#define C1SR_RBS3_MASK                                0x10000
#define CAN1SR_RBS3_MASK                              C1SR_RBS3_MASK
#define C1SR_RBS3                                     0x10000
#define CAN1SR_RBS3                                   C1SR_RBS3
#define C1SR_RBS3_BIT                                 16
#define CAN1SR_RBS3_BIT                               C1SR_RBS3_BIT
#define C1SR_DOS3_MASK                                0x20000
#define CAN1SR_DOS3_MASK                              C1SR_DOS3_MASK
#define C1SR_DOS3                                     0x20000
#define CAN1SR_DOS3                                   C1SR_DOS3
#define C1SR_DOS3_BIT                                 17
#define CAN1SR_DOS3_BIT                               C1SR_DOS3_BIT
#define C1SR_TBS3_MASK                                0x40000
#define CAN1SR_TBS3_MASK                              C1SR_TBS3_MASK
#define C1SR_TBS3                                     0x40000
#define CAN1SR_TBS3                                   C1SR_TBS3
#define C1SR_TBS3_BIT                                 18
#define CAN1SR_TBS3_BIT                               C1SR_TBS3_BIT
#define C1SR_TCS3_MASK                                0x80000
#define CAN1SR_TCS3_MASK                              C1SR_TCS3_MASK
#define C1SR_TCS3                                     0x80000
#define CAN1SR_TCS3                                   C1SR_TCS3
#define C1SR_TCS3_BIT                                 19
#define CAN1SR_TCS3_BIT                               C1SR_TCS3_BIT
#define C1SR_RS3_MASK                                 0x100000
#define CAN1SR_RS3_MASK                               C1SR_RS3_MASK
#define C1SR_RS3                                      0x100000
#define CAN1SR_RS3                                    C1SR_RS3
#define C1SR_RS3_BIT                                  20
#define CAN1SR_RS3_BIT                                C1SR_RS3_BIT
#define C1SR_TS3_MASK                                 0x200000
#define CAN1SR_TS3_MASK                               C1SR_TS3_MASK
#define C1SR_TS3                                      0x200000
#define CAN1SR_TS3                                    C1SR_TS3
#define C1SR_TS3_BIT                                  21
#define CAN1SR_TS3_BIT                                C1SR_TS3_BIT
#define C1SR_ES3_MASK                                 0x400000
#define CAN1SR_ES3_MASK                               C1SR_ES3_MASK
#define C1SR_ES3                                      0x400000
#define CAN1SR_ES3                                    C1SR_ES3
#define C1SR_ES3_BIT                                  22
#define CAN1SR_ES3_BIT                                C1SR_ES3_BIT
#define C1SR_BS3_MASK                                 0x800000
#define CAN1SR_BS3_MASK                               C1SR_BS3_MASK
#define C1SR_BS3                                      0x800000
#define CAN1SR_BS3                                    C1SR_BS3
#define C1SR_BS3_BIT                                  23
#define CAN1SR_BS3_BIT                                C1SR_BS3_BIT

#define C1RFS                                         ( *( volatile unsigned long * ) 0xE0044020 )
#define CAN1RFS                                       C1RFS
#define C1RFS_OFFSET                                  0x20
#define CAN1RFS_OFFSET                                C1RFS_OFFSET
#define C1RFS_ID_Index_MASK                           0x3FF
#define CAN1RFS_ID_Index_MASK                         C1RFS_ID_Index_MASK
#define C1RFS_ID_Index_BIT                            0
#define CAN1RFS_ID_Index_BIT                          C1RFS_ID_Index_BIT
#define C1RFS_BP_MASK                                 0x400
#define CAN1RFS_BP_MASK                               C1RFS_BP_MASK
#define C1RFS_BP                                      0x400
#define CAN1RFS_BP                                    C1RFS_BP
#define C1RFS_BP_BIT                                  10
#define CAN1RFS_BP_BIT                                C1RFS_BP_BIT
#define C1RFS_DLC_MASK                                0xF0000
#define CAN1RFS_DLC_MASK                              C1RFS_DLC_MASK
#define C1RFS_DLC_BIT                                 16
#define CAN1RFS_DLC_BIT                               C1RFS_DLC_BIT
#define C1RFS_RTR_MASK                                0x40000000
#define CAN1RFS_RTR_MASK                              C1RFS_RTR_MASK
#define C1RFS_RTR                                     0x40000000
#define CAN1RFS_RTR                                   C1RFS_RTR
#define C1RFS_RTR_BIT                                 30
#define CAN1RFS_RTR_BIT                               C1RFS_RTR_BIT
#define C1RFS_FF_MASK                                 0x80000000
#define CAN1RFS_FF_MASK                               C1RFS_FF_MASK
#define C1RFS_FF                                      0x80000000
#define CAN1RFS_FF                                    C1RFS_FF
#define C1RFS_FF_BIT                                  31
#define CAN1RFS_FF_BIT                                C1RFS_FF_BIT

#define C1RID                                         ( *( volatile unsigned long * ) 0xE0044024 )
#define CAN1RID                                       C1RID
#define C1RID_OFFSET                                  0x24
#define CAN1RID_OFFSET                                C1RID_OFFSET
#define C1RID_ID_MASK                                 0x7FF
#define CAN1RID_ID_MASK                               C1RID_ID_MASK
#define C1RID_ID_BIT                                  0
#define CAN1RID_ID_BIT                                C1RID_ID_BIT

#define C1RDA                                         ( *( volatile unsigned long * ) 0xE0044028 )
#define CAN1RDA                                       C1RDA
#define C1RDA_OFFSET                                  0x28
#define CAN1RDA_OFFSET                                C1RDA_OFFSET
#define C1RDA_Data_1_MASK                             0xFF
#define CAN1RDA_Data_1_MASK                           C1RDA_Data_1_MASK
#define C1RDA_Data_1_BIT                              0
#define CAN1RDA_Data_1_BIT                            C1RDA_Data_1_BIT
#define C1RDA_Data_2_MASK                             0xFF00
#define CAN1RDA_Data_2_MASK                           C1RDA_Data_2_MASK
#define C1RDA_Data_2_BIT                              8
#define CAN1RDA_Data_2_BIT                            C1RDA_Data_2_BIT
#define C1RDA_Data_3_MASK                             0xFF0000
#define CAN1RDA_Data_3_MASK                           C1RDA_Data_3_MASK
#define C1RDA_Data_3_BIT                              16
#define CAN1RDA_Data_3_BIT                            C1RDA_Data_3_BIT
#define C1RDA_Data_4_MASK                             0xFF000000
#define CAN1RDA_Data_4_MASK                           C1RDA_Data_4_MASK
#define C1RDA_Data_4_BIT                              24
#define CAN1RDA_Data_4_BIT                            C1RDA_Data_4_BIT

