FreeRTOS/FreeRTOS/FreeRTOS/Demo/ARM7_LPC2138_Rowley/LPC21xx.h
#define C1RDB                                         ( *( volatile unsigned long * ) 0xE004402C )
#define CAN1RDB                                       C1RDB
#define C1RDB_OFFSET                                  0x2C
#define CAN1RDB_OFFSET                                C1RDB_OFFSET
#define C1RDB_Data_5_MASK                             0xFF
#define CAN1RDB_Data_5_MASK                           C1RDB_Data_5_MASK
#define C1RDB_Data_5_BIT                              0
#define CAN1RDB_Data_5_BIT                            C1RDB_Data_5_BIT
#define C1RDB_Data_6_MASK                             0xFF00
#define CAN1RDB_Data_6_MASK                           C1RDB_Data_6_MASK
#define C1RDB_Data_6_BIT                              8
#define CAN1RDB_Data_6_BIT                            C1RDB_Data_6_BIT
#define C1RDB_Data_7_MASK                             0xFF0000
#define CAN1RDB_Data_7_MASK                           C1RDB_Data_7_MASK
#define C1RDB_Data_7_BIT                              16
#define CAN1RDB_Data_7_BIT                            C1RDB_Data_7_BIT
#define C1RDB_Data_8_MASK                             0xFF000000
#define CAN1RDB_Data_8_MASK                           C1RDB_Data_8_MASK
#define C1RDB_Data_8_BIT                              24
#define CAN1RDB_Data_8_BIT                            C1RDB_Data_8_BIT

#define C1TFI1                                        ( *( volatile unsigned long * ) 0xE0044030 )
#define CAN1TFI1                                      C1TFI1
#define C1TFI1_OFFSET                                 0x30
#define CAN1TFI1_OFFSET                               C1TFI1_OFFSET
#define C1TFI1_PRIO_MASK                              0xFF
#define CAN1TFI1_PRIO_MASK                            C1TFI1_PRIO_MASK
#define C1TFI1_PRIO_BIT                               0
#define CAN1TFI1_PRIO_BIT                             C1TFI1_PRIO_BIT
#define C1TFI1_DLC_MASK                               0xF0000
#define CAN1TFI1_DLC_MASK                             C1TFI1_DLC_MASK
#define C1TFI1_DLC_BIT                                16
#define CAN1TFI1_DLC_BIT                              C1TFI1_DLC_BIT
#define C1TFI1_RTR_MASK                               0x40000000
#define CAN1TFI1_RTR_MASK                             C1TFI1_RTR_MASK
#define C1TFI1_RTR                                    0x40000000
#define CAN1TFI1_RTR                                  C1TFI1_RTR
#define C1TFI1_RTR_BIT                                30
#define CAN1TFI1_RTR_BIT                              C1TFI1_RTR_BIT
#define C1TFI1_FF_MASK                                0x80000000
#define CAN1TFI1_FF_MASK                              C1TFI1_FF_MASK
#define C1TFI1_FF                                     0x80000000
#define CAN1TFI1_FF                                   C1TFI1_FF
#define C1TFI1_FF_BIT                                 31
#define CAN1TFI1_FF_BIT                               C1TFI1_FF_BIT

#define C1TID1                                        ( *( volatile unsigned long * ) 0xE0044034 )
#define CAN1TID1                                      C1TID1
#define C1TID1_OFFSET                                 0x34
#define CAN1TID1_OFFSET                               C1TID1_OFFSET
#define C1TID1_ID_MASK                                0x7FF
#define CAN1TID1_ID_MASK                              C1TID1_ID_MASK
#define C1TID1_ID_BIT                                 0
#define CAN1TID1_ID_BIT                               C1TID1_ID_BIT

#define C1TDA1                                        ( *( volatile unsigned long * ) 0xE0044038 )
#define CAN1TDA1                                      C1TDA1
#define C1TDA1_OFFSET                                 0x38
#define CAN1TDA1_OFFSET                               C1TDA1_OFFSET
#define C1TDA1_Data_1_MASK                            0xFF
#define CAN1TDA1_Data_1_MASK                          C1TDA1_Data_1_MASK
#define C1TDA1_Data_1_BIT                             0
#define CAN1TDA1_Data_1_BIT                           C1TDA1_Data_1_BIT
#define C1TDA1_Data_2_MASK                            0xFF00
#define CAN1TDA1_Data_2_MASK                          C1TDA1_Data_2_MASK
#define C1TDA1_Data_2_BIT                             8
#define CAN1TDA1_Data_2_BIT                           C1TDA1_Data_2_BIT
#define C1TDA1_Data_3_MASK                            0xFF0000
#define CAN1TDA1_Data_3_MASK                          C1TDA1_Data_3_MASK
#define C1TDA1_Data_3_BIT                             16
#define CAN1TDA1_Data_3_BIT                           C1TDA1_Data_3_BIT
#define C1TDA1_Data_4_MASK                            0xFF000000
#define CAN1TDA1_Data_4_MASK                          C1TDA1_Data_4_MASK
#define C1TDA1_Data_4_BIT                             24
#define CAN1TDA1_Data_4_BIT                           C1TDA1_Data_4_BIT

#define C1TDB1                                        ( *( volatile unsigned long * ) 0xE004403C )
#define CAN1TDB1                                      C1TDB1
#define C1TDB1_OFFSET                                 0x3C
#define CAN1TDB1_OFFSET                               C1TDB1_OFFSET
#define C1TDB1_Data_5_MASK                            0xFF
#define CAN1TDB1_Data_5_MASK                          C1TDB1_Data_5_MASK
#define C1TDB1_Data_5_BIT                             0
#define CAN1TDB1_Data_5_BIT                           C1TDB1_Data_5_BIT
#define C1TDB1_Data_6_MASK                            0xFF00
#define CAN1TDB1_Data_6_MASK                          C1TDB1_Data_6_MASK
#define C1TDB1_Data_6_BIT                             8
#define CAN1TDB1_Data_6_BIT                           C1TDB1_Data_6_BIT
#define C1TDB1_Data_7_MASK                            0xFF0000
#define CAN1TDB1_Data_7_MASK                          C1TDB1_Data_7_MASK
#define C1TDB1_Data_7_BIT                             16
#define CAN1TDB1_Data_7_BIT                           C1TDB1_Data_7_BIT
#define C1TDB1_Data_8_MASK                            0xFF000000
#define CAN1TDB1_Data_8_MASK                          C1TDB1_Data_8_MASK
#define C1TDB1_Data_8_BIT                             24
#define CAN1TDB1_Data_8_BIT                           C1TDB1_Data_8_BIT

