FreeRTOS/FreeRTOS/FreeRTOS/Demo/ARM7_LPC2138_Rowley/LPC21xx.h
#define C1TFI2                                        ( *( volatile unsigned long * ) 0xE0044040 )
#define CAN1TFI2                                      C1TFI2
#define C1TFI2_OFFSET                                 0x40
#define CAN1TFI2_OFFSET                               C1TFI2_OFFSET
#define C1TFI2_PRIO_MASK                              0xFF
#define CAN1TFI2_PRIO_MASK                            C1TFI2_PRIO_MASK
#define C1TFI2_PRIO_BIT                               0
#define CAN1TFI2_PRIO_BIT                             C1TFI2_PRIO_BIT
#define C1TFI2_DLC_MASK                               0xF0000
#define CAN1TFI2_DLC_MASK                             C1TFI2_DLC_MASK
#define C1TFI2_DLC_BIT                                16
#define CAN1TFI2_DLC_BIT                              C1TFI2_DLC_BIT
#define C1TFI2_RTR_MASK                               0x40000000
#define CAN1TFI2_RTR_MASK                             C1TFI2_RTR_MASK
#define C1TFI2_RTR                                    0x40000000
#define CAN1TFI2_RTR                                  C1TFI2_RTR
#define C1TFI2_RTR_BIT                                30
#define CAN1TFI2_RTR_BIT                              C1TFI2_RTR_BIT
#define C1TFI2_FF_MASK                                0x80000000
#define CAN1TFI2_FF_MASK                              C1TFI2_FF_MASK
#define C1TFI2_FF                                     0x80000000
#define CAN1TFI2_FF                                   C1TFI2_FF
#define C1TFI2_FF_BIT                                 31
#define CAN1TFI2_FF_BIT                               C1TFI2_FF_BIT

#define C1TID2                                        ( *( volatile unsigned long * ) 0xE0044044 )
#define CAN1TID2                                      C1TID2
#define C1TID2_OFFSET                                 0x44
#define CAN1TID2_OFFSET                               C1TID2_OFFSET
#define C1TID2_ID_MASK                                0x7FF
#define CAN1TID2_ID_MASK                              C1TID2_ID_MASK
#define C1TID2_ID_BIT                                 0
#define CAN1TID2_ID_BIT                               C1TID2_ID_BIT

#define C1TDA2                                        ( *( volatile unsigned long * ) 0xE0044048 )
#define CAN1TDA2                                      C1TDA2
#define C1TDA2_OFFSET                                 0x48
#define CAN1TDA2_OFFSET                               C1TDA2_OFFSET
#define C1TDA2_Data_1_MASK                            0xFF
#define CAN1TDA2_Data_1_MASK                          C1TDA2_Data_1_MASK
#define C1TDA2_Data_1_BIT                             0
#define CAN1TDA2_Data_1_BIT                           C1TDA2_Data_1_BIT
#define C1TDA2_Data_2_MASK                            0xFF00
#define CAN1TDA2_Data_2_MASK                          C1TDA2_Data_2_MASK
#define C1TDA2_Data_2_BIT                             8
#define CAN1TDA2_Data_2_BIT                           C1TDA2_Data_2_BIT
#define C1TDA2_Data_3_MASK                            0xFF0000
#define CAN1TDA2_Data_3_MASK                          C1TDA2_Data_3_MASK
#define C1TDA2_Data_3_BIT                             16
#define CAN1TDA2_Data_3_BIT                           C1TDA2_Data_3_BIT
#define C1TDA2_Data_4_MASK                            0xFF000000
#define CAN1TDA2_Data_4_MASK                          C1TDA2_Data_4_MASK
#define C1TDA2_Data_4_BIT                             24
#define CAN1TDA2_Data_4_BIT                           C1TDA2_Data_4_BIT

#define C1TDB2                                        ( *( volatile unsigned long * ) 0xE004404C )
#define CAN1TDB2                                      C1TDB2
#define C1TDB2_OFFSET                                 0x4C
#define CAN1TDB2_OFFSET                               C1TDB2_OFFSET
#define C1TDB2_Data_5_MASK                            0xFF
#define CAN1TDB2_Data_5_MASK                          C1TDB2_Data_5_MASK
#define C1TDB2_Data_5_BIT                             0
#define CAN1TDB2_Data_5_BIT                           C1TDB2_Data_5_BIT
#define C1TDB2_Data_6_MASK                            0xFF00
#define CAN1TDB2_Data_6_MASK                          C1TDB2_Data_6_MASK
#define C1TDB2_Data_6_BIT                             8
#define CAN1TDB2_Data_6_BIT                           C1TDB2_Data_6_BIT
#define C1TDB2_Data_7_MASK                            0xFF0000
#define CAN1TDB2_Data_7_MASK                          C1TDB2_Data_7_MASK
#define C1TDB2_Data_7_BIT                             16
#define CAN1TDB2_Data_7_BIT                           C1TDB2_Data_7_BIT
#define C1TDB2_Data_8_MASK                            0xFF000000
#define CAN1TDB2_Data_8_MASK                          C1TDB2_Data_8_MASK
#define C1TDB2_Data_8_BIT                             24
#define CAN1TDB2_Data_8_BIT                           C1TDB2_Data_8_BIT

#define C1TFI3                                        ( *( volatile unsigned long * ) 0xE0044050 )
#define CAN1TFI3                                      C1TFI3
#define C1TFI3_OFFSET                                 0x50
#define CAN1TFI3_OFFSET                               C1TFI3_OFFSET
#define C1TFI3_PRIO_MASK                              0xFF
#define CAN1TFI3_PRIO_MASK                            C1TFI3_PRIO_MASK
#define C1TFI3_PRIO_BIT                               0
#define CAN1TFI3_PRIO_BIT                             C1TFI3_PRIO_BIT
#define C1TFI3_DLC_MASK                               0xF0000
#define CAN1TFI3_DLC_MASK                             C1TFI3_DLC_MASK
#define C1TFI3_DLC_BIT                                16
#define CAN1TFI3_DLC_BIT                              C1TFI3_DLC_BIT
#define C1TFI3_RTR_MASK                               0x40000000
#define CAN1TFI3_RTR_MASK                             C1TFI3_RTR_MASK
#define C1TFI3_RTR                                    0x40000000
#define CAN1TFI3_RTR                                  C1TFI3_RTR
#define C1TFI3_RTR_BIT                                30
#define CAN1TFI3_RTR_BIT                              C1TFI3_RTR_BIT
#define C1TFI3_FF_MASK                                0x80000000
#define CAN1TFI3_FF_MASK                              C1TFI3_FF_MASK
#define C1TFI3_FF                                     0x80000000
#define CAN1TFI3_FF                                   C1TFI3_FF
#define C1TFI3_FF_BIT                                 31
#define CAN1TFI3_FF_BIT                               C1TFI3_FF_BIT

#define C1TID3                                        ( *( volatile unsigned long * ) 0xE0044054 )
#define CAN1TID3                                      C1TID3
#define C1TID3_OFFSET                                 0x54
#define CAN1TID3_OFFSET                               C1TID3_OFFSET
#define C1TID3_ID_MASK                                0x7FF
#define CAN1TID3_ID_MASK                              C1TID3_ID_MASK
#define C1TID3_ID_BIT                                 0
#define CAN1TID3_ID_BIT                               C1TID3_ID_BIT

#define C1TDA3                                        ( *( volatile unsigned long * ) 0xE0044058 )
#define CAN1TDA3                                      C1TDA3
#define C1TDA3_OFFSET                                 0x58
#define CAN1TDA3_OFFSET                               C1TDA3_OFFSET
#define C1TDA3_Data_1_MASK                            0xFF
#define CAN1TDA3_Data_1_MASK                          C1TDA3_Data_1_MASK
#define C1TDA3_Data_1_BIT                             0
#define CAN1TDA3_Data_1_BIT                           C1TDA3_Data_1_BIT
#define C1TDA3_Data_2_MASK                            0xFF00
#define CAN1TDA3_Data_2_MASK                          C1TDA3_Data_2_MASK
#define C1TDA3_Data_2_BIT                             8
#define CAN1TDA3_Data_2_BIT                           C1TDA3_Data_2_BIT
#define C1TDA3_Data_3_MASK                            0xFF0000
#define CAN1TDA3_Data_3_MASK                          C1TDA3_Data_3_MASK
#define C1TDA3_Data_3_BIT                             16
#define CAN1TDA3_Data_3_BIT                           C1TDA3_Data_3_BIT
#define C1TDA3_Data_4_MASK                            0xFF000000
#define CAN1TDA3_Data_4_MASK                          C1TDA3_Data_4_MASK
#define C1TDA3_Data_4_BIT                             24
#define CAN1TDA3_Data_4_BIT                           C1TDA3_Data_4_BIT

#define C1TDB3                                        ( *( volatile unsigned long * ) 0xE004405C )
#define CAN1TDB3                                      C1TDB3
#define C1TDB3_OFFSET                                 0x5C
#define CAN1TDB3_OFFSET                               C1TDB3_OFFSET
#define C1TDB3_Data_5_MASK                            0xFF
#define CAN1TDB3_Data_5_MASK                          C1TDB3_Data_5_MASK
#define C1TDB3_Data_5_BIT                             0
#define CAN1TDB3_Data_5_BIT                           C1TDB3_Data_5_BIT
#define C1TDB3_Data_6_MASK                            0xFF00
#define CAN1TDB3_Data_6_MASK                          C1TDB3_Data_6_MASK
#define C1TDB3_Data_6_BIT                             8
#define CAN1TDB3_Data_6_BIT                           C1TDB3_Data_6_BIT
#define C1TDB3_Data_7_MASK                            0xFF0000
#define CAN1TDB3_Data_7_MASK                          C1TDB3_Data_7_MASK
#define C1TDB3_Data_7_BIT                             16
#define CAN1TDB3_Data_7_BIT                           C1TDB3_Data_7_BIT
#define C1TDB3_Data_8_MASK                            0xFF000000
#define CAN1TDB3_Data_8_MASK                          C1TDB3_Data_8_MASK
#define C1TDB3_Data_8_BIT                             24
#define CAN1TDB3_Data_8_BIT                           C1TDB3_Data_8_BIT

