FreeRTOS/FreeRTOS/FreeRTOS/Demo/ARM7_LPC2138_Rowley/LPC21xx.h
#define CAN2_BASE                                     0xE0048000

#define C2MOD                                         ( *( volatile unsigned long * ) 0xE0048000 )
#define CAN2MOD                                       C2MOD
#define C2MOD_OFFSET                                  0x0
#define CAN2MOD_OFFSET                                C2MOD_OFFSET
#define C2MOD_RM_MASK                                 0x1
#define CAN2MOD_RM_MASK                               C2MOD_RM_MASK
#define C2MOD_RM                                      0x1
#define CAN2MOD_RM                                    C2MOD_RM
#define C2MOD_RM_BIT                                  0
#define CAN2MOD_RM_BIT                                C2MOD_RM_BIT
#define C2MOD_LOM_MASK                                0x2
#define CAN2MOD_LOM_MASK                              C2MOD_LOM_MASK
#define C2MOD_LOM                                     0x2
#define CAN2MOD_LOM                                   C2MOD_LOM
#define C2MOD_LOM_BIT                                 1
#define CAN2MOD_LOM_BIT                               C2MOD_LOM_BIT
#define C2MOD_STM_MASK                                0x4
#define CAN2MOD_STM_MASK                              C2MOD_STM_MASK
#define C2MOD_STM                                     0x4
#define CAN2MOD_STM                                   C2MOD_STM
#define C2MOD_STM_BIT                                 2
#define CAN2MOD_STM_BIT                               C2MOD_STM_BIT
#define C2MOD_TPM_MASK                                0x8
#define CAN2MOD_TPM_MASK                              C2MOD_TPM_MASK
#define C2MOD_TPM                                     0x8
#define CAN2MOD_TPM                                   C2MOD_TPM
#define C2MOD_TPM_BIT                                 3
#define CAN2MOD_TPM_BIT                               C2MOD_TPM_BIT
#define C2MOD_SM_MASK                                 0x10
#define CAN2MOD_SM_MASK                               C2MOD_SM_MASK
#define C2MOD_SM                                      0x10
#define CAN2MOD_SM                                    C2MOD_SM
#define C2MOD_SM_BIT                                  4
#define CAN2MOD_SM_BIT                                C2MOD_SM_BIT
#define C2MOD_RPM_MASK                                0x20
#define CAN2MOD_RPM_MASK                              C2MOD_RPM_MASK
#define C2MOD_RPM                                     0x20
#define CAN2MOD_RPM                                   C2MOD_RPM
#define C2MOD_RPM_BIT                                 5
#define CAN2MOD_RPM_BIT                               C2MOD_RPM_BIT
#define C2MOD_TM_MASK                                 0x80
#define CAN2MOD_TM_MASK                               C2MOD_TM_MASK
#define C2MOD_TM                                      0x80
#define CAN2MOD_TM                                    C2MOD_TM
#define C2MOD_TM_BIT                                  7
#define CAN2MOD_TM_BIT                                C2MOD_TM_BIT

#define C2CMR                                         ( *( volatile unsigned long * ) 0xE0048004 )
#define CAN2CMR                                       C2CMR
#define C2CMR_OFFSET                                  0x4
#define CAN2CMR_OFFSET                                C2CMR_OFFSET
#define C2CMR_TR_MASK                                 0x1
#define CAN2CMR_TR_MASK                               C2CMR_TR_MASK
#define C2CMR_TR                                      0x1
#define CAN2CMR_TR                                    C2CMR_TR
#define C2CMR_TR_BIT                                  0
#define CAN2CMR_TR_BIT                                C2CMR_TR_BIT
#define C2CMR_AT_MASK                                 0x2
#define CAN2CMR_AT_MASK                               C2CMR_AT_MASK
#define C2CMR_AT                                      0x2
#define CAN2CMR_AT                                    C2CMR_AT
#define C2CMR_AT_BIT                                  1
#define CAN2CMR_AT_BIT                                C2CMR_AT_BIT
#define C2CMR_RRB_MASK                                0x4
#define CAN2CMR_RRB_MASK                              C2CMR_RRB_MASK
#define C2CMR_RRB                                     0x4
#define CAN2CMR_RRB                                   C2CMR_RRB
#define C2CMR_RRB_BIT                                 2
#define CAN2CMR_RRB_BIT                               C2CMR_RRB_BIT
#define C2CMR_CDO_MASK                                0x8
#define CAN2CMR_CDO_MASK                              C2CMR_CDO_MASK
#define C2CMR_CDO                                     0x8
#define CAN2CMR_CDO                                   C2CMR_CDO
#define C2CMR_CDO_BIT                                 3
#define CAN2CMR_CDO_BIT                               C2CMR_CDO_BIT
#define C2CMR_SRR_MASK                                0x10
#define CAN2CMR_SRR_MASK                              C2CMR_SRR_MASK
#define C2CMR_SRR                                     0x10
#define CAN2CMR_SRR                                   C2CMR_SRR
#define C2CMR_SRR_BIT                                 4
#define CAN2CMR_SRR_BIT                               C2CMR_SRR_BIT
#define C2CMR_STB1_MASK                               0x20
#define CAN2CMR_STB1_MASK                             C2CMR_STB1_MASK
#define C2CMR_STB1                                    0x20
#define CAN2CMR_STB1                                  C2CMR_STB1
#define C2CMR_STB1_BIT                                5
#define CAN2CMR_STB1_BIT                              C2CMR_STB1_BIT
#define C2CMR_STB2_MASK                               0x40
#define CAN2CMR_STB2_MASK                             C2CMR_STB2_MASK
#define C2CMR_STB2                                    0x40
#define CAN2CMR_STB2                                  C2CMR_STB2
#define C2CMR_STB2_BIT                                6
#define CAN2CMR_STB2_BIT                              C2CMR_STB2_BIT
#define C2CMR_STB3_MASK                               0x80
#define CAN2CMR_STB3_MASK                             C2CMR_STB3_MASK
#define C2CMR_STB3                                    0x80
#define CAN2CMR_STB3                                  C2CMR_STB3
#define C2CMR_STB3_BIT                                7
#define CAN2CMR_STB3_BIT                              C2CMR_STB3_BIT

#define C2GSR                                         ( *( volatile unsigned long * ) 0xE0048008 )
#define CAN2GSR                                       C2GSR
#define C2GSR_OFFSET                                  0x8
#define CAN2GSR_OFFSET                                C2GSR_OFFSET
#define C2GSR_RBS_MASK                                0x1
#define CAN2GSR_RBS_MASK                              C2GSR_RBS_MASK
#define C2GSR_RBS                                     0x1
#define CAN2GSR_RBS                                   C2GSR_RBS
#define C2GSR_RBS_BIT                                 0
#define CAN2GSR_RBS_BIT                               C2GSR_RBS_BIT
#define C2GSR_DOS_MASK                                0x2
#define CAN2GSR_DOS_MASK                              C2GSR_DOS_MASK
#define C2GSR_DOS                                     0x2
#define CAN2GSR_DOS                                   C2GSR_DOS
#define C2GSR_DOS_BIT                                 1
#define CAN2GSR_DOS_BIT                               C2GSR_DOS_BIT
#define C2GSR_TBS_MASK                                0x4
#define CAN2GSR_TBS_MASK                              C2GSR_TBS_MASK
#define C2GSR_TBS                                     0x4
#define CAN2GSR_TBS                                   C2GSR_TBS
#define C2GSR_TBS_BIT                                 2
#define CAN2GSR_TBS_BIT                               C2GSR_TBS_BIT
#define C2GSR_TCS_MASK                                0x8
#define CAN2GSR_TCS_MASK                              C2GSR_TCS_MASK
#define C2GSR_TCS                                     0x8
#define CAN2GSR_TCS                                   C2GSR_TCS
#define C2GSR_TCS_BIT                                 3
#define CAN2GSR_TCS_BIT                               C2GSR_TCS_BIT
#define C2GSR_RS_MASK                                 0x10
#define CAN2GSR_RS_MASK                               C2GSR_RS_MASK
#define C2GSR_RS                                      0x10
#define CAN2GSR_RS                                    C2GSR_RS
#define C2GSR_RS_BIT                                  4
#define CAN2GSR_RS_BIT                                C2GSR_RS_BIT
#define C2GSR_TS_MASK                                 0x20
#define CAN2GSR_TS_MASK                               C2GSR_TS_MASK
#define C2GSR_TS                                      0x20
#define CAN2GSR_TS                                    C2GSR_TS
#define C2GSR_TS_BIT                                  5
#define CAN2GSR_TS_BIT                                C2GSR_TS_BIT
#define C2GSR_ES_MASK                                 0x40
#define CAN2GSR_ES_MASK                               C2GSR_ES_MASK
#define C2GSR_ES                                      0x40
#define CAN2GSR_ES                                    C2GSR_ES
#define C2GSR_ES_BIT                                  6
#define CAN2GSR_ES_BIT                                C2GSR_ES_BIT
#define C2GSR_BS_MASK                                 0x80
#define CAN2GSR_BS_MASK                               C2GSR_BS_MASK
#define C2GSR_BS                                      0x80
#define CAN2GSR_BS                                    C2GSR_BS
#define C2GSR_BS_BIT                                  7
#define CAN2GSR_BS_BIT                                C2GSR_BS_BIT
#define C2GSR_RXERR_MASK                              0xFF0000
#define CAN2GSR_RXERR_MASK                            C2GSR_RXERR_MASK
#define C2GSR_RXERR_BIT                               16
#define CAN2GSR_RXERR_BIT                             C2GSR_RXERR_BIT
#define C2GSR_TXERR_MASK                              0xFF000000
#define CAN2GSR_TXERR_MASK                            C2GSR_TXERR_MASK
#define C2GSR_TXERR_BIT                               24
#define CAN2GSR_TXERR_BIT                             C2GSR_TXERR_BIT

#define C2ICR                                         ( *( volatile unsigned long * ) 0xE004800C )
#define CAN2ICR                                       C2ICR
#define C2ICR_OFFSET                                  0xC
#define CAN2ICR_OFFSET                                C2ICR_OFFSET
#define C2ICR_RI_MASK                                 0x1
#define CAN2ICR_RI_MASK                               C2ICR_RI_MASK
#define C2ICR_RI                                      0x1
#define CAN2ICR_RI                                    C2ICR_RI
#define C2ICR_RI_BIT                                  0
#define CAN2ICR_RI_BIT                                C2ICR_RI_BIT
#define C2ICR_TI1_MASK                                0x2
#define CAN2ICR_TI1_MASK                              C2ICR_TI1_MASK
#define C2ICR_TI1                                     0x2
#define CAN2ICR_TI1                                   C2ICR_TI1
#define C2ICR_TI1_BIT                                 1
#define CAN2ICR_TI1_BIT                               C2ICR_TI1_BIT
#define C2ICR_EI_MASK                                 0x4
#define CAN2ICR_EI_MASK                               C2ICR_EI_MASK
#define C2ICR_EI                                      0x4
#define CAN2ICR_EI                                    C2ICR_EI
#define C2ICR_EI_BIT                                  2
#define CAN2ICR_EI_BIT                                C2ICR_EI_BIT
#define C2ICR_DOI_MASK                                0x8
#define CAN2ICR_DOI_MASK                              C2ICR_DOI_MASK
#define C2ICR_DOI                                     0x8
#define CAN2ICR_DOI                                   C2ICR_DOI
#define C2ICR_DOI_BIT                                 3
#define CAN2ICR_DOI_BIT                               C2ICR_DOI_BIT
#define C2ICR_WUI_MASK                                0x10
#define CAN2ICR_WUI_MASK                              C2ICR_WUI_MASK
#define C2ICR_WUI                                     0x10
#define CAN2ICR_WUI                                   C2ICR_WUI
#define C2ICR_WUI_BIT                                 4
#define CAN2ICR_WUI_BIT                               C2ICR_WUI_BIT
#define C2ICR_EPI_MASK                                0x20
#define CAN2ICR_EPI_MASK                              C2ICR_EPI_MASK
#define C2ICR_EPI                                     0x20
#define CAN2ICR_EPI                                   C2ICR_EPI
#define C2ICR_EPI_BIT                                 5
#define CAN2ICR_EPI_BIT                               C2ICR_EPI_BIT
#define C2ICR_ALI_MASK                                0x40
#define CAN2ICR_ALI_MASK                              C2ICR_ALI_MASK
#define C2ICR_ALI                                     0x40
#define CAN2ICR_ALI                                   C2ICR_ALI
#define C2ICR_ALI_BIT                                 6
#define CAN2ICR_ALI_BIT                               C2ICR_ALI_BIT
#define C2ICR_BEI_MASK                                0x80
#define CAN2ICR_BEI_MASK                              C2ICR_BEI_MASK
#define C2ICR_BEI                                     0x80
#define CAN2ICR_BEI                                   C2ICR_BEI
#define C2ICR_BEI_BIT                                 7
#define CAN2ICR_BEI_BIT                               C2ICR_BEI_BIT
#define C2ICR_IDI_MASK                                0x100
#define CAN2ICR_IDI_MASK                              C2ICR_IDI_MASK
#define C2ICR_IDI                                     0x100
#define CAN2ICR_IDI                                   C2ICR_IDI
#define C2ICR_IDI_BIT                                 8
#define CAN2ICR_IDI_BIT                               C2ICR_IDI_BIT
#define C2ICR_TI2_MASK                                0x200
#define CAN2ICR_TI2_MASK                              C2ICR_TI2_MASK
#define C2ICR_TI2                                     0x200
#define CAN2ICR_TI2                                   C2ICR_TI2
#define C2ICR_TI2_BIT                                 9
#define CAN2ICR_TI2_BIT                               C2ICR_TI2_BIT
#define C2ICR_TI3_MASK                                0x400
#define CAN2ICR_TI3_MASK                              C2ICR_TI3_MASK
#define C2ICR_TI3                                     0x400
#define CAN2ICR_TI3                                   C2ICR_TI3
#define C2ICR_TI3_BIT                                 10
#define CAN2ICR_TI3_BIT                               C2ICR_TI3_BIT
#define C2ICR_ERRBIT_MASK                             0x1F0000
#define CAN2ICR_ERRBIT_MASK                           C2ICR_ERRBIT_MASK
#define C2ICR_ERRBIT_BIT                              16
#define CAN2ICR_ERRBIT_BIT                            C2ICR_ERRBIT_BIT
#define C2ICR_ERRDIR_MASK                             0x200000
#define CAN2ICR_ERRDIR_MASK                           C2ICR_ERRDIR_MASK
#define C2ICR_ERRDIR                                  0x200000
#define CAN2ICR_ERRDIR                                C2ICR_ERRDIR
#define C2ICR_ERRDIR_BIT                              21
#define CAN2ICR_ERRDIR_BIT                            C2ICR_ERRDIR_BIT
#define C2ICR_ERRC_MASK                               0xC00000
#define CAN2ICR_ERRC_MASK                             C2ICR_ERRC_MASK
#define C2ICR_ERRC_BIT                                22
#define CAN2ICR_ERRC_BIT                              C2ICR_ERRC_BIT
#define C2ICR_ALCBIT_MASK                             0x1F000000
#define CAN2ICR_ALCBIT_MASK                           C2ICR_ALCBIT_MASK
#define C2ICR_ALCBIT_BIT                              24
#define CAN2ICR_ALCBIT_BIT                            C2ICR_ALCBIT_BIT

#define C2IER                                         ( *( volatile unsigned long * ) 0xE0048010 )
#define CAN2IER                                       C2IER
#define C2IER_OFFSET                                  0x10
#define CAN2IER_OFFSET                                C2IER_OFFSET
#define C2IER_RIE_MASK                                0x1
#define CAN2IER_RIE_MASK                              C2IER_RIE_MASK
#define C2IER_RIE                                     0x1
#define CAN2IER_RIE                                   C2IER_RIE
#define C2IER_RIE_BIT                                 0
#define CAN2IER_RIE_BIT                               C2IER_RIE_BIT
#define C2IER_TIE1_MASK                               0x2
#define CAN2IER_TIE1_MASK                             C2IER_TIE1_MASK
#define C2IER_TIE1                                    0x2
#define CAN2IER_TIE1                                  C2IER_TIE1
#define C2IER_TIE1_BIT                                1
#define CAN2IER_TIE1_BIT                              C2IER_TIE1_BIT
#define C2IER_EIE_MASK                                0x4
#define CAN2IER_EIE_MASK                              C2IER_EIE_MASK
#define C2IER_EIE                                     0x4
#define CAN2IER_EIE                                   C2IER_EIE
#define C2IER_EIE_BIT                                 2
#define CAN2IER_EIE_BIT                               C2IER_EIE_BIT
#define C2IER_DOIE_MASK                               0x8
#define CAN2IER_DOIE_MASK                             C2IER_DOIE_MASK
#define C2IER_DOIE                                    0x8
#define CAN2IER_DOIE                                  C2IER_DOIE
#define C2IER_DOIE_BIT                                3
#define CAN2IER_DOIE_BIT                              C2IER_DOIE_BIT
#define C2IER_WUIE_MASK                               0x10
#define CAN2IER_WUIE_MASK                             C2IER_WUIE_MASK
#define C2IER_WUIE                                    0x10
#define CAN2IER_WUIE                                  C2IER_WUIE
#define C2IER_WUIE_BIT                                4
#define CAN2IER_WUIE_BIT                              C2IER_WUIE_BIT
#define C2IER_EPIE_MASK                               0x20
#define CAN2IER_EPIE_MASK                             C2IER_EPIE_MASK
#define C2IER_EPIE                                    0x20
#define CAN2IER_EPIE                                  C2IER_EPIE
#define C2IER_EPIE_BIT                                5
#define CAN2IER_EPIE_BIT                              C2IER_EPIE_BIT
#define C2IER_ALIE_MASK                               0x40
#define CAN2IER_ALIE_MASK                             C2IER_ALIE_MASK
#define C2IER_ALIE                                    0x40
#define CAN2IER_ALIE                                  C2IER_ALIE
#define C2IER_ALIE_BIT                                6
#define CAN2IER_ALIE_BIT                              C2IER_ALIE_BIT
#define C2IER_BEIE_MASK                               0x80
#define CAN2IER_BEIE_MASK                             C2IER_BEIE_MASK
#define C2IER_BEIE                                    0x80
#define CAN2IER_BEIE                                  C2IER_BEIE
#define C2IER_BEIE_BIT                                7
#define CAN2IER_BEIE_BIT                              C2IER_BEIE_BIT
#define C2IER_IDIE_MASK                               0x100
#define CAN2IER_IDIE_MASK                             C2IER_IDIE_MASK
#define C2IER_IDIE                                    0x100
#define CAN2IER_IDIE                                  C2IER_IDIE
#define C2IER_IDIE_BIT                                8
#define CAN2IER_IDIE_BIT                              C2IER_IDIE_BIT
#define C2IER_TIE2_MASK                               0x200
#define CAN2IER_TIE2_MASK                             C2IER_TIE2_MASK
#define C2IER_TIE2                                    0x200
#define CAN2IER_TIE2                                  C2IER_TIE2
#define C2IER_TIE2_BIT                                9
#define CAN2IER_TIE2_BIT                              C2IER_TIE2_BIT
#define C2IER_TIE3_MASK                               0x400
#define CAN2IER_TIE3_MASK                             C2IER_TIE3_MASK
#define C2IER_TIE3                                    0x400
#define CAN2IER_TIE3                                  C2IER_TIE3
#define C2IER_TIE3_BIT                                10
#define CAN2IER_TIE3_BIT                              C2IER_TIE3_BIT

#define C2BTR                                         ( *( volatile unsigned long * ) 0xE0048014 )
#define CAN2BTR                                       C2BTR
#define C2BTR_OFFSET                                  0x14
#define CAN2BTR_OFFSET                                C2BTR_OFFSET
#define C2BTR_BRP_MASK                                0x3FF
#define CAN2BTR_BRP_MASK                              C2BTR_BRP_MASK
#define C2BTR_BRP_BIT                                 0
#define CAN2BTR_BRP_BIT                               C2BTR_BRP_BIT
#define C2BTR_SJW_MASK                                0xC000
#define CAN2BTR_SJW_MASK                              C2BTR_SJW_MASK
#define C2BTR_SJW_BIT                                 14
#define CAN2BTR_SJW_BIT                               C2BTR_SJW_BIT
#define C2BTR_TSEG1_MASK                              0xF0000
#define CAN2BTR_TSEG1_MASK                            C2BTR_TSEG1_MASK
#define C2BTR_TSEG1_BIT                               16
#define CAN2BTR_TSEG1_BIT                             C2BTR_TSEG1_BIT
#define C2BTR_TSEG2_MASK                              0x700000
#define CAN2BTR_TSEG2_MASK                            C2BTR_TSEG2_MASK
#define C2BTR_TSEG2_BIT                               20
#define CAN2BTR_TSEG2_BIT                             C2BTR_TSEG2_BIT
#define C2BTR_SAM_MASK                                0x800000
#define CAN2BTR_SAM_MASK                              C2BTR_SAM_MASK
#define C2BTR_SAM                                     0x800000
#define CAN2BTR_SAM                                   C2BTR_SAM
#define C2BTR_SAM_BIT                                 23
#define CAN2BTR_SAM_BIT                               C2BTR_SAM_BIT

#define C2EWL                                         ( *( volatile unsigned long * ) 0xE0048018 )
#define CAN2EWL                                       C2EWL
#define C2EWL_OFFSET                                  0x18
#define CAN2EWL_OFFSET                                C2EWL_OFFSET
#define C2EWL_EWL_MASK                                0xFF
#define CAN2EWL_EWL_MASK                              C2EWL_EWL_MASK
#define C2EWL_EWL_BIT                                 0
#define CAN2EWL_EWL_BIT                               C2EWL_EWL_BIT

