FreeRTOS/FreeRTOS/FreeRTOS/Demo/ARM7_LPC2138_Rowley/LPC21xx.h
#define C2SR                                          ( *( volatile unsigned long * ) 0xE004801C )
#define CAN2SR                                        C2SR
#define C2SR_OFFSET                                   0x1C
#define CAN2SR_OFFSET                                 C2SR_OFFSET
#define C2SR_RBS_MASK                                 0x1
#define CAN2SR_RBS_MASK                               C2SR_RBS_MASK
#define C2SR_RBS                                      0x1
#define CAN2SR_RBS                                    C2SR_RBS
#define C2SR_RBS_BIT                                  0
#define CAN2SR_RBS_BIT                                C2SR_RBS_BIT
#define C2SR_DOS_MASK                                 0x2
#define CAN2SR_DOS_MASK                               C2SR_DOS_MASK
#define C2SR_DOS                                      0x2
#define CAN2SR_DOS                                    C2SR_DOS
#define C2SR_DOS_BIT                                  1
#define CAN2SR_DOS_BIT                                C2SR_DOS_BIT
#define C2SR_TBS1_MASK                                0x4
#define CAN2SR_TBS1_MASK                              C2SR_TBS1_MASK
#define C2SR_TBS1                                     0x4
#define CAN2SR_TBS1                                   C2SR_TBS1
#define C2SR_TBS1_BIT                                 2
#define CAN2SR_TBS1_BIT                               C2SR_TBS1_BIT
#define C2SR_TCS1_MASK                                0x8
#define CAN2SR_TCS1_MASK                              C2SR_TCS1_MASK
#define C2SR_TCS1                                     0x8
#define CAN2SR_TCS1                                   C2SR_TCS1
#define C2SR_TCS1_BIT                                 3
#define CAN2SR_TCS1_BIT                               C2SR_TCS1_BIT
#define C2SR_RS_MASK                                  0x10
#define CAN2SR_RS_MASK                                C2SR_RS_MASK
#define C2SR_RS                                       0x10
#define CAN2SR_RS                                     C2SR_RS
#define C2SR_RS_BIT                                   4
#define CAN2SR_RS_BIT                                 C2SR_RS_BIT
#define C2SR_TS1_MASK                                 0x20
#define CAN2SR_TS1_MASK                               C2SR_TS1_MASK
#define C2SR_TS1                                      0x20
#define CAN2SR_TS1                                    C2SR_TS1
#define C2SR_TS1_BIT                                  5
#define CAN2SR_TS1_BIT                                C2SR_TS1_BIT
#define C2SR_ES_MASK                                  0x40
#define CAN2SR_ES_MASK                                C2SR_ES_MASK
#define C2SR_ES                                       0x40
#define CAN2SR_ES                                     C2SR_ES
#define C2SR_ES_BIT                                   6
#define CAN2SR_ES_BIT                                 C2SR_ES_BIT
#define C2SR_BS_MASK                                  0x80
#define CAN2SR_BS_MASK                                C2SR_BS_MASK
#define C2SR_BS                                       0x80
#define CAN2SR_BS                                     C2SR_BS
#define C2SR_BS_BIT                                   7
#define CAN2SR_BS_BIT                                 C2SR_BS_BIT
#define C2SR_RBS2_MASK                                0x100
#define CAN2SR_RBS2_MASK                              C2SR_RBS2_MASK
#define C2SR_RBS2                                     0x100
#define CAN2SR_RBS2                                   C2SR_RBS2
#define C2SR_RBS2_BIT                                 8
#define CAN2SR_RBS2_BIT                               C2SR_RBS2_BIT
#define C2SR_DOS2_MASK                                0x200
#define CAN2SR_DOS2_MASK                              C2SR_DOS2_MASK
#define C2SR_DOS2                                     0x200
#define CAN2SR_DOS2                                   C2SR_DOS2
#define C2SR_DOS2_BIT                                 9
#define CAN2SR_DOS2_BIT                               C2SR_DOS2_BIT
#define C2SR_TBS2_MASK                                0x400
#define CAN2SR_TBS2_MASK                              C2SR_TBS2_MASK
#define C2SR_TBS2                                     0x400
#define CAN2SR_TBS2                                   C2SR_TBS2
#define C2SR_TBS2_BIT                                 10
#define CAN2SR_TBS2_BIT                               C2SR_TBS2_BIT
#define C2SR_TCS2_MASK                                0x800
#define CAN2SR_TCS2_MASK                              C2SR_TCS2_MASK
#define C2SR_TCS2                                     0x800
#define CAN2SR_TCS2                                   C2SR_TCS2
#define C2SR_TCS2_BIT                                 11
#define CAN2SR_TCS2_BIT                               C2SR_TCS2_BIT
#define C2SR_RS2_MASK                                 0x1000
#define CAN2SR_RS2_MASK                               C2SR_RS2_MASK
#define C2SR_RS2                                      0x1000
#define CAN2SR_RS2                                    C2SR_RS2
#define C2SR_RS2_BIT                                  12
#define CAN2SR_RS2_BIT                                C2SR_RS2_BIT
#define C2SR_TS2_MASK                                 0x2000
#define CAN2SR_TS2_MASK                               C2SR_TS2_MASK
#define C2SR_TS2                                      0x2000
#define CAN2SR_TS2                                    C2SR_TS2
#define C2SR_TS2_BIT                                  13
#define CAN2SR_TS2_BIT                                C2SR_TS2_BIT
#define C2SR_ES2_MASK                                 0x4000
#define CAN2SR_ES2_MASK                               C2SR_ES2_MASK
#define C2SR_ES2                                      0x4000
#define CAN2SR_ES2                                    C2SR_ES2
#define C2SR_ES2_BIT                                  14
#define CAN2SR_ES2_BIT                                C2SR_ES2_BIT
#define C2SR_BS2_MASK                                 0x8000
#define CAN2SR_BS2_MASK                               C2SR_BS2_MASK
#define C2SR_BS2                                      0x8000
#define CAN2SR_BS2                                    C2SR_BS2
#define C2SR_BS2_BIT                                  15
#define CAN2SR_BS2_BIT                                C2SR_BS2_BIT
#define C2SR_RBS3_MASK                                0x10000
#define CAN2SR_RBS3_MASK                              C2SR_RBS3_MASK
#define C2SR_RBS3                                     0x10000
#define CAN2SR_RBS3                                   C2SR_RBS3
#define C2SR_RBS3_BIT                                 16
#define CAN2SR_RBS3_BIT                               C2SR_RBS3_BIT
#define C2SR_DOS3_MASK                                0x20000
#define CAN2SR_DOS3_MASK                              C2SR_DOS3_MASK
#define C2SR_DOS3                                     0x20000
#define CAN2SR_DOS3                                   C2SR_DOS3
#define C2SR_DOS3_BIT                                 17
#define CAN2SR_DOS3_BIT                               C2SR_DOS3_BIT
#define C2SR_TBS3_MASK                                0x40000
#define CAN2SR_TBS3_MASK                              C2SR_TBS3_MASK
#define C2SR_TBS3                                     0x40000
#define CAN2SR_TBS3                                   C2SR_TBS3
#define C2SR_TBS3_BIT                                 18
#define CAN2SR_TBS3_BIT                               C2SR_TBS3_BIT
#define C2SR_TCS3_MASK                                0x80000
#define CAN2SR_TCS3_MASK                              C2SR_TCS3_MASK
#define C2SR_TCS3                                     0x80000
#define CAN2SR_TCS3                                   C2SR_TCS3
#define C2SR_TCS3_BIT                                 19
#define CAN2SR_TCS3_BIT                               C2SR_TCS3_BIT
#define C2SR_RS3_MASK                                 0x100000
#define CAN2SR_RS3_MASK                               C2SR_RS3_MASK
#define C2SR_RS3                                      0x100000
#define CAN2SR_RS3                                    C2SR_RS3
#define C2SR_RS3_BIT                                  20
#define CAN2SR_RS3_BIT                                C2SR_RS3_BIT
#define C2SR_TS3_MASK                                 0x200000
#define CAN2SR_TS3_MASK                               C2SR_TS3_MASK
#define C2SR_TS3                                      0x200000
#define CAN2SR_TS3                                    C2SR_TS3
#define C2SR_TS3_BIT                                  21
#define CAN2SR_TS3_BIT                                C2SR_TS3_BIT
#define C2SR_ES3_MASK                                 0x400000
#define CAN2SR_ES3_MASK                               C2SR_ES3_MASK
#define C2SR_ES3                                      0x400000
#define CAN2SR_ES3                                    C2SR_ES3
#define C2SR_ES3_BIT                                  22
#define CAN2SR_ES3_BIT                                C2SR_ES3_BIT
#define C2SR_BS3_MASK                                 0x800000
#define CAN2SR_BS3_MASK                               C2SR_BS3_MASK
#define C2SR_BS3                                      0x800000
#define CAN2SR_BS3                                    C2SR_BS3
#define C2SR_BS3_BIT                                  23
#define CAN2SR_BS3_BIT                                C2SR_BS3_BIT

#define C2RFS                                         ( *( volatile unsigned long * ) 0xE0048020 )
#define CAN2RFS                                       C2RFS
#define C2RFS_OFFSET                                  0x20
#define CAN2RFS_OFFSET                                C2RFS_OFFSET
#define C2RFS_ID_Index_MASK                           0x3FF
#define CAN2RFS_ID_Index_MASK                         C2RFS_ID_Index_MASK
#define C2RFS_ID_Index_BIT                            0
#define CAN2RFS_ID_Index_BIT                          C2RFS_ID_Index_BIT
#define C2RFS_BP_MASK                                 0x400
#define CAN2RFS_BP_MASK                               C2RFS_BP_MASK
#define C2RFS_BP                                      0x400
#define CAN2RFS_BP                                    C2RFS_BP
#define C2RFS_BP_BIT                                  10
#define CAN2RFS_BP_BIT                                C2RFS_BP_BIT
#define C2RFS_DLC_MASK                                0xF0000
#define CAN2RFS_DLC_MASK                              C2RFS_DLC_MASK
#define C2RFS_DLC_BIT                                 16
#define CAN2RFS_DLC_BIT                               C2RFS_DLC_BIT
#define C2RFS_RTR_MASK                                0x40000000
#define CAN2RFS_RTR_MASK                              C2RFS_RTR_MASK
#define C2RFS_RTR                                     0x40000000
#define CAN2RFS_RTR                                   C2RFS_RTR
#define C2RFS_RTR_BIT                                 30
#define CAN2RFS_RTR_BIT                               C2RFS_RTR_BIT
#define C2RFS_FF_MASK                                 0x80000000
#define CAN2RFS_FF_MASK                               C2RFS_FF_MASK
#define C2RFS_FF                                      0x80000000
#define CAN2RFS_FF                                    C2RFS_FF
#define C2RFS_FF_BIT                                  31
#define CAN2RFS_FF_BIT                                C2RFS_FF_BIT

