FreeRTOS/FreeRTOS/FreeRTOS/Demo/ARM7_LPC2138_Rowley/LPC21xx.h
#define C2RID                                         ( *( volatile unsigned long * ) 0xE0048024 )
#define CAN2RID                                       C2RID
#define C2RID_OFFSET                                  0x24
#define CAN2RID_OFFSET                                C2RID_OFFSET
#define C2RID_ID_MASK                                 0x7FF
#define CAN2RID_ID_MASK                               C2RID_ID_MASK
#define C2RID_ID_BIT                                  0
#define CAN2RID_ID_BIT                                C2RID_ID_BIT

#define C2RDA                                         ( *( volatile unsigned long * ) 0xE0048028 )
#define CAN2RDA                                       C2RDA
#define C2RDA_OFFSET                                  0x28
#define CAN2RDA_OFFSET                                C2RDA_OFFSET
#define C2RDA_Data_1_MASK                             0xFF
#define CAN2RDA_Data_1_MASK                           C2RDA_Data_1_MASK
#define C2RDA_Data_1_BIT                              0
#define CAN2RDA_Data_1_BIT                            C2RDA_Data_1_BIT
#define C2RDA_Data_2_MASK                             0xFF00
#define CAN2RDA_Data_2_MASK                           C2RDA_Data_2_MASK
#define C2RDA_Data_2_BIT                              8
#define CAN2RDA_Data_2_BIT                            C2RDA_Data_2_BIT
#define C2RDA_Data_3_MASK                             0xFF0000
#define CAN2RDA_Data_3_MASK                           C2RDA_Data_3_MASK
#define C2RDA_Data_3_BIT                              16
#define CAN2RDA_Data_3_BIT                            C2RDA_Data_3_BIT
#define C2RDA_Data_4_MASK                             0xFF000000
#define CAN2RDA_Data_4_MASK                           C2RDA_Data_4_MASK
#define C2RDA_Data_4_BIT                              24
#define CAN2RDA_Data_4_BIT                            C2RDA_Data_4_BIT

#define C2RDB                                         ( *( volatile unsigned long * ) 0xE004802C )
#define CAN2RDB                                       C2RDB
#define C2RDB_OFFSET                                  0x2C
#define CAN2RDB_OFFSET                                C2RDB_OFFSET
#define C2RDB_Data_5_MASK                             0xFF
#define CAN2RDB_Data_5_MASK                           C2RDB_Data_5_MASK
#define C2RDB_Data_5_BIT                              0
#define CAN2RDB_Data_5_BIT                            C2RDB_Data_5_BIT
#define C2RDB_Data_6_MASK                             0xFF00
#define CAN2RDB_Data_6_MASK                           C2RDB_Data_6_MASK
#define C2RDB_Data_6_BIT                              8
#define CAN2RDB_Data_6_BIT                            C2RDB_Data_6_BIT
#define C2RDB_Data_7_MASK                             0xFF0000
#define CAN2RDB_Data_7_MASK                           C2RDB_Data_7_MASK
#define C2RDB_Data_7_BIT                              16
#define CAN2RDB_Data_7_BIT                            C2RDB_Data_7_BIT
#define C2RDB_Data_8_MASK                             0xFF000000
#define CAN2RDB_Data_8_MASK                           C2RDB_Data_8_MASK
#define C2RDB_Data_8_BIT                              24
#define CAN2RDB_Data_8_BIT                            C2RDB_Data_8_BIT

#define C2TFI1                                        ( *( volatile unsigned long * ) 0xE0048030 )
#define CAN2TFI1                                      C2TFI1
#define C2TFI1_OFFSET                                 0x30
#define CAN2TFI1_OFFSET                               C2TFI1_OFFSET
#define C2TFI1_PRIO_MASK                              0xFF
#define CAN2TFI1_PRIO_MASK                            C2TFI1_PRIO_MASK
#define C2TFI1_PRIO_BIT                               0
#define CAN2TFI1_PRIO_BIT                             C2TFI1_PRIO_BIT
#define C2TFI1_DLC_MASK                               0xF0000
#define CAN2TFI1_DLC_MASK                             C2TFI1_DLC_MASK
#define C2TFI1_DLC_BIT                                16
#define CAN2TFI1_DLC_BIT                              C2TFI1_DLC_BIT
#define C2TFI1_RTR_MASK                               0x40000000
#define CAN2TFI1_RTR_MASK                             C2TFI1_RTR_MASK
#define C2TFI1_RTR                                    0x40000000
#define CAN2TFI1_RTR                                  C2TFI1_RTR
#define C2TFI1_RTR_BIT                                30
#define CAN2TFI1_RTR_BIT                              C2TFI1_RTR_BIT
#define C2TFI1_FF_MASK                                0x80000000
#define CAN2TFI1_FF_MASK                              C2TFI1_FF_MASK
#define C2TFI1_FF                                     0x80000000
#define CAN2TFI1_FF                                   C2TFI1_FF
#define C2TFI1_FF_BIT                                 31
#define CAN2TFI1_FF_BIT                               C2TFI1_FF_BIT

#define C2TID1                                        ( *( volatile unsigned long * ) 0xE0048034 )
#define CAN2TID1                                      C2TID1
#define C2TID1_OFFSET                                 0x34
#define CAN2TID1_OFFSET                               C2TID1_OFFSET
#define C2TID1_ID_MASK                                0x7FF
#define CAN2TID1_ID_MASK                              C2TID1_ID_MASK
#define C2TID1_ID_BIT                                 0
#define CAN2TID1_ID_BIT                               C2TID1_ID_BIT

#define C2TDA1                                        ( *( volatile unsigned long * ) 0xE0048038 )
#define CAN2TDA1                                      C2TDA1
#define C2TDA1_OFFSET                                 0x38
#define CAN2TDA1_OFFSET                               C2TDA1_OFFSET
#define C2TDA1_Data_1_MASK                            0xFF
#define CAN2TDA1_Data_1_MASK                          C2TDA1_Data_1_MASK
#define C2TDA1_Data_1_BIT                             0
#define CAN2TDA1_Data_1_BIT                           C2TDA1_Data_1_BIT
#define C2TDA1_Data_2_MASK                            0xFF00
#define CAN2TDA1_Data_2_MASK                          C2TDA1_Data_2_MASK
#define C2TDA1_Data_2_BIT                             8
#define CAN2TDA1_Data_2_BIT                           C2TDA1_Data_2_BIT
#define C2TDA1_Data_3_MASK                            0xFF0000
#define CAN2TDA1_Data_3_MASK                          C2TDA1_Data_3_MASK
#define C2TDA1_Data_3_BIT                             16
#define CAN2TDA1_Data_3_BIT                           C2TDA1_Data_3_BIT
#define C2TDA1_Data_4_MASK                            0xFF000000
#define CAN2TDA1_Data_4_MASK                          C2TDA1_Data_4_MASK
#define C2TDA1_Data_4_BIT                             24
#define CAN2TDA1_Data_4_BIT                           C2TDA1_Data_4_BIT

