FreeRTOS/FreeRTOS/FreeRTOS/Demo/ARM7_LPC2138_Rowley/LPC21xx.h
#define C2TDB1                                        ( *( volatile unsigned long * ) 0xE004803C )
#define CAN2TDB1                                      C2TDB1
#define C2TDB1_OFFSET                                 0x3C
#define CAN2TDB1_OFFSET                               C2TDB1_OFFSET
#define C2TDB1_Data_5_MASK                            0xFF
#define CAN2TDB1_Data_5_MASK                          C2TDB1_Data_5_MASK
#define C2TDB1_Data_5_BIT                             0
#define CAN2TDB1_Data_5_BIT                           C2TDB1_Data_5_BIT
#define C2TDB1_Data_6_MASK                            0xFF00
#define CAN2TDB1_Data_6_MASK                          C2TDB1_Data_6_MASK
#define C2TDB1_Data_6_BIT                             8
#define CAN2TDB1_Data_6_BIT                           C2TDB1_Data_6_BIT
#define C2TDB1_Data_7_MASK                            0xFF0000
#define CAN2TDB1_Data_7_MASK                          C2TDB1_Data_7_MASK
#define C2TDB1_Data_7_BIT                             16
#define CAN2TDB1_Data_7_BIT                           C2TDB1_Data_7_BIT
#define C2TDB1_Data_8_MASK                            0xFF000000
#define CAN2TDB1_Data_8_MASK                          C2TDB1_Data_8_MASK
#define C2TDB1_Data_8_BIT                             24
#define CAN2TDB1_Data_8_BIT                           C2TDB1_Data_8_BIT

#define C2TFI2                                        ( *( volatile unsigned long * ) 0xE0048040 )
#define CAN2TFI2                                      C2TFI2
#define C2TFI2_OFFSET                                 0x40
#define CAN2TFI2_OFFSET                               C2TFI2_OFFSET
#define C2TFI2_PRIO_MASK                              0xFF
#define CAN2TFI2_PRIO_MASK                            C2TFI2_PRIO_MASK
#define C2TFI2_PRIO_BIT                               0
#define CAN2TFI2_PRIO_BIT                             C2TFI2_PRIO_BIT
#define C2TFI2_DLC_MASK                               0xF0000
#define CAN2TFI2_DLC_MASK                             C2TFI2_DLC_MASK
#define C2TFI2_DLC_BIT                                16
#define CAN2TFI2_DLC_BIT                              C2TFI2_DLC_BIT
#define C2TFI2_RTR_MASK                               0x40000000
#define CAN2TFI2_RTR_MASK                             C2TFI2_RTR_MASK
#define C2TFI2_RTR                                    0x40000000
#define CAN2TFI2_RTR                                  C2TFI2_RTR
#define C2TFI2_RTR_BIT                                30
#define CAN2TFI2_RTR_BIT                              C2TFI2_RTR_BIT
#define C2TFI2_FF_MASK                                0x80000000
#define CAN2TFI2_FF_MASK                              C2TFI2_FF_MASK
#define C2TFI2_FF                                     0x80000000
#define CAN2TFI2_FF                                   C2TFI2_FF
#define C2TFI2_FF_BIT                                 31
#define CAN2TFI2_FF_BIT                               C2TFI2_FF_BIT

#define C2TID2                                        ( *( volatile unsigned long * ) 0xE0048044 )
#define CAN2TID2                                      C2TID2
#define C2TID2_OFFSET                                 0x44
#define CAN2TID2_OFFSET                               C2TID2_OFFSET
#define C2TID2_ID_MASK                                0x7FF
#define CAN2TID2_ID_MASK                              C2TID2_ID_MASK
#define C2TID2_ID_BIT                                 0
#define CAN2TID2_ID_BIT                               C2TID2_ID_BIT

#define C2TDA2                                        ( *( volatile unsigned long * ) 0xE0048048 )
#define CAN2TDA2                                      C2TDA2
#define C2TDA2_OFFSET                                 0x48
#define CAN2TDA2_OFFSET                               C2TDA2_OFFSET
#define C2TDA2_Data_1_MASK                            0xFF
#define CAN2TDA2_Data_1_MASK                          C2TDA2_Data_1_MASK
#define C2TDA2_Data_1_BIT                             0
#define CAN2TDA2_Data_1_BIT                           C2TDA2_Data_1_BIT
#define C2TDA2_Data_2_MASK                            0xFF00
#define CAN2TDA2_Data_2_MASK                          C2TDA2_Data_2_MASK
#define C2TDA2_Data_2_BIT                             8
#define CAN2TDA2_Data_2_BIT                           C2TDA2_Data_2_BIT
#define C2TDA2_Data_3_MASK                            0xFF0000
#define CAN2TDA2_Data_3_MASK                          C2TDA2_Data_3_MASK
#define C2TDA2_Data_3_BIT                             16
#define CAN2TDA2_Data_3_BIT                           C2TDA2_Data_3_BIT
#define C2TDA2_Data_4_MASK                            0xFF000000
#define CAN2TDA2_Data_4_MASK                          C2TDA2_Data_4_MASK
#define C2TDA2_Data_4_BIT                             24
#define CAN2TDA2_Data_4_BIT                           C2TDA2_Data_4_BIT

#define C2TDB2                                        ( *( volatile unsigned long * ) 0xE004804C )
#define CAN2TDB2                                      C2TDB2
#define C2TDB2_OFFSET                                 0x4C
#define CAN2TDB2_OFFSET                               C2TDB2_OFFSET
#define C2TDB2_Data_5_MASK                            0xFF
#define CAN2TDB2_Data_5_MASK                          C2TDB2_Data_5_MASK
#define C2TDB2_Data_5_BIT                             0
#define CAN2TDB2_Data_5_BIT                           C2TDB2_Data_5_BIT
#define C2TDB2_Data_6_MASK                            0xFF00
#define CAN2TDB2_Data_6_MASK                          C2TDB2_Data_6_MASK
#define C2TDB2_Data_6_BIT                             8
#define CAN2TDB2_Data_6_BIT                           C2TDB2_Data_6_BIT
#define C2TDB2_Data_7_MASK                            0xFF0000
#define CAN2TDB2_Data_7_MASK                          C2TDB2_Data_7_MASK
#define C2TDB2_Data_7_BIT                             16
#define CAN2TDB2_Data_7_BIT                           C2TDB2_Data_7_BIT
#define C2TDB2_Data_8_MASK                            0xFF000000
#define CAN2TDB2_Data_8_MASK                          C2TDB2_Data_8_MASK
#define C2TDB2_Data_8_BIT                             24
#define CAN2TDB2_Data_8_BIT                           C2TDB2_Data_8_BIT

#define C2TFI3                                        ( *( volatile unsigned long * ) 0xE0048050 )
#define CAN2TFI3                                      C2TFI3
#define C2TFI3_OFFSET                                 0x50
#define CAN2TFI3_OFFSET                               C2TFI3_OFFSET
#define C2TFI3_PRIO_MASK                              0xFF
#define CAN2TFI3_PRIO_MASK                            C2TFI3_PRIO_MASK
#define C2TFI3_PRIO_BIT                               0
#define CAN2TFI3_PRIO_BIT                             C2TFI3_PRIO_BIT
#define C2TFI3_DLC_MASK                               0xF0000
#define CAN2TFI3_DLC_MASK                             C2TFI3_DLC_MASK
#define C2TFI3_DLC_BIT                                16
#define CAN2TFI3_DLC_BIT                              C2TFI3_DLC_BIT
#define C2TFI3_RTR_MASK                               0x40000000
#define CAN2TFI3_RTR_MASK                             C2TFI3_RTR_MASK
#define C2TFI3_RTR                                    0x40000000
#define CAN2TFI3_RTR                                  C2TFI3_RTR
#define C2TFI3_RTR_BIT                                30
#define CAN2TFI3_RTR_BIT                              C2TFI3_RTR_BIT
#define C2TFI3_FF_MASK                                0x80000000
#define CAN2TFI3_FF_MASK                              C2TFI3_FF_MASK
#define C2TFI3_FF                                     0x80000000
#define CAN2TFI3_FF                                   C2TFI3_FF
#define C2TFI3_FF_BIT                                 31
#define CAN2TFI3_FF_BIT                               C2TFI3_FF_BIT

#define C2TID3                                        ( *( volatile unsigned long * ) 0xE0048054 )
#define CAN2TID3                                      C2TID3
#define C2TID3_OFFSET                                 0x54
#define CAN2TID3_OFFSET                               C2TID3_OFFSET
#define C2TID3_ID_MASK                                0x7FF
#define CAN2TID3_ID_MASK                              C2TID3_ID_MASK
#define C2TID3_ID_BIT                                 0
#define CAN2TID3_ID_BIT                               C2TID3_ID_BIT

