FreeRTOS/FreeRTOS/FreeRTOS/Demo/ARM7_LPC2138_Rowley/LPC21xx.h
#define C2TDA3                                        ( *( volatile unsigned long * ) 0xE0048058 )
#define CAN2TDA3                                      C2TDA3
#define C2TDA3_OFFSET                                 0x58
#define CAN2TDA3_OFFSET                               C2TDA3_OFFSET
#define C2TDA3_Data_1_MASK                            0xFF
#define CAN2TDA3_Data_1_MASK                          C2TDA3_Data_1_MASK
#define C2TDA3_Data_1_BIT                             0
#define CAN2TDA3_Data_1_BIT                           C2TDA3_Data_1_BIT
#define C2TDA3_Data_2_MASK                            0xFF00
#define CAN2TDA3_Data_2_MASK                          C2TDA3_Data_2_MASK
#define C2TDA3_Data_2_BIT                             8
#define CAN2TDA3_Data_2_BIT                           C2TDA3_Data_2_BIT
#define C2TDA3_Data_3_MASK                            0xFF0000
#define CAN2TDA3_Data_3_MASK                          C2TDA3_Data_3_MASK
#define C2TDA3_Data_3_BIT                             16
#define CAN2TDA3_Data_3_BIT                           C2TDA3_Data_3_BIT
#define C2TDA3_Data_4_MASK                            0xFF000000
#define CAN2TDA3_Data_4_MASK                          C2TDA3_Data_4_MASK
#define C2TDA3_Data_4_BIT                             24
#define CAN2TDA3_Data_4_BIT                           C2TDA3_Data_4_BIT

#define C2TDB3                                        ( *( volatile unsigned long * ) 0xE004805C )
#define CAN2TDB3                                      C2TDB3
#define C2TDB3_OFFSET                                 0x5C
#define CAN2TDB3_OFFSET                               C2TDB3_OFFSET
#define C2TDB3_Data_5_MASK                            0xFF
#define CAN2TDB3_Data_5_MASK                          C2TDB3_Data_5_MASK
#define C2TDB3_Data_5_BIT                             0
#define CAN2TDB3_Data_5_BIT                           C2TDB3_Data_5_BIT
#define C2TDB3_Data_6_MASK                            0xFF00
#define CAN2TDB3_Data_6_MASK                          C2TDB3_Data_6_MASK
#define C2TDB3_Data_6_BIT                             8
#define CAN2TDB3_Data_6_BIT                           C2TDB3_Data_6_BIT
#define C2TDB3_Data_7_MASK                            0xFF0000
#define CAN2TDB3_Data_7_MASK                          C2TDB3_Data_7_MASK
#define C2TDB3_Data_7_BIT                             16
#define CAN2TDB3_Data_7_BIT                           C2TDB3_Data_7_BIT
#define C2TDB3_Data_8_MASK                            0xFF000000
#define CAN2TDB3_Data_8_MASK                          C2TDB3_Data_8_MASK
#define C2TDB3_Data_8_BIT                             24
#define CAN2TDB3_Data_8_BIT                           C2TDB3_Data_8_BIT

#define CAN3_BASE                                     0xE004C000

#define C3MOD                                         ( *( volatile unsigned long * ) 0xE004C000 )
#define CAN3MOD                                       C3MOD
#define C3MOD_OFFSET                                  0x0
#define CAN3MOD_OFFSET                                C3MOD_OFFSET
#define C3MOD_RM_MASK                                 0x1
#define CAN3MOD_RM_MASK                               C3MOD_RM_MASK
#define C3MOD_RM                                      0x1
#define CAN3MOD_RM                                    C3MOD_RM
#define C3MOD_RM_BIT                                  0
#define CAN3MOD_RM_BIT                                C3MOD_RM_BIT
#define C3MOD_LOM_MASK                                0x2
#define CAN3MOD_LOM_MASK                              C3MOD_LOM_MASK
#define C3MOD_LOM                                     0x2
#define CAN3MOD_LOM                                   C3MOD_LOM
#define C3MOD_LOM_BIT                                 1
#define CAN3MOD_LOM_BIT                               C3MOD_LOM_BIT
#define C3MOD_STM_MASK                                0x4
#define CAN3MOD_STM_MASK                              C3MOD_STM_MASK
#define C3MOD_STM                                     0x4
#define CAN3MOD_STM                                   C3MOD_STM
#define C3MOD_STM_BIT                                 2
#define CAN3MOD_STM_BIT                               C3MOD_STM_BIT
#define C3MOD_TPM_MASK                                0x8
#define CAN3MOD_TPM_MASK                              C3MOD_TPM_MASK
#define C3MOD_TPM                                     0x8
#define CAN3MOD_TPM                                   C3MOD_TPM
#define C3MOD_TPM_BIT                                 3
#define CAN3MOD_TPM_BIT                               C3MOD_TPM_BIT
#define C3MOD_SM_MASK                                 0x10
#define CAN3MOD_SM_MASK                               C3MOD_SM_MASK
#define C3MOD_SM                                      0x10
#define CAN3MOD_SM                                    C3MOD_SM
#define C3MOD_SM_BIT                                  4
#define CAN3MOD_SM_BIT                                C3MOD_SM_BIT
#define C3MOD_RPM_MASK                                0x20
#define CAN3MOD_RPM_MASK                              C3MOD_RPM_MASK
#define C3MOD_RPM                                     0x20
#define CAN3MOD_RPM                                   C3MOD_RPM
#define C3MOD_RPM_BIT                                 5
#define CAN3MOD_RPM_BIT                               C3MOD_RPM_BIT
#define C3MOD_TM_MASK                                 0x80
#define CAN3MOD_TM_MASK                               C3MOD_TM_MASK
#define C3MOD_TM                                      0x80
#define CAN3MOD_TM                                    C3MOD_TM
#define C3MOD_TM_BIT                                  7
#define CAN3MOD_TM_BIT                                C3MOD_TM_BIT

#define C3CMR                                         ( *( volatile unsigned long * ) 0xE004C004 )
#define CAN3CMR                                       C3CMR
#define C3CMR_OFFSET                                  0x4
#define CAN3CMR_OFFSET                                C3CMR_OFFSET
#define C3CMR_TR_MASK                                 0x1
#define CAN3CMR_TR_MASK                               C3CMR_TR_MASK
#define C3CMR_TR                                      0x1
#define CAN3CMR_TR                                    C3CMR_TR
#define C3CMR_TR_BIT                                  0
#define CAN3CMR_TR_BIT                                C3CMR_TR_BIT
#define C3CMR_AT_MASK                                 0x2
#define CAN3CMR_AT_MASK                               C3CMR_AT_MASK
#define C3CMR_AT                                      0x2
#define CAN3CMR_AT                                    C3CMR_AT
#define C3CMR_AT_BIT                                  1
#define CAN3CMR_AT_BIT                                C3CMR_AT_BIT
#define C3CMR_RRB_MASK                                0x4
#define CAN3CMR_RRB_MASK                              C3CMR_RRB_MASK
#define C3CMR_RRB                                     0x4
#define CAN3CMR_RRB                                   C3CMR_RRB
#define C3CMR_RRB_BIT                                 2
#define CAN3CMR_RRB_BIT                               C3CMR_RRB_BIT
#define C3CMR_CDO_MASK                                0x8
#define CAN3CMR_CDO_MASK                              C3CMR_CDO_MASK
#define C3CMR_CDO                                     0x8
#define CAN3CMR_CDO                                   C3CMR_CDO
#define C3CMR_CDO_BIT                                 3
#define CAN3CMR_CDO_BIT                               C3CMR_CDO_BIT
#define C3CMR_SRR_MASK                                0x10
#define CAN3CMR_SRR_MASK                              C3CMR_SRR_MASK
#define C3CMR_SRR                                     0x10
#define CAN3CMR_SRR                                   C3CMR_SRR
#define C3CMR_SRR_BIT                                 4
#define CAN3CMR_SRR_BIT                               C3CMR_SRR_BIT
#define C3CMR_STB1_MASK                               0x20
#define CAN3CMR_STB1_MASK                             C3CMR_STB1_MASK
#define C3CMR_STB1                                    0x20
#define CAN3CMR_STB1                                  C3CMR_STB1
#define C3CMR_STB1_BIT                                5
#define CAN3CMR_STB1_BIT                              C3CMR_STB1_BIT
#define C3CMR_STB2_MASK                               0x40
#define CAN3CMR_STB2_MASK                             C3CMR_STB2_MASK
#define C3CMR_STB2                                    0x40
#define CAN3CMR_STB2                                  C3CMR_STB2
#define C3CMR_STB2_BIT                                6
#define CAN3CMR_STB2_BIT                              C3CMR_STB2_BIT
#define C3CMR_STB3_MASK                               0x80
#define CAN3CMR_STB3_MASK                             C3CMR_STB3_MASK
#define C3CMR_STB3                                    0x80
#define CAN3CMR_STB3                                  C3CMR_STB3
#define C3CMR_STB3_BIT                                7
#define CAN3CMR_STB3_BIT                              C3CMR_STB3_BIT

