FreeRTOS/FreeRTOS/FreeRTOS/Demo/ARM7_LPC2138_Rowley/LPC21xx.h
#define C3GSR                                         ( *( volatile unsigned long * ) 0xE004C008 )
#define CAN3GSR                                       C3GSR
#define C3GSR_OFFSET                                  0x8
#define CAN3GSR_OFFSET                                C3GSR_OFFSET
#define C3GSR_RBS_MASK                                0x1
#define CAN3GSR_RBS_MASK                              C3GSR_RBS_MASK
#define C3GSR_RBS                                     0x1
#define CAN3GSR_RBS                                   C3GSR_RBS
#define C3GSR_RBS_BIT                                 0
#define CAN3GSR_RBS_BIT                               C3GSR_RBS_BIT
#define C3GSR_DOS_MASK                                0x2
#define CAN3GSR_DOS_MASK                              C3GSR_DOS_MASK
#define C3GSR_DOS                                     0x2
#define CAN3GSR_DOS                                   C3GSR_DOS
#define C3GSR_DOS_BIT                                 1
#define CAN3GSR_DOS_BIT                               C3GSR_DOS_BIT
#define C3GSR_TBS_MASK                                0x4
#define CAN3GSR_TBS_MASK                              C3GSR_TBS_MASK
#define C3GSR_TBS                                     0x4
#define CAN3GSR_TBS                                   C3GSR_TBS
#define C3GSR_TBS_BIT                                 2
#define CAN3GSR_TBS_BIT                               C3GSR_TBS_BIT
#define C3GSR_TCS_MASK                                0x8
#define CAN3GSR_TCS_MASK                              C3GSR_TCS_MASK
#define C3GSR_TCS                                     0x8
#define CAN3GSR_TCS                                   C3GSR_TCS
#define C3GSR_TCS_BIT                                 3
#define CAN3GSR_TCS_BIT                               C3GSR_TCS_BIT
#define C3GSR_RS_MASK                                 0x10
#define CAN3GSR_RS_MASK                               C3GSR_RS_MASK
#define C3GSR_RS                                      0x10
#define CAN3GSR_RS                                    C3GSR_RS
#define C3GSR_RS_BIT                                  4
#define CAN3GSR_RS_BIT                                C3GSR_RS_BIT
#define C3GSR_TS_MASK                                 0x20
#define CAN3GSR_TS_MASK                               C3GSR_TS_MASK
#define C3GSR_TS                                      0x20
#define CAN3GSR_TS                                    C3GSR_TS
#define C3GSR_TS_BIT                                  5
#define CAN3GSR_TS_BIT                                C3GSR_TS_BIT
#define C3GSR_ES_MASK                                 0x40
#define CAN3GSR_ES_MASK                               C3GSR_ES_MASK
#define C3GSR_ES                                      0x40
#define CAN3GSR_ES                                    C3GSR_ES
#define C3GSR_ES_BIT                                  6
#define CAN3GSR_ES_BIT                                C3GSR_ES_BIT
#define C3GSR_BS_MASK                                 0x80
#define CAN3GSR_BS_MASK                               C3GSR_BS_MASK
#define C3GSR_BS                                      0x80
#define CAN3GSR_BS                                    C3GSR_BS
#define C3GSR_BS_BIT                                  7
#define CAN3GSR_BS_BIT                                C3GSR_BS_BIT
#define C3GSR_RXERR_MASK                              0xFF0000
#define CAN3GSR_RXERR_MASK                            C3GSR_RXERR_MASK
#define C3GSR_RXERR_BIT                               16
#define CAN3GSR_RXERR_BIT                             C3GSR_RXERR_BIT
#define C3GSR_TXERR_MASK                              0xFF000000
#define CAN3GSR_TXERR_MASK                            C3GSR_TXERR_MASK
#define C3GSR_TXERR_BIT                               24
#define CAN3GSR_TXERR_BIT                             C3GSR_TXERR_BIT

#define C3ICR                                         ( *( volatile unsigned long * ) 0xE004C00C )
#define CAN3ICR                                       C3ICR
#define C3ICR_OFFSET                                  0xC
#define CAN3ICR_OFFSET                                C3ICR_OFFSET
#define C3ICR_RI_MASK                                 0x1
#define CAN3ICR_RI_MASK                               C3ICR_RI_MASK
#define C3ICR_RI                                      0x1
#define CAN3ICR_RI                                    C3ICR_RI
#define C3ICR_RI_BIT                                  0
#define CAN3ICR_RI_BIT                                C3ICR_RI_BIT
#define C3ICR_TI1_MASK                                0x2
#define CAN3ICR_TI1_MASK                              C3ICR_TI1_MASK
#define C3ICR_TI1                                     0x2
#define CAN3ICR_TI1                                   C3ICR_TI1
#define C3ICR_TI1_BIT                                 1
#define CAN3ICR_TI1_BIT                               C3ICR_TI1_BIT
#define C3ICR_EI_MASK                                 0x4
#define CAN3ICR_EI_MASK                               C3ICR_EI_MASK
#define C3ICR_EI                                      0x4
#define CAN3ICR_EI                                    C3ICR_EI
#define C3ICR_EI_BIT                                  2
#define CAN3ICR_EI_BIT                                C3ICR_EI_BIT
#define C3ICR_DOI_MASK                                0x8
#define CAN3ICR_DOI_MASK                              C3ICR_DOI_MASK
#define C3ICR_DOI                                     0x8
#define CAN3ICR_DOI                                   C3ICR_DOI
#define C3ICR_DOI_BIT                                 3
#define CAN3ICR_DOI_BIT                               C3ICR_DOI_BIT
#define C3ICR_WUI_MASK                                0x10
#define CAN3ICR_WUI_MASK                              C3ICR_WUI_MASK
#define C3ICR_WUI                                     0x10
#define CAN3ICR_WUI                                   C3ICR_WUI
#define C3ICR_WUI_BIT                                 4
#define CAN3ICR_WUI_BIT                               C3ICR_WUI_BIT
#define C3ICR_EPI_MASK                                0x20
#define CAN3ICR_EPI_MASK                              C3ICR_EPI_MASK
#define C3ICR_EPI                                     0x20
#define CAN3ICR_EPI                                   C3ICR_EPI
#define C3ICR_EPI_BIT                                 5
#define CAN3ICR_EPI_BIT                               C3ICR_EPI_BIT
#define C3ICR_ALI_MASK                                0x40
#define CAN3ICR_ALI_MASK                              C3ICR_ALI_MASK
#define C3ICR_ALI                                     0x40
#define CAN3ICR_ALI                                   C3ICR_ALI
#define C3ICR_ALI_BIT                                 6
#define CAN3ICR_ALI_BIT                               C3ICR_ALI_BIT
#define C3ICR_BEI_MASK                                0x80
#define CAN3ICR_BEI_MASK                              C3ICR_BEI_MASK
#define C3ICR_BEI                                     0x80
#define CAN3ICR_BEI                                   C3ICR_BEI
#define C3ICR_BEI_BIT                                 7
#define CAN3ICR_BEI_BIT                               C3ICR_BEI_BIT
#define C3ICR_IDI_MASK                                0x100
#define CAN3ICR_IDI_MASK                              C3ICR_IDI_MASK
#define C3ICR_IDI                                     0x100
#define CAN3ICR_IDI                                   C3ICR_IDI
#define C3ICR_IDI_BIT                                 8
#define CAN3ICR_IDI_BIT                               C3ICR_IDI_BIT
#define C3ICR_TI2_MASK                                0x200
#define CAN3ICR_TI2_MASK                              C3ICR_TI2_MASK
#define C3ICR_TI2                                     0x200
#define CAN3ICR_TI2                                   C3ICR_TI2
#define C3ICR_TI2_BIT                                 9
#define CAN3ICR_TI2_BIT                               C3ICR_TI2_BIT
#define C3ICR_TI3_MASK                                0x400
#define CAN3ICR_TI3_MASK                              C3ICR_TI3_MASK
#define C3ICR_TI3                                     0x400
#define CAN3ICR_TI3                                   C3ICR_TI3
#define C3ICR_TI3_BIT                                 10
#define CAN3ICR_TI3_BIT                               C3ICR_TI3_BIT
#define C3ICR_ERRBIT_MASK                             0x1F0000
#define CAN3ICR_ERRBIT_MASK                           C3ICR_ERRBIT_MASK
#define C3ICR_ERRBIT_BIT                              16
#define CAN3ICR_ERRBIT_BIT                            C3ICR_ERRBIT_BIT
#define C3ICR_ERRDIR_MASK                             0x200000
#define CAN3ICR_ERRDIR_MASK                           C3ICR_ERRDIR_MASK
#define C3ICR_ERRDIR                                  0x200000
#define CAN3ICR_ERRDIR                                C3ICR_ERRDIR
#define C3ICR_ERRDIR_BIT                              21
#define CAN3ICR_ERRDIR_BIT                            C3ICR_ERRDIR_BIT
#define C3ICR_ERRC_MASK                               0xC00000
#define CAN3ICR_ERRC_MASK                             C3ICR_ERRC_MASK
#define C3ICR_ERRC_BIT                                22
#define CAN3ICR_ERRC_BIT                              C3ICR_ERRC_BIT
#define C3ICR_ALCBIT_MASK                             0x1F000000
#define CAN3ICR_ALCBIT_MASK                           C3ICR_ALCBIT_MASK
#define C3ICR_ALCBIT_BIT                              24
#define CAN3ICR_ALCBIT_BIT                            C3ICR_ALCBIT_BIT

#define C3IER                                         ( *( volatile unsigned long * ) 0xE004C010 )
#define CAN3IER                                       C3IER
#define C3IER_OFFSET                                  0x10
#define CAN3IER_OFFSET                                C3IER_OFFSET
#define C3IER_RIE_MASK                                0x1
#define CAN3IER_RIE_MASK                              C3IER_RIE_MASK
#define C3IER_RIE                                     0x1
#define CAN3IER_RIE                                   C3IER_RIE
#define C3IER_RIE_BIT                                 0
#define CAN3IER_RIE_BIT                               C3IER_RIE_BIT
#define C3IER_TIE1_MASK                               0x2
#define CAN3IER_TIE1_MASK                             C3IER_TIE1_MASK
#define C3IER_TIE1                                    0x2
#define CAN3IER_TIE1                                  C3IER_TIE1
#define C3IER_TIE1_BIT                                1
#define CAN3IER_TIE1_BIT                              C3IER_TIE1_BIT
#define C3IER_EIE_MASK                                0x4
#define CAN3IER_EIE_MASK                              C3IER_EIE_MASK
#define C3IER_EIE                                     0x4
#define CAN3IER_EIE                                   C3IER_EIE
#define C3IER_EIE_BIT                                 2
#define CAN3IER_EIE_BIT                               C3IER_EIE_BIT
#define C3IER_DOIE_MASK                               0x8
#define CAN3IER_DOIE_MASK                             C3IER_DOIE_MASK
#define C3IER_DOIE                                    0x8
#define CAN3IER_DOIE                                  C3IER_DOIE
#define C3IER_DOIE_BIT                                3
#define CAN3IER_DOIE_BIT                              C3IER_DOIE_BIT
#define C3IER_WUIE_MASK                               0x10
#define CAN3IER_WUIE_MASK                             C3IER_WUIE_MASK
#define C3IER_WUIE                                    0x10
#define CAN3IER_WUIE                                  C3IER_WUIE
#define C3IER_WUIE_BIT                                4
#define CAN3IER_WUIE_BIT                              C3IER_WUIE_BIT
#define C3IER_EPIE_MASK                               0x20
#define CAN3IER_EPIE_MASK                             C3IER_EPIE_MASK
#define C3IER_EPIE                                    0x20
#define CAN3IER_EPIE                                  C3IER_EPIE
#define C3IER_EPIE_BIT                                5
#define CAN3IER_EPIE_BIT                              C3IER_EPIE_BIT
#define C3IER_ALIE_MASK                               0x40
#define CAN3IER_ALIE_MASK                             C3IER_ALIE_MASK
#define C3IER_ALIE                                    0x40
#define CAN3IER_ALIE                                  C3IER_ALIE
#define C3IER_ALIE_BIT                                6
#define CAN3IER_ALIE_BIT                              C3IER_ALIE_BIT
#define C3IER_BEIE_MASK                               0x80
#define CAN3IER_BEIE_MASK                             C3IER_BEIE_MASK
#define C3IER_BEIE                                    0x80
#define CAN3IER_BEIE                                  C3IER_BEIE
#define C3IER_BEIE_BIT                                7
#define CAN3IER_BEIE_BIT                              C3IER_BEIE_BIT
#define C3IER_IDIE_MASK                               0x100
#define CAN3IER_IDIE_MASK                             C3IER_IDIE_MASK
#define C3IER_IDIE                                    0x100
#define CAN3IER_IDIE                                  C3IER_IDIE
#define C3IER_IDIE_BIT                                8
#define CAN3IER_IDIE_BIT                              C3IER_IDIE_BIT
#define C3IER_TIE2_MASK                               0x200
#define CAN3IER_TIE2_MASK                             C3IER_TIE2_MASK
#define C3IER_TIE2                                    0x200
#define CAN3IER_TIE2                                  C3IER_TIE2
#define C3IER_TIE2_BIT                                9
#define CAN3IER_TIE2_BIT                              C3IER_TIE2_BIT
#define C3IER_TIE3_MASK                               0x400
#define CAN3IER_TIE3_MASK                             C3IER_TIE3_MASK
#define C3IER_TIE3                                    0x400
#define CAN3IER_TIE3                                  C3IER_TIE3
#define C3IER_TIE3_BIT                                10
#define CAN3IER_TIE3_BIT                              C3IER_TIE3_BIT

#define C3BTR                                         ( *( volatile unsigned long * ) 0xE004C014 )
#define CAN3BTR                                       C3BTR
#define C3BTR_OFFSET                                  0x14
#define CAN3BTR_OFFSET                                C3BTR_OFFSET
#define C3BTR_BRP_MASK                                0x3FF
#define CAN3BTR_BRP_MASK                              C3BTR_BRP_MASK
#define C3BTR_BRP_BIT                                 0
#define CAN3BTR_BRP_BIT                               C3BTR_BRP_BIT
#define C3BTR_SJW_MASK                                0xC000
#define CAN3BTR_SJW_MASK                              C3BTR_SJW_MASK
#define C3BTR_SJW_BIT                                 14
#define CAN3BTR_SJW_BIT                               C3BTR_SJW_BIT
#define C3BTR_TSEG1_MASK                              0xF0000
#define CAN3BTR_TSEG1_MASK                            C3BTR_TSEG1_MASK
#define C3BTR_TSEG1_BIT                               16
#define CAN3BTR_TSEG1_BIT                             C3BTR_TSEG1_BIT
#define C3BTR_TSEG2_MASK                              0x700000
#define CAN3BTR_TSEG2_MASK                            C3BTR_TSEG2_MASK
#define C3BTR_TSEG2_BIT                               20
#define CAN3BTR_TSEG2_BIT                             C3BTR_TSEG2_BIT
#define C3BTR_SAM_MASK                                0x800000
#define CAN3BTR_SAM_MASK                              C3BTR_SAM_MASK
#define C3BTR_SAM                                     0x800000
#define CAN3BTR_SAM                                   C3BTR_SAM
#define C3BTR_SAM_BIT                                 23
#define CAN3BTR_SAM_BIT                               C3BTR_SAM_BIT

