FreeRTOS/FreeRTOS/FreeRTOS/Demo/ARM7_LPC2138_Rowley/LPC21xx.h
#define C3EWL                                         ( *( volatile unsigned long * ) 0xE004C018 )
#define CAN3EWL                                       C3EWL
#define C3EWL_OFFSET                                  0x18
#define CAN3EWL_OFFSET                                C3EWL_OFFSET
#define C3EWL_EWL_MASK                                0xFF
#define CAN3EWL_EWL_MASK                              C3EWL_EWL_MASK
#define C3EWL_EWL_BIT                                 0
#define CAN3EWL_EWL_BIT                               C3EWL_EWL_BIT

#define C3SR                                          ( *( volatile unsigned long * ) 0xE004C01C )
#define CAN3SR                                        C3SR
#define C3SR_OFFSET                                   0x1C
#define CAN3SR_OFFSET                                 C3SR_OFFSET
#define C3SR_RBS_MASK                                 0x1
#define CAN3SR_RBS_MASK                               C3SR_RBS_MASK
#define C3SR_RBS                                      0x1
#define CAN3SR_RBS                                    C3SR_RBS
#define C3SR_RBS_BIT                                  0
#define CAN3SR_RBS_BIT                                C3SR_RBS_BIT
#define C3SR_DOS_MASK                                 0x2
#define CAN3SR_DOS_MASK                               C3SR_DOS_MASK
#define C3SR_DOS                                      0x2
#define CAN3SR_DOS                                    C3SR_DOS
#define C3SR_DOS_BIT                                  1
#define CAN3SR_DOS_BIT                                C3SR_DOS_BIT
#define C3SR_TBS1_MASK                                0x4
#define CAN3SR_TBS1_MASK                              C3SR_TBS1_MASK
#define C3SR_TBS1                                     0x4
#define CAN3SR_TBS1                                   C3SR_TBS1
#define C3SR_TBS1_BIT                                 2
#define CAN3SR_TBS1_BIT                               C3SR_TBS1_BIT
#define C3SR_TCS1_MASK                                0x8
#define CAN3SR_TCS1_MASK                              C3SR_TCS1_MASK
#define C3SR_TCS1                                     0x8
#define CAN3SR_TCS1                                   C3SR_TCS1
#define C3SR_TCS1_BIT                                 3
#define CAN3SR_TCS1_BIT                               C3SR_TCS1_BIT
#define C3SR_RS_MASK                                  0x10
#define CAN3SR_RS_MASK                                C3SR_RS_MASK
#define C3SR_RS                                       0x10
#define CAN3SR_RS                                     C3SR_RS
#define C3SR_RS_BIT                                   4
#define CAN3SR_RS_BIT                                 C3SR_RS_BIT
#define C3SR_TS1_MASK                                 0x20
#define CAN3SR_TS1_MASK                               C3SR_TS1_MASK
#define C3SR_TS1                                      0x20
#define CAN3SR_TS1                                    C3SR_TS1
#define C3SR_TS1_BIT                                  5
#define CAN3SR_TS1_BIT                                C3SR_TS1_BIT
#define C3SR_ES_MASK                                  0x40
#define CAN3SR_ES_MASK                                C3SR_ES_MASK
#define C3SR_ES                                       0x40
#define CAN3SR_ES                                     C3SR_ES
#define C3SR_ES_BIT                                   6
#define CAN3SR_ES_BIT                                 C3SR_ES_BIT
#define C3SR_BS_MASK                                  0x80
#define CAN3SR_BS_MASK                                C3SR_BS_MASK
#define C3SR_BS                                       0x80
#define CAN3SR_BS                                     C3SR_BS
#define C3SR_BS_BIT                                   7
#define CAN3SR_BS_BIT                                 C3SR_BS_BIT
#define C3SR_RBS2_MASK                                0x100
#define CAN3SR_RBS2_MASK                              C3SR_RBS2_MASK
#define C3SR_RBS2                                     0x100
#define CAN3SR_RBS2                                   C3SR_RBS2
#define C3SR_RBS2_BIT                                 8
#define CAN3SR_RBS2_BIT                               C3SR_RBS2_BIT
#define C3SR_DOS2_MASK                                0x200
#define CAN3SR_DOS2_MASK                              C3SR_DOS2_MASK
#define C3SR_DOS2                                     0x200
#define CAN3SR_DOS2                                   C3SR_DOS2
#define C3SR_DOS2_BIT                                 9
#define CAN3SR_DOS2_BIT                               C3SR_DOS2_BIT
#define C3SR_TBS2_MASK                                0x400
#define CAN3SR_TBS2_MASK                              C3SR_TBS2_MASK
#define C3SR_TBS2                                     0x400
#define CAN3SR_TBS2                                   C3SR_TBS2
#define C3SR_TBS2_BIT                                 10
#define CAN3SR_TBS2_BIT                               C3SR_TBS2_BIT
#define C3SR_TCS2_MASK                                0x800
#define CAN3SR_TCS2_MASK                              C3SR_TCS2_MASK
#define C3SR_TCS2                                     0x800
#define CAN3SR_TCS2                                   C3SR_TCS2
#define C3SR_TCS2_BIT                                 11
#define CAN3SR_TCS2_BIT                               C3SR_TCS2_BIT
#define C3SR_RS2_MASK                                 0x1000
#define CAN3SR_RS2_MASK                               C3SR_RS2_MASK
#define C3SR_RS2                                      0x1000
#define CAN3SR_RS2                                    C3SR_RS2
#define C3SR_RS2_BIT                                  12
#define CAN3SR_RS2_BIT                                C3SR_RS2_BIT
#define C3SR_TS2_MASK                                 0x2000
#define CAN3SR_TS2_MASK                               C3SR_TS2_MASK
#define C3SR_TS2                                      0x2000
#define CAN3SR_TS2                                    C3SR_TS2
#define C3SR_TS2_BIT                                  13
#define CAN3SR_TS2_BIT                                C3SR_TS2_BIT
#define C3SR_ES2_MASK                                 0x4000
#define CAN3SR_ES2_MASK                               C3SR_ES2_MASK
#define C3SR_ES2                                      0x4000
#define CAN3SR_ES2                                    C3SR_ES2
#define C3SR_ES2_BIT                                  14
#define CAN3SR_ES2_BIT                                C3SR_ES2_BIT
#define C3SR_BS2_MASK                                 0x8000
#define CAN3SR_BS2_MASK                               C3SR_BS2_MASK
#define C3SR_BS2                                      0x8000
#define CAN3SR_BS2                                    C3SR_BS2
#define C3SR_BS2_BIT                                  15
#define CAN3SR_BS2_BIT                                C3SR_BS2_BIT
#define C3SR_RBS3_MASK                                0x10000
#define CAN3SR_RBS3_MASK                              C3SR_RBS3_MASK
#define C3SR_RBS3                                     0x10000
#define CAN3SR_RBS3                                   C3SR_RBS3
#define C3SR_RBS3_BIT                                 16
#define CAN3SR_RBS3_BIT                               C3SR_RBS3_BIT
#define C3SR_DOS3_MASK                                0x20000
#define CAN3SR_DOS3_MASK                              C3SR_DOS3_MASK
#define C3SR_DOS3                                     0x20000
#define CAN3SR_DOS3                                   C3SR_DOS3
#define C3SR_DOS3_BIT                                 17
#define CAN3SR_DOS3_BIT                               C3SR_DOS3_BIT
#define C3SR_TBS3_MASK                                0x40000
#define CAN3SR_TBS3_MASK                              C3SR_TBS3_MASK
#define C3SR_TBS3                                     0x40000
#define CAN3SR_TBS3                                   C3SR_TBS3
#define C3SR_TBS3_BIT                                 18
#define CAN3SR_TBS3_BIT                               C3SR_TBS3_BIT
#define C3SR_TCS3_MASK                                0x80000
#define CAN3SR_TCS3_MASK                              C3SR_TCS3_MASK
#define C3SR_TCS3                                     0x80000
#define CAN3SR_TCS3                                   C3SR_TCS3
#define C3SR_TCS3_BIT                                 19
#define CAN3SR_TCS3_BIT                               C3SR_TCS3_BIT
#define C3SR_RS3_MASK                                 0x100000
#define CAN3SR_RS3_MASK                               C3SR_RS3_MASK
#define C3SR_RS3                                      0x100000
#define CAN3SR_RS3                                    C3SR_RS3
#define C3SR_RS3_BIT                                  20
#define CAN3SR_RS3_BIT                                C3SR_RS3_BIT
#define C3SR_TS3_MASK                                 0x200000
#define CAN3SR_TS3_MASK                               C3SR_TS3_MASK
#define C3SR_TS3                                      0x200000
#define CAN3SR_TS3                                    C3SR_TS3
#define C3SR_TS3_BIT                                  21
#define CAN3SR_TS3_BIT                                C3SR_TS3_BIT
#define C3SR_ES3_MASK                                 0x400000
#define CAN3SR_ES3_MASK                               C3SR_ES3_MASK
#define C3SR_ES3                                      0x400000
#define CAN3SR_ES3                                    C3SR_ES3
#define C3SR_ES3_BIT                                  22
#define CAN3SR_ES3_BIT                                C3SR_ES3_BIT
#define C3SR_BS3_MASK                                 0x800000
#define CAN3SR_BS3_MASK                               C3SR_BS3_MASK
#define C3SR_BS3                                      0x800000
#define CAN3SR_BS3                                    C3SR_BS3
#define C3SR_BS3_BIT                                  23
#define CAN3SR_BS3_BIT                                C3SR_BS3_BIT

#define C3RFS                                         ( *( volatile unsigned long * ) 0xE004C020 )
#define CAN3RFS                                       C3RFS
#define C3RFS_OFFSET                                  0x20
#define CAN3RFS_OFFSET                                C3RFS_OFFSET
#define C3RFS_ID_Index_MASK                           0x3FF
#define CAN3RFS_ID_Index_MASK                         C3RFS_ID_Index_MASK
#define C3RFS_ID_Index_BIT                            0
#define CAN3RFS_ID_Index_BIT                          C3RFS_ID_Index_BIT
#define C3RFS_BP_MASK                                 0x400
#define CAN3RFS_BP_MASK                               C3RFS_BP_MASK
#define C3RFS_BP                                      0x400
#define CAN3RFS_BP                                    C3RFS_BP
#define C3RFS_BP_BIT                                  10
#define CAN3RFS_BP_BIT                                C3RFS_BP_BIT
#define C3RFS_DLC_MASK                                0xF0000
#define CAN3RFS_DLC_MASK                              C3RFS_DLC_MASK
#define C3RFS_DLC_BIT                                 16
#define CAN3RFS_DLC_BIT                               C3RFS_DLC_BIT
#define C3RFS_RTR_MASK                                0x40000000
#define CAN3RFS_RTR_MASK                              C3RFS_RTR_MASK
#define C3RFS_RTR                                     0x40000000
#define CAN3RFS_RTR                                   C3RFS_RTR
#define C3RFS_RTR_BIT                                 30
#define CAN3RFS_RTR_BIT                               C3RFS_RTR_BIT
#define C3RFS_FF_MASK                                 0x80000000
#define CAN3RFS_FF_MASK                               C3RFS_FF_MASK
#define C3RFS_FF                                      0x80000000
#define CAN3RFS_FF                                    C3RFS_FF
#define C3RFS_FF_BIT                                  31
#define CAN3RFS_FF_BIT                                C3RFS_FF_BIT

#define C3RID                                         ( *( volatile unsigned long * ) 0xE004C024 )
#define CAN3RID                                       C3RID
#define C3RID_OFFSET                                  0x24
#define CAN3RID_OFFSET                                C3RID_OFFSET
#define C3RID_ID_MASK                                 0x7FF
#define CAN3RID_ID_MASK                               C3RID_ID_MASK
#define C3RID_ID_BIT                                  0
#define CAN3RID_ID_BIT                                C3RID_ID_BIT

#define C3RDA                                         ( *( volatile unsigned long * ) 0xE004C028 )
#define CAN3RDA                                       C3RDA
#define C3RDA_OFFSET                                  0x28
#define CAN3RDA_OFFSET                                C3RDA_OFFSET
#define C3RDA_Data_1_MASK                             0xFF
#define CAN3RDA_Data_1_MASK                           C3RDA_Data_1_MASK
#define C3RDA_Data_1_BIT                              0
#define CAN3RDA_Data_1_BIT                            C3RDA_Data_1_BIT
#define C3RDA_Data_2_MASK                             0xFF00
#define CAN3RDA_Data_2_MASK                           C3RDA_Data_2_MASK
#define C3RDA_Data_2_BIT                              8
#define CAN3RDA_Data_2_BIT                            C3RDA_Data_2_BIT
#define C3RDA_Data_3_MASK                             0xFF0000
#define CAN3RDA_Data_3_MASK                           C3RDA_Data_3_MASK
#define C3RDA_Data_3_BIT                              16
#define CAN3RDA_Data_3_BIT                            C3RDA_Data_3_BIT
#define C3RDA_Data_4_MASK                             0xFF000000
#define CAN3RDA_Data_4_MASK                           C3RDA_Data_4_MASK
#define C3RDA_Data_4_BIT                              24
#define CAN3RDA_Data_4_BIT                            C3RDA_Data_4_BIT

#define C3RDB                                         ( *( volatile unsigned long * ) 0xE004C02C )
#define CAN3RDB                                       C3RDB
#define C3RDB_OFFSET                                  0x2C
#define CAN3RDB_OFFSET                                C3RDB_OFFSET
#define C3RDB_Data_5_MASK                             0xFF
#define CAN3RDB_Data_5_MASK                           C3RDB_Data_5_MASK
#define C3RDB_Data_5_BIT                              0
#define CAN3RDB_Data_5_BIT                            C3RDB_Data_5_BIT
#define C3RDB_Data_6_MASK                             0xFF00
#define CAN3RDB_Data_6_MASK                           C3RDB_Data_6_MASK
#define C3RDB_Data_6_BIT                              8
#define CAN3RDB_Data_6_BIT                            C3RDB_Data_6_BIT
#define C3RDB_Data_7_MASK                             0xFF0000
#define CAN3RDB_Data_7_MASK                           C3RDB_Data_7_MASK
#define C3RDB_Data_7_BIT                              16
#define CAN3RDB_Data_7_BIT                            C3RDB_Data_7_BIT
#define C3RDB_Data_8_MASK                             0xFF000000
#define CAN3RDB_Data_8_MASK                           C3RDB_Data_8_MASK
#define C3RDB_Data_8_BIT                              24
#define CAN3RDB_Data_8_BIT                            C3RDB_Data_8_BIT

#define C3TFI1                                        ( *( volatile unsigned long * ) 0xE004C030 )
#define CAN3TFI1                                      C3TFI1
#define C3TFI1_OFFSET                                 0x30
#define CAN3TFI1_OFFSET                               C3TFI1_OFFSET
#define C3TFI1_PRIO_MASK                              0xFF
#define CAN3TFI1_PRIO_MASK                            C3TFI1_PRIO_MASK
#define C3TFI1_PRIO_BIT                               0
#define CAN3TFI1_PRIO_BIT                             C3TFI1_PRIO_BIT
#define C3TFI1_DLC_MASK                               0xF0000
#define CAN3TFI1_DLC_MASK                             C3TFI1_DLC_MASK
#define C3TFI1_DLC_BIT                                16
#define CAN3TFI1_DLC_BIT                              C3TFI1_DLC_BIT
#define C3TFI1_RTR_MASK                               0x40000000
#define CAN3TFI1_RTR_MASK                             C3TFI1_RTR_MASK
#define C3TFI1_RTR                                    0x40000000
#define CAN3TFI1_RTR                                  C3TFI1_RTR
#define C3TFI1_RTR_BIT                                30
#define CAN3TFI1_RTR_BIT                              C3TFI1_RTR_BIT
#define C3TFI1_FF_MASK                                0x80000000
#define CAN3TFI1_FF_MASK                              C3TFI1_FF_MASK
#define C3TFI1_FF                                     0x80000000
#define CAN3TFI1_FF                                   C3TFI1_FF
#define C3TFI1_FF_BIT                                 31
#define CAN3TFI1_FF_BIT                               C3TFI1_FF_BIT

#define C3TID1                                        ( *( volatile unsigned long * ) 0xE004C034 )
#define CAN3TID1                                      C3TID1
#define C3TID1_OFFSET                                 0x34
#define CAN3TID1_OFFSET                               C3TID1_OFFSET
#define C3TID1_ID_MASK                                0x7FF
#define CAN3TID1_ID_MASK                              C3TID1_ID_MASK
#define C3TID1_ID_BIT                                 0
#define CAN3TID1_ID_BIT                               C3TID1_ID_BIT

