FreeRTOS/FreeRTOS/FreeRTOS/Demo/ARM7_LPC2138_Rowley/LPC21xx.h
#define C3TDA1                                        ( *( volatile unsigned long * ) 0xE004C038 )
#define CAN3TDA1                                      C3TDA1
#define C3TDA1_OFFSET                                 0x38
#define CAN3TDA1_OFFSET                               C3TDA1_OFFSET
#define C3TDA1_Data_1_MASK                            0xFF
#define CAN3TDA1_Data_1_MASK                          C3TDA1_Data_1_MASK
#define C3TDA1_Data_1_BIT                             0
#define CAN3TDA1_Data_1_BIT                           C3TDA1_Data_1_BIT
#define C3TDA1_Data_2_MASK                            0xFF00
#define CAN3TDA1_Data_2_MASK                          C3TDA1_Data_2_MASK
#define C3TDA1_Data_2_BIT                             8
#define CAN3TDA1_Data_2_BIT                           C3TDA1_Data_2_BIT
#define C3TDA1_Data_3_MASK                            0xFF0000
#define CAN3TDA1_Data_3_MASK                          C3TDA1_Data_3_MASK
#define C3TDA1_Data_3_BIT                             16
#define CAN3TDA1_Data_3_BIT                           C3TDA1_Data_3_BIT
#define C3TDA1_Data_4_MASK                            0xFF000000
#define CAN3TDA1_Data_4_MASK                          C3TDA1_Data_4_MASK
#define C3TDA1_Data_4_BIT                             24
#define CAN3TDA1_Data_4_BIT                           C3TDA1_Data_4_BIT

#define C3TDB1                                        ( *( volatile unsigned long * ) 0xE004C03C )
#define CAN3TDB1                                      C3TDB1
#define C3TDB1_OFFSET                                 0x3C
#define CAN3TDB1_OFFSET                               C3TDB1_OFFSET
#define C3TDB1_Data_5_MASK                            0xFF
#define CAN3TDB1_Data_5_MASK                          C3TDB1_Data_5_MASK
#define C3TDB1_Data_5_BIT                             0
#define CAN3TDB1_Data_5_BIT                           C3TDB1_Data_5_BIT
#define C3TDB1_Data_6_MASK                            0xFF00
#define CAN3TDB1_Data_6_MASK                          C3TDB1_Data_6_MASK
#define C3TDB1_Data_6_BIT                             8
#define CAN3TDB1_Data_6_BIT                           C3TDB1_Data_6_BIT
#define C3TDB1_Data_7_MASK                            0xFF0000
#define CAN3TDB1_Data_7_MASK                          C3TDB1_Data_7_MASK
#define C3TDB1_Data_7_BIT                             16
#define CAN3TDB1_Data_7_BIT                           C3TDB1_Data_7_BIT
#define C3TDB1_Data_8_MASK                            0xFF000000
#define CAN3TDB1_Data_8_MASK                          C3TDB1_Data_8_MASK
#define C3TDB1_Data_8_BIT                             24
#define CAN3TDB1_Data_8_BIT                           C3TDB1_Data_8_BIT

#define C3TFI2                                        ( *( volatile unsigned long * ) 0xE004C040 )
#define CAN3TFI2                                      C3TFI2
#define C3TFI2_OFFSET                                 0x40
#define CAN3TFI2_OFFSET                               C3TFI2_OFFSET
#define C3TFI2_PRIO_MASK                              0xFF
#define CAN3TFI2_PRIO_MASK                            C3TFI2_PRIO_MASK
#define C3TFI2_PRIO_BIT                               0
#define CAN3TFI2_PRIO_BIT                             C3TFI2_PRIO_BIT
#define C3TFI2_DLC_MASK                               0xF0000
#define CAN3TFI2_DLC_MASK                             C3TFI2_DLC_MASK
#define C3TFI2_DLC_BIT                                16
#define CAN3TFI2_DLC_BIT                              C3TFI2_DLC_BIT
#define C3TFI2_RTR_MASK                               0x40000000
#define CAN3TFI2_RTR_MASK                             C3TFI2_RTR_MASK
#define C3TFI2_RTR                                    0x40000000
#define CAN3TFI2_RTR                                  C3TFI2_RTR
#define C3TFI2_RTR_BIT                                30
#define CAN3TFI2_RTR_BIT                              C3TFI2_RTR_BIT
#define C3TFI2_FF_MASK                                0x80000000
#define CAN3TFI2_FF_MASK                              C3TFI2_FF_MASK
#define C3TFI2_FF                                     0x80000000
#define CAN3TFI2_FF                                   C3TFI2_FF
#define C3TFI2_FF_BIT                                 31
#define CAN3TFI2_FF_BIT                               C3TFI2_FF_BIT

#define C3TID2                                        ( *( volatile unsigned long * ) 0xE004C044 )
#define CAN3TID2                                      C3TID2
#define C3TID2_OFFSET                                 0x44
#define CAN3TID2_OFFSET                               C3TID2_OFFSET
#define C3TID2_ID_MASK                                0x7FF
#define CAN3TID2_ID_MASK                              C3TID2_ID_MASK
#define C3TID2_ID_BIT                                 0
#define CAN3TID2_ID_BIT                               C3TID2_ID_BIT

#define C3TDA2                                        ( *( volatile unsigned long * ) 0xE004C048 )
#define CAN3TDA2                                      C3TDA2
#define C3TDA2_OFFSET                                 0x48
#define CAN3TDA2_OFFSET                               C3TDA2_OFFSET
#define C3TDA2_Data_1_MASK                            0xFF
#define CAN3TDA2_Data_1_MASK                          C3TDA2_Data_1_MASK
#define C3TDA2_Data_1_BIT                             0
#define CAN3TDA2_Data_1_BIT                           C3TDA2_Data_1_BIT
#define C3TDA2_Data_2_MASK                            0xFF00
#define CAN3TDA2_Data_2_MASK                          C3TDA2_Data_2_MASK
#define C3TDA2_Data_2_BIT                             8
#define CAN3TDA2_Data_2_BIT                           C3TDA2_Data_2_BIT
#define C3TDA2_Data_3_MASK                            0xFF0000
#define CAN3TDA2_Data_3_MASK                          C3TDA2_Data_3_MASK
#define C3TDA2_Data_3_BIT                             16
#define CAN3TDA2_Data_3_BIT                           C3TDA2_Data_3_BIT
#define C3TDA2_Data_4_MASK                            0xFF000000
#define CAN3TDA2_Data_4_MASK                          C3TDA2_Data_4_MASK
#define C3TDA2_Data_4_BIT                             24
#define CAN3TDA2_Data_4_BIT                           C3TDA2_Data_4_BIT

