FreeRTOS/FreeRTOS/FreeRTOS/Demo/ARM7_LPC2138_Rowley/LPC21xx.h
#define C3TDB2                                        ( *( volatile unsigned long * ) 0xE004C04C )
#define CAN3TDB2                                      C3TDB2
#define C3TDB2_OFFSET                                 0x4C
#define CAN3TDB2_OFFSET                               C3TDB2_OFFSET
#define C3TDB2_Data_5_MASK                            0xFF
#define CAN3TDB2_Data_5_MASK                          C3TDB2_Data_5_MASK
#define C3TDB2_Data_5_BIT                             0
#define CAN3TDB2_Data_5_BIT                           C3TDB2_Data_5_BIT
#define C3TDB2_Data_6_MASK                            0xFF00
#define CAN3TDB2_Data_6_MASK                          C3TDB2_Data_6_MASK
#define C3TDB2_Data_6_BIT                             8
#define CAN3TDB2_Data_6_BIT                           C3TDB2_Data_6_BIT
#define C3TDB2_Data_7_MASK                            0xFF0000
#define CAN3TDB2_Data_7_MASK                          C3TDB2_Data_7_MASK
#define C3TDB2_Data_7_BIT                             16
#define CAN3TDB2_Data_7_BIT                           C3TDB2_Data_7_BIT
#define C3TDB2_Data_8_MASK                            0xFF000000
#define CAN3TDB2_Data_8_MASK                          C3TDB2_Data_8_MASK
#define C3TDB2_Data_8_BIT                             24
#define CAN3TDB2_Data_8_BIT                           C3TDB2_Data_8_BIT

#define C3TFI3                                        ( *( volatile unsigned long * ) 0xE004C050 )
#define CAN3TFI3                                      C3TFI3
#define C3TFI3_OFFSET                                 0x50
#define CAN3TFI3_OFFSET                               C3TFI3_OFFSET
#define C3TFI3_PRIO_MASK                              0xFF
#define CAN3TFI3_PRIO_MASK                            C3TFI3_PRIO_MASK
#define C3TFI3_PRIO_BIT                               0
#define CAN3TFI3_PRIO_BIT                             C3TFI3_PRIO_BIT
#define C3TFI3_DLC_MASK                               0xF0000
#define CAN3TFI3_DLC_MASK                             C3TFI3_DLC_MASK
#define C3TFI3_DLC_BIT                                16
#define CAN3TFI3_DLC_BIT                              C3TFI3_DLC_BIT
#define C3TFI3_RTR_MASK                               0x40000000
#define CAN3TFI3_RTR_MASK                             C3TFI3_RTR_MASK
#define C3TFI3_RTR                                    0x40000000
#define CAN3TFI3_RTR                                  C3TFI3_RTR
#define C3TFI3_RTR_BIT                                30
#define CAN3TFI3_RTR_BIT                              C3TFI3_RTR_BIT
#define C3TFI3_FF_MASK                                0x80000000
#define CAN3TFI3_FF_MASK                              C3TFI3_FF_MASK
#define C3TFI3_FF                                     0x80000000
#define CAN3TFI3_FF                                   C3TFI3_FF
#define C3TFI3_FF_BIT                                 31
#define CAN3TFI3_FF_BIT                               C3TFI3_FF_BIT

#define C3TID3                                        ( *( volatile unsigned long * ) 0xE004C054 )
#define CAN3TID3                                      C3TID3
#define C3TID3_OFFSET                                 0x54
#define CAN3TID3_OFFSET                               C3TID3_OFFSET
#define C3TID3_ID_MASK                                0x7FF
#define CAN3TID3_ID_MASK                              C3TID3_ID_MASK
#define C3TID3_ID_BIT                                 0
#define CAN3TID3_ID_BIT                               C3TID3_ID_BIT

#define C3TDA3                                        ( *( volatile unsigned long * ) 0xE004C058 )
#define CAN3TDA3                                      C3TDA3
#define C3TDA3_OFFSET                                 0x58
#define CAN3TDA3_OFFSET                               C3TDA3_OFFSET
#define C3TDA3_Data_1_MASK                            0xFF
#define CAN3TDA3_Data_1_MASK                          C3TDA3_Data_1_MASK
#define C3TDA3_Data_1_BIT                             0
#define CAN3TDA3_Data_1_BIT                           C3TDA3_Data_1_BIT
#define C3TDA3_Data_2_MASK                            0xFF00
#define CAN3TDA3_Data_2_MASK                          C3TDA3_Data_2_MASK
#define C3TDA3_Data_2_BIT                             8
#define CAN3TDA3_Data_2_BIT                           C3TDA3_Data_2_BIT
#define C3TDA3_Data_3_MASK                            0xFF0000
#define CAN3TDA3_Data_3_MASK                          C3TDA3_Data_3_MASK
#define C3TDA3_Data_3_BIT                             16
#define CAN3TDA3_Data_3_BIT                           C3TDA3_Data_3_BIT
#define C3TDA3_Data_4_MASK                            0xFF000000
#define CAN3TDA3_Data_4_MASK                          C3TDA3_Data_4_MASK
#define C3TDA3_Data_4_BIT                             24
#define CAN3TDA3_Data_4_BIT                           C3TDA3_Data_4_BIT

#define C3TDB3                                        ( *( volatile unsigned long * ) 0xE004C05C )
#define CAN3TDB3                                      C3TDB3
#define C3TDB3_OFFSET                                 0x5C
#define CAN3TDB3_OFFSET                               C3TDB3_OFFSET
#define C3TDB3_Data_5_MASK                            0xFF
#define CAN3TDB3_Data_5_MASK                          C3TDB3_Data_5_MASK
#define C3TDB3_Data_5_BIT                             0
#define CAN3TDB3_Data_5_BIT                           C3TDB3_Data_5_BIT
#define C3TDB3_Data_6_MASK                            0xFF00
#define CAN3TDB3_Data_6_MASK                          C3TDB3_Data_6_MASK
#define C3TDB3_Data_6_BIT                             8
#define CAN3TDB3_Data_6_BIT                           C3TDB3_Data_6_BIT
#define C3TDB3_Data_7_MASK                            0xFF0000
#define CAN3TDB3_Data_7_MASK                          C3TDB3_Data_7_MASK
#define C3TDB3_Data_7_BIT                             16
#define CAN3TDB3_Data_7_BIT                           C3TDB3_Data_7_BIT
#define C3TDB3_Data_8_MASK                            0xFF000000
#define CAN3TDB3_Data_8_MASK                          C3TDB3_Data_8_MASK
#define C3TDB3_Data_8_BIT                             24
#define CAN3TDB3_Data_8_BIT                           C3TDB3_Data_8_BIT

