FreeRTOS/FreeRTOS/FreeRTOS/Demo/ARM7_LPC2138_Rowley/LPC21xx.h
#define CAN4_BASE                                     0xE0050000

#define C4MOD                                         ( *( volatile unsigned long * ) 0xE0050000 )
#define CAN4MOD                                       C4MOD
#define C4MOD_OFFSET                                  0x0
#define CAN4MOD_OFFSET                                C4MOD_OFFSET
#define C4MOD_RM_MASK                                 0x1
#define CAN4MOD_RM_MASK                               C4MOD_RM_MASK
#define C4MOD_RM                                      0x1
#define CAN4MOD_RM                                    C4MOD_RM
#define C4MOD_RM_BIT                                  0
#define CAN4MOD_RM_BIT                                C4MOD_RM_BIT
#define C4MOD_LOM_MASK                                0x2
#define CAN4MOD_LOM_MASK                              C4MOD_LOM_MASK
#define C4MOD_LOM                                     0x2
#define CAN4MOD_LOM                                   C4MOD_LOM
#define C4MOD_LOM_BIT                                 1
#define CAN4MOD_LOM_BIT                               C4MOD_LOM_BIT
#define C4MOD_STM_MASK                                0x4
#define CAN4MOD_STM_MASK                              C4MOD_STM_MASK
#define C4MOD_STM                                     0x4
#define CAN4MOD_STM                                   C4MOD_STM
#define C4MOD_STM_BIT                                 2
#define CAN4MOD_STM_BIT                               C4MOD_STM_BIT
#define C4MOD_TPM_MASK                                0x8
#define CAN4MOD_TPM_MASK                              C4MOD_TPM_MASK
#define C4MOD_TPM                                     0x8
#define CAN4MOD_TPM                                   C4MOD_TPM
#define C4MOD_TPM_BIT                                 3
#define CAN4MOD_TPM_BIT                               C4MOD_TPM_BIT
#define C4MOD_SM_MASK                                 0x10
#define CAN4MOD_SM_MASK                               C4MOD_SM_MASK
#define C4MOD_SM                                      0x10
#define CAN4MOD_SM                                    C4MOD_SM
#define C4MOD_SM_BIT                                  4
#define CAN4MOD_SM_BIT                                C4MOD_SM_BIT
#define C4MOD_RPM_MASK                                0x20
#define CAN4MOD_RPM_MASK                              C4MOD_RPM_MASK
#define C4MOD_RPM                                     0x20
#define CAN4MOD_RPM                                   C4MOD_RPM
#define C4MOD_RPM_BIT                                 5
#define CAN4MOD_RPM_BIT                               C4MOD_RPM_BIT
#define C4MOD_TM_MASK                                 0x80
#define CAN4MOD_TM_MASK                               C4MOD_TM_MASK
#define C4MOD_TM                                      0x80
#define CAN4MOD_TM                                    C4MOD_TM
#define C4MOD_TM_BIT                                  7
#define CAN4MOD_TM_BIT                                C4MOD_TM_BIT

#define C4CMR                                         ( *( volatile unsigned long * ) 0xE0050004 )
#define CAN4CMR                                       C4CMR
#define C4CMR_OFFSET                                  0x4
#define CAN4CMR_OFFSET                                C4CMR_OFFSET
#define C4CMR_TR_MASK                                 0x1
#define CAN4CMR_TR_MASK                               C4CMR_TR_MASK
#define C4CMR_TR                                      0x1
#define CAN4CMR_TR                                    C4CMR_TR
#define C4CMR_TR_BIT                                  0
#define CAN4CMR_TR_BIT                                C4CMR_TR_BIT
#define C4CMR_AT_MASK                                 0x2
#define CAN4CMR_AT_MASK                               C4CMR_AT_MASK
#define C4CMR_AT                                      0x2
#define CAN4CMR_AT                                    C4CMR_AT
#define C4CMR_AT_BIT                                  1
#define CAN4CMR_AT_BIT                                C4CMR_AT_BIT
#define C4CMR_RRB_MASK                                0x4
#define CAN4CMR_RRB_MASK                              C4CMR_RRB_MASK
#define C4CMR_RRB                                     0x4
#define CAN4CMR_RRB                                   C4CMR_RRB
#define C4CMR_RRB_BIT                                 2
#define CAN4CMR_RRB_BIT                               C4CMR_RRB_BIT
#define C4CMR_CDO_MASK                                0x8
#define CAN4CMR_CDO_MASK                              C4CMR_CDO_MASK
#define C4CMR_CDO                                     0x8
#define CAN4CMR_CDO                                   C4CMR_CDO
#define C4CMR_CDO_BIT                                 3
#define CAN4CMR_CDO_BIT                               C4CMR_CDO_BIT
#define C4CMR_SRR_MASK                                0x10
#define CAN4CMR_SRR_MASK                              C4CMR_SRR_MASK
#define C4CMR_SRR                                     0x10
#define CAN4CMR_SRR                                   C4CMR_SRR
#define C4CMR_SRR_BIT                                 4
#define CAN4CMR_SRR_BIT                               C4CMR_SRR_BIT
#define C4CMR_STB1_MASK                               0x20
#define CAN4CMR_STB1_MASK                             C4CMR_STB1_MASK
#define C4CMR_STB1                                    0x20
#define CAN4CMR_STB1                                  C4CMR_STB1
#define C4CMR_STB1_BIT                                5
#define CAN4CMR_STB1_BIT                              C4CMR_STB1_BIT
#define C4CMR_STB2_MASK                               0x40
#define CAN4CMR_STB2_MASK                             C4CMR_STB2_MASK
#define C4CMR_STB2                                    0x40
#define CAN4CMR_STB2                                  C4CMR_STB2
#define C4CMR_STB2_BIT                                6
#define CAN4CMR_STB2_BIT                              C4CMR_STB2_BIT
#define C4CMR_STB3_MASK                               0x80
#define CAN4CMR_STB3_MASK                             C4CMR_STB3_MASK
#define C4CMR_STB3                                    0x80
#define CAN4CMR_STB3                                  C4CMR_STB3
#define C4CMR_STB3_BIT                                7
#define CAN4CMR_STB3_BIT                              C4CMR_STB3_BIT

#define C4GSR                                         ( *( volatile unsigned long * ) 0xE0050008 )
#define CAN4GSR                                       C4GSR
#define C4GSR_OFFSET                                  0x8
#define CAN4GSR_OFFSET                                C4GSR_OFFSET
#define C4GSR_RBS_MASK                                0x1
#define CAN4GSR_RBS_MASK                              C4GSR_RBS_MASK
#define C4GSR_RBS                                     0x1
#define CAN4GSR_RBS                                   C4GSR_RBS
#define C4GSR_RBS_BIT                                 0
#define CAN4GSR_RBS_BIT                               C4GSR_RBS_BIT
#define C4GSR_DOS_MASK                                0x2
#define CAN4GSR_DOS_MASK                              C4GSR_DOS_MASK
#define C4GSR_DOS                                     0x2
#define CAN4GSR_DOS                                   C4GSR_DOS
#define C4GSR_DOS_BIT                                 1
#define CAN4GSR_DOS_BIT                               C4GSR_DOS_BIT
#define C4GSR_TBS_MASK                                0x4
#define CAN4GSR_TBS_MASK                              C4GSR_TBS_MASK
#define C4GSR_TBS                                     0x4
#define CAN4GSR_TBS                                   C4GSR_TBS
#define C4GSR_TBS_BIT                                 2
#define CAN4GSR_TBS_BIT                               C4GSR_TBS_BIT
#define C4GSR_TCS_MASK                                0x8
#define CAN4GSR_TCS_MASK                              C4GSR_TCS_MASK
#define C4GSR_TCS                                     0x8
#define CAN4GSR_TCS                                   C4GSR_TCS
#define C4GSR_TCS_BIT                                 3
#define CAN4GSR_TCS_BIT                               C4GSR_TCS_BIT
#define C4GSR_RS_MASK                                 0x10
#define CAN4GSR_RS_MASK                               C4GSR_RS_MASK
#define C4GSR_RS                                      0x10
#define CAN4GSR_RS                                    C4GSR_RS
#define C4GSR_RS_BIT                                  4
#define CAN4GSR_RS_BIT                                C4GSR_RS_BIT
#define C4GSR_TS_MASK                                 0x20
#define CAN4GSR_TS_MASK                               C4GSR_TS_MASK
#define C4GSR_TS                                      0x20
#define CAN4GSR_TS                                    C4GSR_TS
#define C4GSR_TS_BIT                                  5
#define CAN4GSR_TS_BIT                                C4GSR_TS_BIT
#define C4GSR_ES_MASK                                 0x40
#define CAN4GSR_ES_MASK                               C4GSR_ES_MASK
#define C4GSR_ES                                      0x40
#define CAN4GSR_ES                                    C4GSR_ES
#define C4GSR_ES_BIT                                  6
#define CAN4GSR_ES_BIT                                C4GSR_ES_BIT
#define C4GSR_BS_MASK                                 0x80
#define CAN4GSR_BS_MASK                               C4GSR_BS_MASK
#define C4GSR_BS                                      0x80
#define CAN4GSR_BS                                    C4GSR_BS
#define C4GSR_BS_BIT                                  7
#define CAN4GSR_BS_BIT                                C4GSR_BS_BIT
#define C4GSR_RXERR_MASK                              0xFF0000
#define CAN4GSR_RXERR_MASK                            C4GSR_RXERR_MASK
#define C4GSR_RXERR_BIT                               16
#define CAN4GSR_RXERR_BIT                             C4GSR_RXERR_BIT
#define C4GSR_TXERR_MASK                              0xFF000000
#define CAN4GSR_TXERR_MASK                            C4GSR_TXERR_MASK
#define C4GSR_TXERR_BIT                               24
#define CAN4GSR_TXERR_BIT                             C4GSR_TXERR_BIT

#define C4ICR                                         ( *( volatile unsigned long * ) 0xE005000C )
#define CAN4ICR                                       C4ICR
#define C4ICR_OFFSET                                  0xC
#define CAN4ICR_OFFSET                                C4ICR_OFFSET
#define C4ICR_RI_MASK                                 0x1
#define CAN4ICR_RI_MASK                               C4ICR_RI_MASK
#define C4ICR_RI                                      0x1
#define CAN4ICR_RI                                    C4ICR_RI
#define C4ICR_RI_BIT                                  0
#define CAN4ICR_RI_BIT                                C4ICR_RI_BIT
#define C4ICR_TI1_MASK                                0x2
#define CAN4ICR_TI1_MASK                              C4ICR_TI1_MASK
#define C4ICR_TI1                                     0x2
#define CAN4ICR_TI1                                   C4ICR_TI1
#define C4ICR_TI1_BIT                                 1
#define CAN4ICR_TI1_BIT                               C4ICR_TI1_BIT
#define C4ICR_EI_MASK                                 0x4
#define CAN4ICR_EI_MASK                               C4ICR_EI_MASK
#define C4ICR_EI                                      0x4
#define CAN4ICR_EI                                    C4ICR_EI
#define C4ICR_EI_BIT                                  2
#define CAN4ICR_EI_BIT                                C4ICR_EI_BIT
#define C4ICR_DOI_MASK                                0x8
#define CAN4ICR_DOI_MASK                              C4ICR_DOI_MASK
#define C4ICR_DOI                                     0x8
#define CAN4ICR_DOI                                   C4ICR_DOI
#define C4ICR_DOI_BIT                                 3
#define CAN4ICR_DOI_BIT                               C4ICR_DOI_BIT
#define C4ICR_WUI_MASK                                0x10
#define CAN4ICR_WUI_MASK                              C4ICR_WUI_MASK
#define C4ICR_WUI                                     0x10
#define CAN4ICR_WUI                                   C4ICR_WUI
#define C4ICR_WUI_BIT                                 4
#define CAN4ICR_WUI_BIT                               C4ICR_WUI_BIT
#define C4ICR_EPI_MASK                                0x20
#define CAN4ICR_EPI_MASK                              C4ICR_EPI_MASK
#define C4ICR_EPI                                     0x20
#define CAN4ICR_EPI                                   C4ICR_EPI
#define C4ICR_EPI_BIT                                 5
#define CAN4ICR_EPI_BIT                               C4ICR_EPI_BIT
#define C4ICR_ALI_MASK                                0x40
#define CAN4ICR_ALI_MASK                              C4ICR_ALI_MASK
#define C4ICR_ALI                                     0x40
#define CAN4ICR_ALI                                   C4ICR_ALI
#define C4ICR_ALI_BIT                                 6
#define CAN4ICR_ALI_BIT                               C4ICR_ALI_BIT
#define C4ICR_BEI_MASK                                0x80
#define CAN4ICR_BEI_MASK                              C4ICR_BEI_MASK
#define C4ICR_BEI                                     0x80
#define CAN4ICR_BEI                                   C4ICR_BEI
#define C4ICR_BEI_BIT                                 7
#define CAN4ICR_BEI_BIT                               C4ICR_BEI_BIT
#define C4ICR_IDI_MASK                                0x100
#define CAN4ICR_IDI_MASK                              C4ICR_IDI_MASK
#define C4ICR_IDI                                     0x100
#define CAN4ICR_IDI                                   C4ICR_IDI
#define C4ICR_IDI_BIT                                 8
#define CAN4ICR_IDI_BIT                               C4ICR_IDI_BIT
#define C4ICR_TI2_MASK                                0x200
#define CAN4ICR_TI2_MASK                              C4ICR_TI2_MASK
#define C4ICR_TI2                                     0x200
#define CAN4ICR_TI2                                   C4ICR_TI2
#define C4ICR_TI2_BIT                                 9
#define CAN4ICR_TI2_BIT                               C4ICR_TI2_BIT
#define C4ICR_TI3_MASK                                0x400
#define CAN4ICR_TI3_MASK                              C4ICR_TI3_MASK
#define C4ICR_TI3                                     0x400
#define CAN4ICR_TI3                                   C4ICR_TI3
#define C4ICR_TI3_BIT                                 10
#define CAN4ICR_TI3_BIT                               C4ICR_TI3_BIT
#define C4ICR_ERRBIT_MASK                             0x1F0000
#define CAN4ICR_ERRBIT_MASK                           C4ICR_ERRBIT_MASK
#define C4ICR_ERRBIT_BIT                              16
#define CAN4ICR_ERRBIT_BIT                            C4ICR_ERRBIT_BIT
#define C4ICR_ERRDIR_MASK                             0x200000
#define CAN4ICR_ERRDIR_MASK                           C4ICR_ERRDIR_MASK
#define C4ICR_ERRDIR                                  0x200000
#define CAN4ICR_ERRDIR                                C4ICR_ERRDIR
#define C4ICR_ERRDIR_BIT                              21
#define CAN4ICR_ERRDIR_BIT                            C4ICR_ERRDIR_BIT
#define C4ICR_ERRC_MASK                               0xC00000
#define CAN4ICR_ERRC_MASK                             C4ICR_ERRC_MASK
#define C4ICR_ERRC_BIT                                22
#define CAN4ICR_ERRC_BIT                              C4ICR_ERRC_BIT
#define C4ICR_ALCBIT_MASK                             0x1F000000
#define CAN4ICR_ALCBIT_MASK                           C4ICR_ALCBIT_MASK
#define C4ICR_ALCBIT_BIT                              24
#define CAN4ICR_ALCBIT_BIT                            C4ICR_ALCBIT_BIT

#define C4IER                                         ( *( volatile unsigned long * ) 0xE0050010 )
#define CAN4IER                                       C4IER
#define C4IER_OFFSET                                  0x10
#define CAN4IER_OFFSET                                C4IER_OFFSET
#define C4IER_RIE_MASK                                0x1
#define CAN4IER_RIE_MASK                              C4IER_RIE_MASK
#define C4IER_RIE                                     0x1
#define CAN4IER_RIE                                   C4IER_RIE
#define C4IER_RIE_BIT                                 0
#define CAN4IER_RIE_BIT                               C4IER_RIE_BIT
#define C4IER_TIE1_MASK                               0x2
#define CAN4IER_TIE1_MASK                             C4IER_TIE1_MASK
#define C4IER_TIE1                                    0x2
#define CAN4IER_TIE1                                  C4IER_TIE1
#define C4IER_TIE1_BIT                                1
#define CAN4IER_TIE1_BIT                              C4IER_TIE1_BIT
#define C4IER_EIE_MASK                                0x4
#define CAN4IER_EIE_MASK                              C4IER_EIE_MASK
#define C4IER_EIE                                     0x4
#define CAN4IER_EIE                                   C4IER_EIE
#define C4IER_EIE_BIT                                 2
#define CAN4IER_EIE_BIT                               C4IER_EIE_BIT
#define C4IER_DOIE_MASK                               0x8
#define CAN4IER_DOIE_MASK                             C4IER_DOIE_MASK
#define C4IER_DOIE                                    0x8
#define CAN4IER_DOIE                                  C4IER_DOIE
#define C4IER_DOIE_BIT                                3
#define CAN4IER_DOIE_BIT                              C4IER_DOIE_BIT
#define C4IER_WUIE_MASK                               0x10
#define CAN4IER_WUIE_MASK                             C4IER_WUIE_MASK
#define C4IER_WUIE                                    0x10
#define CAN4IER_WUIE                                  C4IER_WUIE
#define C4IER_WUIE_BIT                                4
#define CAN4IER_WUIE_BIT                              C4IER_WUIE_BIT
#define C4IER_EPIE_MASK                               0x20
#define CAN4IER_EPIE_MASK                             C4IER_EPIE_MASK
#define C4IER_EPIE                                    0x20
#define CAN4IER_EPIE                                  C4IER_EPIE
#define C4IER_EPIE_BIT                                5
#define CAN4IER_EPIE_BIT                              C4IER_EPIE_BIT
#define C4IER_ALIE_MASK                               0x40
#define CAN4IER_ALIE_MASK                             C4IER_ALIE_MASK
#define C4IER_ALIE                                    0x40
#define CAN4IER_ALIE                                  C4IER_ALIE
#define C4IER_ALIE_BIT                                6
#define CAN4IER_ALIE_BIT                              C4IER_ALIE_BIT
#define C4IER_BEIE_MASK                               0x80
#define CAN4IER_BEIE_MASK                             C4IER_BEIE_MASK
#define C4IER_BEIE                                    0x80
#define CAN4IER_BEIE                                  C4IER_BEIE
#define C4IER_BEIE_BIT                                7
#define CAN4IER_BEIE_BIT                              C4IER_BEIE_BIT
#define C4IER_IDIE_MASK                               0x100
#define CAN4IER_IDIE_MASK                             C4IER_IDIE_MASK
#define C4IER_IDIE                                    0x100
#define CAN4IER_IDIE                                  C4IER_IDIE
#define C4IER_IDIE_BIT                                8
#define CAN4IER_IDIE_BIT                              C4IER_IDIE_BIT
#define C4IER_TIE2_MASK                               0x200
#define CAN4IER_TIE2_MASK                             C4IER_TIE2_MASK
#define C4IER_TIE2                                    0x200
#define CAN4IER_TIE2                                  C4IER_TIE2
#define C4IER_TIE2_BIT                                9
#define CAN4IER_TIE2_BIT                              C4IER_TIE2_BIT
#define C4IER_TIE3_MASK                               0x400
#define CAN4IER_TIE3_MASK                             C4IER_TIE3_MASK
#define C4IER_TIE3                                    0x400
#define CAN4IER_TIE3                                  C4IER_TIE3
#define C4IER_TIE3_BIT                                10
#define CAN4IER_TIE3_BIT                              C4IER_TIE3_BIT

#define C4BTR                                         ( *( volatile unsigned long * ) 0xE0050014 )
#define CAN4BTR                                       C4BTR
#define C4BTR_OFFSET                                  0x14
#define CAN4BTR_OFFSET                                C4BTR_OFFSET
#define C4BTR_BRP_MASK                                0x3FF
#define CAN4BTR_BRP_MASK                              C4BTR_BRP_MASK
#define C4BTR_BRP_BIT                                 0
#define CAN4BTR_BRP_BIT                               C4BTR_BRP_BIT
#define C4BTR_SJW_MASK                                0xC000
#define CAN4BTR_SJW_MASK                              C4BTR_SJW_MASK
#define C4BTR_SJW_BIT                                 14
#define CAN4BTR_SJW_BIT                               C4BTR_SJW_BIT
#define C4BTR_TSEG1_MASK                              0xF0000
#define CAN4BTR_TSEG1_MASK                            C4BTR_TSEG1_MASK
#define C4BTR_TSEG1_BIT                               16
#define CAN4BTR_TSEG1_BIT                             C4BTR_TSEG1_BIT
#define C4BTR_TSEG2_MASK                              0x700000
#define CAN4BTR_TSEG2_MASK                            C4BTR_TSEG2_MASK
#define C4BTR_TSEG2_BIT                               20
#define CAN4BTR_TSEG2_BIT                             C4BTR_TSEG2_BIT
#define C4BTR_SAM_MASK                                0x800000
#define CAN4BTR_SAM_MASK                              C4BTR_SAM_MASK
#define C4BTR_SAM                                     0x800000
#define CAN4BTR_SAM                                   C4BTR_SAM
#define C4BTR_SAM_BIT                                 23
#define CAN4BTR_SAM_BIT                               C4BTR_SAM_BIT

#define C4EWL                                         ( *( volatile unsigned long * ) 0xE0050018 )
#define CAN4EWL                                       C4EWL
#define C4EWL_OFFSET                                  0x18
#define CAN4EWL_OFFSET                                C4EWL_OFFSET
#define C4EWL_EWL_MASK                                0xFF
#define CAN4EWL_EWL_MASK                              C4EWL_EWL_MASK
#define C4EWL_EWL_BIT                                 0
#define CAN4EWL_EWL_BIT                               C4EWL_EWL_BIT

