FreeRTOS/FreeRTOS/FreeRTOS/Demo/ARM7_LPC2138_Rowley/LPC21xx.h
#define C4RID                                         ( *( volatile unsigned long * ) 0xE0050024 )
#define CAN4RID                                       C4RID
#define C4RID_OFFSET                                  0x24
#define CAN4RID_OFFSET                                C4RID_OFFSET
#define C4RID_ID_MASK                                 0x7FF
#define CAN4RID_ID_MASK                               C4RID_ID_MASK
#define C4RID_ID_BIT                                  0
#define CAN4RID_ID_BIT                                C4RID_ID_BIT

#define C4RDA                                         ( *( volatile unsigned long * ) 0xE0050028 )
#define CAN4RDA                                       C4RDA
#define C4RDA_OFFSET                                  0x28
#define CAN4RDA_OFFSET                                C4RDA_OFFSET
#define C4RDA_Data_1_MASK                             0xFF
#define CAN4RDA_Data_1_MASK                           C4RDA_Data_1_MASK
#define C4RDA_Data_1_BIT                              0
#define CAN4RDA_Data_1_BIT                            C4RDA_Data_1_BIT
#define C4RDA_Data_2_MASK                             0xFF00
#define CAN4RDA_Data_2_MASK                           C4RDA_Data_2_MASK
#define C4RDA_Data_2_BIT                              8
#define CAN4RDA_Data_2_BIT                            C4RDA_Data_2_BIT
#define C4RDA_Data_3_MASK                             0xFF0000
#define CAN4RDA_Data_3_MASK                           C4RDA_Data_3_MASK
#define C4RDA_Data_3_BIT                              16
#define CAN4RDA_Data_3_BIT                            C4RDA_Data_3_BIT
#define C4RDA_Data_4_MASK                             0xFF000000
#define CAN4RDA_Data_4_MASK                           C4RDA_Data_4_MASK
#define C4RDA_Data_4_BIT                              24
#define CAN4RDA_Data_4_BIT                            C4RDA_Data_4_BIT

#define C4RDB                                         ( *( volatile unsigned long * ) 0xE005002C )
#define CAN4RDB                                       C4RDB
#define C4RDB_OFFSET                                  0x2C
#define CAN4RDB_OFFSET                                C4RDB_OFFSET
#define C4RDB_Data_5_MASK                             0xFF
#define CAN4RDB_Data_5_MASK                           C4RDB_Data_5_MASK
#define C4RDB_Data_5_BIT                              0
#define CAN4RDB_Data_5_BIT                            C4RDB_Data_5_BIT
#define C4RDB_Data_6_MASK                             0xFF00
#define CAN4RDB_Data_6_MASK                           C4RDB_Data_6_MASK
#define C4RDB_Data_6_BIT                              8
#define CAN4RDB_Data_6_BIT                            C4RDB_Data_6_BIT
#define C4RDB_Data_7_MASK                             0xFF0000
#define CAN4RDB_Data_7_MASK                           C4RDB_Data_7_MASK
#define C4RDB_Data_7_BIT                              16
#define CAN4RDB_Data_7_BIT                            C4RDB_Data_7_BIT
#define C4RDB_Data_8_MASK                             0xFF000000
#define CAN4RDB_Data_8_MASK                           C4RDB_Data_8_MASK
#define C4RDB_Data_8_BIT                              24
#define CAN4RDB_Data_8_BIT                            C4RDB_Data_8_BIT

#define C4TFI1                                        ( *( volatile unsigned long * ) 0xE0050030 )
#define CAN4TFI1                                      C4TFI1
#define C4TFI1_OFFSET                                 0x30
#define CAN4TFI1_OFFSET                               C4TFI1_OFFSET
#define C4TFI1_PRIO_MASK                              0xFF
#define CAN4TFI1_PRIO_MASK                            C4TFI1_PRIO_MASK
#define C4TFI1_PRIO_BIT                               0
#define CAN4TFI1_PRIO_BIT                             C4TFI1_PRIO_BIT
#define C4TFI1_DLC_MASK                               0xF0000
#define CAN4TFI1_DLC_MASK                             C4TFI1_DLC_MASK
#define C4TFI1_DLC_BIT                                16
#define CAN4TFI1_DLC_BIT                              C4TFI1_DLC_BIT
#define C4TFI1_RTR_MASK                               0x40000000
#define CAN4TFI1_RTR_MASK                             C4TFI1_RTR_MASK
#define C4TFI1_RTR                                    0x40000000
#define CAN4TFI1_RTR                                  C4TFI1_RTR
#define C4TFI1_RTR_BIT                                30
#define CAN4TFI1_RTR_BIT                              C4TFI1_RTR_BIT
#define C4TFI1_FF_MASK                                0x80000000
#define CAN4TFI1_FF_MASK                              C4TFI1_FF_MASK
#define C4TFI1_FF                                     0x80000000
#define CAN4TFI1_FF                                   C4TFI1_FF
#define C4TFI1_FF_BIT                                 31
#define CAN4TFI1_FF_BIT                               C4TFI1_FF_BIT

#define C4TID1                                        ( *( volatile unsigned long * ) 0xE0050034 )
#define CAN4TID1                                      C4TID1
#define C4TID1_OFFSET                                 0x34
#define CAN4TID1_OFFSET                               C4TID1_OFFSET
#define C4TID1_ID_MASK                                0x7FF
#define CAN4TID1_ID_MASK                              C4TID1_ID_MASK
#define C4TID1_ID_BIT                                 0
#define CAN4TID1_ID_BIT                               C4TID1_ID_BIT

#define C4TDA1                                        ( *( volatile unsigned long * ) 0xE0050038 )
#define CAN4TDA1                                      C4TDA1
#define C4TDA1_OFFSET                                 0x38
#define CAN4TDA1_OFFSET                               C4TDA1_OFFSET
#define C4TDA1_Data_1_MASK                            0xFF
#define CAN4TDA1_Data_1_MASK                          C4TDA1_Data_1_MASK
#define C4TDA1_Data_1_BIT                             0
#define CAN4TDA1_Data_1_BIT                           C4TDA1_Data_1_BIT
#define C4TDA1_Data_2_MASK                            0xFF00
#define CAN4TDA1_Data_2_MASK                          C4TDA1_Data_2_MASK
#define C4TDA1_Data_2_BIT                             8
#define CAN4TDA1_Data_2_BIT                           C4TDA1_Data_2_BIT
#define C4TDA1_Data_3_MASK                            0xFF0000
#define CAN4TDA1_Data_3_MASK                          C4TDA1_Data_3_MASK
#define C4TDA1_Data_3_BIT                             16
#define CAN4TDA1_Data_3_BIT                           C4TDA1_Data_3_BIT
#define C4TDA1_Data_4_MASK                            0xFF000000
#define CAN4TDA1_Data_4_MASK                          C4TDA1_Data_4_MASK
#define C4TDA1_Data_4_BIT                             24
#define CAN4TDA1_Data_4_BIT                           C4TDA1_Data_4_BIT

