FreeRTOS/FreeRTOS/FreeRTOS/Demo/ARM7_LPC2138_Rowley/LPC21xx.h
#define C4TDB1                                        ( *( volatile unsigned long * ) 0xE005003C )
#define CAN4TDB1                                      C4TDB1
#define C4TDB1_OFFSET                                 0x3C
#define CAN4TDB1_OFFSET                               C4TDB1_OFFSET
#define C4TDB1_Data_5_MASK                            0xFF
#define CAN4TDB1_Data_5_MASK                          C4TDB1_Data_5_MASK
#define C4TDB1_Data_5_BIT                             0
#define CAN4TDB1_Data_5_BIT                           C4TDB1_Data_5_BIT
#define C4TDB1_Data_6_MASK                            0xFF00
#define CAN4TDB1_Data_6_MASK                          C4TDB1_Data_6_MASK
#define C4TDB1_Data_6_BIT                             8
#define CAN4TDB1_Data_6_BIT                           C4TDB1_Data_6_BIT
#define C4TDB1_Data_7_MASK                            0xFF0000
#define CAN4TDB1_Data_7_MASK                          C4TDB1_Data_7_MASK
#define C4TDB1_Data_7_BIT                             16
#define CAN4TDB1_Data_7_BIT                           C4TDB1_Data_7_BIT
#define C4TDB1_Data_8_MASK                            0xFF000000
#define CAN4TDB1_Data_8_MASK                          C4TDB1_Data_8_MASK
#define C4TDB1_Data_8_BIT                             24
#define CAN4TDB1_Data_8_BIT                           C4TDB1_Data_8_BIT

#define C4TFI2                                        ( *( volatile unsigned long * ) 0xE0050040 )
#define CAN4TFI2                                      C4TFI2
#define C4TFI2_OFFSET                                 0x40
#define CAN4TFI2_OFFSET                               C4TFI2_OFFSET
#define C4TFI2_PRIO_MASK                              0xFF
#define CAN4TFI2_PRIO_MASK                            C4TFI2_PRIO_MASK
#define C4TFI2_PRIO_BIT                               0
#define CAN4TFI2_PRIO_BIT                             C4TFI2_PRIO_BIT
#define C4TFI2_DLC_MASK                               0xF0000
#define CAN4TFI2_DLC_MASK                             C4TFI2_DLC_MASK
#define C4TFI2_DLC_BIT                                16
#define CAN4TFI2_DLC_BIT                              C4TFI2_DLC_BIT
#define C4TFI2_RTR_MASK                               0x40000000
#define CAN4TFI2_RTR_MASK                             C4TFI2_RTR_MASK
#define C4TFI2_RTR                                    0x40000000
#define CAN4TFI2_RTR                                  C4TFI2_RTR
#define C4TFI2_RTR_BIT                                30
#define CAN4TFI2_RTR_BIT                              C4TFI2_RTR_BIT
#define C4TFI2_FF_MASK                                0x80000000
#define CAN4TFI2_FF_MASK                              C4TFI2_FF_MASK
#define C4TFI2_FF                                     0x80000000
#define CAN4TFI2_FF                                   C4TFI2_FF
#define C4TFI2_FF_BIT                                 31
#define CAN4TFI2_FF_BIT                               C4TFI2_FF_BIT

#define C4TID2                                        ( *( volatile unsigned long * ) 0xE0050044 )
#define CAN4TID2                                      C4TID2
#define C4TID2_OFFSET                                 0x44
#define CAN4TID2_OFFSET                               C4TID2_OFFSET
#define C4TID2_ID_MASK                                0x7FF
#define CAN4TID2_ID_MASK                              C4TID2_ID_MASK
#define C4TID2_ID_BIT                                 0
#define CAN4TID2_ID_BIT                               C4TID2_ID_BIT

#define C4TDA2                                        ( *( volatile unsigned long * ) 0xE0050048 )
#define CAN4TDA2                                      C4TDA2
#define C4TDA2_OFFSET                                 0x48
#define CAN4TDA2_OFFSET                               C4TDA2_OFFSET
#define C4TDA2_Data_1_MASK                            0xFF
#define CAN4TDA2_Data_1_MASK                          C4TDA2_Data_1_MASK
#define C4TDA2_Data_1_BIT                             0
#define CAN4TDA2_Data_1_BIT                           C4TDA2_Data_1_BIT
#define C4TDA2_Data_2_MASK                            0xFF00
#define CAN4TDA2_Data_2_MASK                          C4TDA2_Data_2_MASK
#define C4TDA2_Data_2_BIT                             8
#define CAN4TDA2_Data_2_BIT                           C4TDA2_Data_2_BIT
#define C4TDA2_Data_3_MASK                            0xFF0000
#define CAN4TDA2_Data_3_MASK                          C4TDA2_Data_3_MASK
#define C4TDA2_Data_3_BIT                             16
#define CAN4TDA2_Data_3_BIT                           C4TDA2_Data_3_BIT
#define C4TDA2_Data_4_MASK                            0xFF000000
#define CAN4TDA2_Data_4_MASK                          C4TDA2_Data_4_MASK
#define C4TDA2_Data_4_BIT                             24
#define CAN4TDA2_Data_4_BIT                           C4TDA2_Data_4_BIT

#define C4TDB2                                        ( *( volatile unsigned long * ) 0xE005004C )
#define CAN4TDB2                                      C4TDB2
#define C4TDB2_OFFSET                                 0x4C
#define CAN4TDB2_OFFSET                               C4TDB2_OFFSET
#define C4TDB2_Data_5_MASK                            0xFF
#define CAN4TDB2_Data_5_MASK                          C4TDB2_Data_5_MASK
#define C4TDB2_Data_5_BIT                             0
#define CAN4TDB2_Data_5_BIT                           C4TDB2_Data_5_BIT
#define C4TDB2_Data_6_MASK                            0xFF00
#define CAN4TDB2_Data_6_MASK                          C4TDB2_Data_6_MASK
#define C4TDB2_Data_6_BIT                             8
#define CAN4TDB2_Data_6_BIT                           C4TDB2_Data_6_BIT
#define C4TDB2_Data_7_MASK                            0xFF0000
#define CAN4TDB2_Data_7_MASK                          C4TDB2_Data_7_MASK
#define C4TDB2_Data_7_BIT                             16
#define CAN4TDB2_Data_7_BIT                           C4TDB2_Data_7_BIT
#define C4TDB2_Data_8_MASK                            0xFF000000
#define CAN4TDB2_Data_8_MASK                          C4TDB2_Data_8_MASK
#define C4TDB2_Data_8_BIT                             24
#define CAN4TDB2_Data_8_BIT                           C4TDB2_Data_8_BIT

#define C4TFI3                                        ( *( volatile unsigned long * ) 0xE0050050 )
#define CAN4TFI3                                      C4TFI3
#define C4TFI3_OFFSET                                 0x50
#define CAN4TFI3_OFFSET                               C4TFI3_OFFSET
#define C4TFI3_PRIO_MASK                              0xFF
#define CAN4TFI3_PRIO_MASK                            C4TFI3_PRIO_MASK
#define C4TFI3_PRIO_BIT                               0
#define CAN4TFI3_PRIO_BIT                             C4TFI3_PRIO_BIT
#define C4TFI3_DLC_MASK                               0xF0000
#define CAN4TFI3_DLC_MASK                             C4TFI3_DLC_MASK
#define C4TFI3_DLC_BIT                                16
#define CAN4TFI3_DLC_BIT                              C4TFI3_DLC_BIT
#define C4TFI3_RTR_MASK                               0x40000000
#define CAN4TFI3_RTR_MASK                             C4TFI3_RTR_MASK
#define C4TFI3_RTR                                    0x40000000
#define CAN4TFI3_RTR                                  C4TFI3_RTR
#define C4TFI3_RTR_BIT                                30
#define CAN4TFI3_RTR_BIT                              C4TFI3_RTR_BIT
#define C4TFI3_FF_MASK                                0x80000000
#define CAN4TFI3_FF_MASK                              C4TFI3_FF_MASK
#define C4TFI3_FF                                     0x80000000
#define CAN4TFI3_FF                                   C4TFI3_FF
#define C4TFI3_FF_BIT                                 31
#define CAN4TFI3_FF_BIT                               C4TFI3_FF_BIT

#define C4TID3                                        ( *( volatile unsigned long * ) 0xE0050054 )
#define CAN4TID3                                      C4TID3
#define C4TID3_OFFSET                                 0x54
#define CAN4TID3_OFFSET                               C4TID3_OFFSET
#define C4TID3_ID_MASK                                0x7FF
#define CAN4TID3_ID_MASK                              C4TID3_ID_MASK
#define C4TID3_ID_BIT                                 0
#define CAN4TID3_ID_BIT                               C4TID3_ID_BIT

