FreeRTOS/FreeRTOS/FreeRTOS/Demo/ARM7_LPC2138_Rowley/LPC21xx.h
#define C4TDA3                                        ( *( volatile unsigned long * ) 0xE0050058 )
#define CAN4TDA3                                      C4TDA3
#define C4TDA3_OFFSET                                 0x58
#define CAN4TDA3_OFFSET                               C4TDA3_OFFSET
#define C4TDA3_Data_1_MASK                            0xFF
#define CAN4TDA3_Data_1_MASK                          C4TDA3_Data_1_MASK
#define C4TDA3_Data_1_BIT                             0
#define CAN4TDA3_Data_1_BIT                           C4TDA3_Data_1_BIT
#define C4TDA3_Data_2_MASK                            0xFF00
#define CAN4TDA3_Data_2_MASK                          C4TDA3_Data_2_MASK
#define C4TDA3_Data_2_BIT                             8
#define CAN4TDA3_Data_2_BIT                           C4TDA3_Data_2_BIT
#define C4TDA3_Data_3_MASK                            0xFF0000
#define CAN4TDA3_Data_3_MASK                          C4TDA3_Data_3_MASK
#define C4TDA3_Data_3_BIT                             16
#define CAN4TDA3_Data_3_BIT                           C4TDA3_Data_3_BIT
#define C4TDA3_Data_4_MASK                            0xFF000000
#define CAN4TDA3_Data_4_MASK                          C4TDA3_Data_4_MASK
#define C4TDA3_Data_4_BIT                             24
#define CAN4TDA3_Data_4_BIT                           C4TDA3_Data_4_BIT

#define C4TDB3                                        ( *( volatile unsigned long * ) 0xE005005C )
#define CAN4TDB3                                      C4TDB3
#define C4TDB3_OFFSET                                 0x5C
#define CAN4TDB3_OFFSET                               C4TDB3_OFFSET
#define C4TDB3_Data_5_MASK                            0xFF
#define CAN4TDB3_Data_5_MASK                          C4TDB3_Data_5_MASK
#define C4TDB3_Data_5_BIT                             0
#define CAN4TDB3_Data_5_BIT                           C4TDB3_Data_5_BIT
#define C4TDB3_Data_6_MASK                            0xFF00
#define CAN4TDB3_Data_6_MASK                          C4TDB3_Data_6_MASK
#define C4TDB3_Data_6_BIT                             8
#define CAN4TDB3_Data_6_BIT                           C4TDB3_Data_6_BIT
#define C4TDB3_Data_7_MASK                            0xFF0000
#define CAN4TDB3_Data_7_MASK                          C4TDB3_Data_7_MASK
#define C4TDB3_Data_7_BIT                             16
#define CAN4TDB3_Data_7_BIT                           C4TDB3_Data_7_BIT
#define C4TDB3_Data_8_MASK                            0xFF000000
#define CAN4TDB3_Data_8_MASK                          C4TDB3_Data_8_MASK
#define C4TDB3_Data_8_BIT                             24
#define CAN4TDB3_Data_8_BIT                           C4TDB3_Data_8_BIT

#define SSP_BASE                                      0xE005C000

#define SSPCR0                                        ( *( volatile unsigned long * ) 0xE005C000 )
#define SSPCR0_OFFSET                                 0x0
#define SSPCR0_SCR_MASK                               0xFF00
#define SSPCR0_SCR_BIT                                8
#define SSPCR0_CPHA_MASK                              0x80
#define SSPCR0_CPHA                                   0x80
#define SSPCR0_CPHA_BIT                               7
#define SSPCR0_CPOL_MASK                              0x40
#define SSPCR0_CPOL                                   0x40
#define SSPCR0_CPOL_BIT                               6
#define SSPCR0_FRF_MASK                               0x30
#define SSPCR0_FRF_BIT                                4
#define SSPCR0_DSS_MASK                               0xF
#define SSPCR0_DSS_BIT                                0

#define SSPCR1                                        ( *( volatile unsigned long * ) 0xE005C004 )
#define SSPCR1_OFFSET                                 0x4
#define SSPCR1_SOD_MASK                               0x8
#define SSPCR1_SOD                                    0x8
#define SSPCR1_SOD_BIT                                3
#define SSPCR1_MS_MASK                                0x4
#define SSPCR1_MS                                     0x4
#define SSPCR1_MS_BIT                                 2
#define SSPCR1_SSE_MASK                               0x2
#define SSPCR1_SSE                                    0x2
#define SSPCR1_SSE_BIT                                1
#define SSPCR1_LBE_MASK                               0x1
#define SSPCR1_LBE                                    0x1
#define SSPCR1_LBE_BIT                                0

#define SSPDR                                         ( *( volatile unsigned long * ) 0xE005C008 )
#define SSPDR_OFFSET                                  0x8

#define SSPSR                                         ( *( volatile unsigned long * ) 0xE005C00C )
#define SSPSR_OFFSET                                  0xC
#define SSPSR_BSY_MASK                                0x10
#define SSPSR_BSY                                     0x10
#define SSPSR_BSY_BIT                                 4
#define SSPSR_RFF_MASK                                0x8
#define SSPSR_RFF                                     0x8
#define SSPSR_RFF_BIT                                 3
#define SSPSR_RNE_MASK                                0x4
#define SSPSR_RNE                                     0x4
#define SSPSR_RNE_BIT                                 2
#define SSPSR_TNF_MASK                                0x2
#define SSPSR_TNF                                     0x2
#define SSPSR_TNF_BIT                                 1
#define SSPSR_TFE_MASK                                0x1
#define SSPSR_TFE                                     0x1
#define SSPSR_TFE_BIT                                 0

#define SSPCPSR                                       ( *( volatile unsigned long * ) 0xE005C010 )
#define SSPCPSR_OFFSET                                0x10
#define SSPCPSR_CPSDVSR_MASK                          0xFF
#define SSPCPSR_CPSDVSR_BIT                           0

#define SSPIMSC                                       ( *( volatile unsigned long * ) 0xE005C014 )
#define SSPIMSC_OFFSET                                0x14
#define SSPIMSC_TXIM_MASK                             0x8
#define SSPIMSC_TXIM                                  0x8
#define SSPIMSC_TXIM_BIT                              3
#define SSPIMSC_RXIM_MASK                             0x4
#define SSPIMSC_RXIM                                  0x4
#define SSPIMSC_RXIM_BIT                              2
#define SSPIMSC_RTIM_MASK                             0x2
#define SSPIMSC_RTIM                                  0x2
#define SSPIMSC_RTIM_BIT                              1
#define SSPIMSC_RORIM_MASK                            0x1
#define SSPIMSC_RORIM                                 0x1
#define SSPIMSC_RORIM_BIT                             0

#define SSPRIS                                        ( *( volatile unsigned long * ) 0xE005C018 )
#define SSPRIS_OFFSET                                 0x18
#define SSPRIS_TXRIS_MASK                             0x8
#define SSPRIS_TXRIS                                  0x8
#define SSPRIS_TXRIS_BIT                              3
#define SSPRIS_RXRIS_MASK                             0x4
#define SSPRIS_RXRIS                                  0x4
#define SSPRIS_RXRIS_BIT                              2
#define SSPRIS_RTRIS_MASK                             0x2
#define SSPRIS_RTRIS                                  0x2
#define SSPRIS_RTRIS_BIT                              1
#define SSPRIS_RORRIS_MASK                            0x1
#define SSPRIS_RORRIS                                 0x1
#define SSPRIS_RORRIS_BIT                             0

#define SSPMIS                                        ( *( volatile unsigned long * ) 0xE005C01C )
#define SSPMIS_OFFSET                                 0x1C
#define SSPMIS_TXMIS_MASK                             0x8
#define SSPMIS_TXMIS                                  0x8
#define SSPMIS_TXMIS_BIT                              3
#define SSPMIS_RXMIS_MASK                             0x4
#define SSPMIS_RXMIS                                  0x4
#define SSPMIS_RXMIS_BIT                              2
#define SSPMIS_RTMIS_MASK                             0x2
#define SSPMIS_RTMIS                                  0x2
#define SSPMIS_RTMIS_BIT                              1
#define SSPMIS_RORMIS_MASK                            0x1
#define SSPMIS_RORMIS                                 0x1
#define SSPMIS_RORMIS_BIT                             0

#define SSPICR                                        ( *( volatile unsigned long * ) 0xE005C020 )
#define SSPICR_OFFSET                                 0x20
#define SSPICR_RTIC_MASK                              0x2
#define SSPICR_RTIC                                   0x2
#define SSPICR_RTIC_BIT                               1
#define SSPICR_RORIC_MASK                             0x1
#define SSPICR_RORIC                                  0x1
#define SSPICR_RORIC_BIT                              0

#define SCB_BASE                                      0xE01FC000

#define MAMCR                                         ( *( volatile unsigned char * ) 0xE01FC000 )
#define MAMCR_OFFSET                                  0x0
#define MAMCR_MAM_mode_control_MASK                   0x3
#define MAMCR_MAM_mode_control_BIT                    0

