FreeRTOS/FreeRTOS/FreeRTOS/Demo/ARM7_LPC2138_Rowley/LPC21xx.h
#define MAMTIM                                        ( *( volatile unsigned char * ) 0xE01FC004 )
#define MAMTIM_OFFSET                                 0x4
#define MAMTIM_MAM_fetch_cycle_timing_MASK            0x7
#define MAMTIM_MAM_fetch_cycle_timing_BIT             0

#define MEMMAP                                        ( *( volatile unsigned char * ) 0xE01FC040 )
#define MEMMAP_OFFSET                                 0x40
#define MEMMAP_MAP_MASK                               0x3
#define MEMMAP_MAP_BIT                                0

#define PLLCON                                        ( *( volatile unsigned char * ) 0xE01FC080 )
#define PLLCON_OFFSET                                 0x80
#define PLLCON_PLLE_MASK                              0x1
#define PLLCON_PLLE                                   0x1
#define PLLCON_PLLE_BIT                               0
#define PLLCON_PLLC_MASK                              0x2
#define PLLCON_PLLC                                   0x2
#define PLLCON_PLLC_BIT                               1

#define PLLCFG                                        ( *( volatile unsigned char * ) 0xE01FC084 )
#define PLLCFG_OFFSET                                 0x84
#define PLLCFG_MSEL_MASK                              0x1F
#define PLLCFG_MSEL_BIT                               0
#define PLLCFG_PSEL_MASK                              0x60
#define PLLCFG_PSEL_BIT                               5

#define PLLSTAT                                       ( *( volatile unsigned short * ) 0xE01FC088 )
#define PLLSTAT_OFFSET                                0x88
#define PLLSTAT_MSEL_MASK                             0x1F
#define PLLSTAT_MSEL_BIT                              0
#define PLLSTAT_PSEL_MASK                             0x60
#define PLLSTAT_PSEL_BIT                              5
#define PLLSTAT_PLLE_MASK                             0x100
#define PLLSTAT_PLLE                                  0x100
#define PLLSTAT_PLLE_BIT                              8
#define PLLSTAT_PLLC_MASK                             0x200
#define PLLSTAT_PLLC                                  0x200
#define PLLSTAT_PLLC_BIT                              9
#define PLLSTAT_PLOCK_MASK                            0x400
#define PLLSTAT_PLOCK                                 0x400
#define PLLSTAT_PLOCK_BIT                             10

#define PLLFEED                                       ( *( volatile unsigned char * ) 0xE01FC08C )
#define PLLFEED_OFFSET                                0x8C

#define PCON                                          ( *( volatile unsigned char * ) 0xE01FC0C0 )
#define PCON_OFFSET                                   0xC0
#define PCON_IDL_MASK                                 0x1
#define PCON_IDL                                      0x1
#define PCON_IDL_BIT                                  0
#define PCON_PD_MASK                                  0x2
#define PCON_PD                                       0x2
#define PCON_PD_BIT                                   1

#define PCONP                                         ( *( volatile unsigned long * ) 0xE01FC0C4 )
#define PCONP_OFFSET                                  0xC4
#define PCONP_PCTIM0_MASK                             0x2
#define PCONP_PCTIM0                                  0x2
#define PCONP_PCTIM0_BIT                              1
#define PCONP_PCTIM1_MASK                             0x4
#define PCONP_PCTIM1                                  0x4
#define PCONP_PCTIM1_BIT                              2
#define PCONP_PCUART0_MASK                            0x8
#define PCONP_PCUART0                                 0x8
#define PCONP_PCUART0_BIT                             3
#define PCONP_PCUART1_MASK                            0x10
#define PCONP_PCUART1                                 0x10
#define PCONP_PCUART1_BIT                             4
#define PCONP_PCPWM0_MASK                             0x20
#define PCONP_PCPWM0                                  0x20
#define PCONP_PCPWM0_BIT                              5
#define PCONP_PCI2C_MASK                              0x80
#define PCONP_PCI2C                                   0x80
#define PCONP_PCI2C_BIT                               7
#define PCONP_PCSPI0_MASK                             0x100
#define PCONP_PCSPI0                                  0x100
#define PCONP_PCSPI0_BIT                              8
#define PCONP_PCRTC_MASK                              0x200
#define PCONP_PCRTC                                   0x200
#define PCONP_PCRTC_BIT                               9
#define PCONP_PCSPI1_MASK                             0x400
#define PCONP_PCSPI1                                  0x400
#define PCONP_PCSPI1_BIT                              10
#define PCONP_PCAD_MASK                               0x1000
#define PCONP_PCAD                                    0x1000
#define PCONP_PCAD_BIT                                12
#define PCONP_PCAN1_MASK                              0x2000
#define PCONP_PCAN1                                   0x2000
#define PCONP_PCAN1_BIT                               13
#define PCONP_PCAN2_MASK                              0x4000
#define PCONP_PCAN2                                   0x4000
#define PCONP_PCAN2_BIT                               14
#define PCONP_PCAN3_MASK                              0x8000
#define PCONP_PCAN3                                   0x8000
#define PCONP_PCAN3_BIT                               15
#define PCONP_PCAN4_MASK                              0x10000
#define PCONP_PCAN4                                   0x10000
#define PCONP_PCAN4_BIT                               16

#define VPBDIV                                        ( *( volatile unsigned char * ) 0xE01FC100 )
#define VPBDIV_OFFSET                                 0x100
#define VPBDIV_VPBDIV_MASK                            0x3
#define VPBDIV_VPBDIV_BIT                             0

#define EXTINT                                        ( *( volatile unsigned char * ) 0xE01FC140 )
#define EXTINT_OFFSET                                 0x140
#define EXTINT_EINT0_MASK                             0x1
#define EXTINT_EINT0                                  0x1
#define EXTINT_EINT0_BIT                              0
#define EXTINT_EINT1_MASK                             0x2
#define EXTINT_EINT1                                  0x2
#define EXTINT_EINT1_BIT                              1
#define EXTINT_EINT2_MASK                             0x4
#define EXTINT_EINT2                                  0x4
#define EXTINT_EINT2_BIT                              2
#define EXTINT_EINT3_MASK                             0x8
#define EXTINT_EINT3                                  0x8
#define EXTINT_EINT3_BIT                              3

#define EXTWAKE                                       ( *( volatile unsigned char * ) 0xE01FC144 )
#define EXTWAKE_OFFSET                                0x144
#define EXTWAKE_EXTWAKE0_MASK                         0x1
#define EXTWAKE_EXTWAKE0                              0x1
#define EXTWAKE_EXTWAKE0_BIT                          0
#define EXTWAKE_EXTWAKE1_MASK                         0x2
#define EXTWAKE_EXTWAKE1                              0x2
#define EXTWAKE_EXTWAKE1_BIT                          1
#define EXTWAKE_EXTWAKE2_MASK                         0x4
#define EXTWAKE_EXTWAKE2                              0x4
#define EXTWAKE_EXTWAKE2_BIT                          2
#define EXTWAKE_EXTWAKE3_MASK                         0x8
#define EXTWAKE_EXTWAKE3                              0x8
#define EXTWAKE_EXTWAKE3_BIT                          3

#define EXTMODE                                       ( *( volatile unsigned char * ) 0xE01FC148 )
#define EXTMODE_OFFSET                                0x148
#define EXTMODE_EXTMODE0_MASK                         0x1
#define EXTMODE_EXTMODE0                              0x1
#define EXTMODE_EXTMODE0_BIT                          0
#define EXTMODE_EXTMODE1_MASK                         0x2
#define EXTMODE_EXTMODE1                              0x2
#define EXTMODE_EXTMODE1_BIT                          1
#define EXTMODE_EXTMODE2_MASK                         0x4
#define EXTMODE_EXTMODE2                              0x4
#define EXTMODE_EXTMODE2_BIT                          2
#define EXTMODE_EXTMODE3_MASK                         0x8
#define EXTMODE_EXTMODE3                              0x8
#define EXTMODE_EXTMODE3_BIT                          3

#define EXTPOLAR                                      ( *( volatile unsigned char * ) 0xE01FC14C )
#define EXTPOLAR_OFFSET                               0x14C
#define EXTPOLAR_EXTPOLAR0_MASK                       0x1
#define EXTPOLAR_EXTPOLAR0                            0x1
#define EXTPOLAR_EXTPOLAR0_BIT                        0
#define EXTPOLAR_EXTPOLAR1_MASK                       0x2
#define EXTPOLAR_EXTPOLAR1                            0x2
#define EXTPOLAR_EXTPOLAR1_BIT                        1
#define EXTPOLAR_EXTPOLAR2_MASK                       0x4
#define EXTPOLAR_EXTPOLAR2                            0x4
#define EXTPOLAR_EXTPOLAR2_BIT                        2
#define EXTPOLAR_EXTPOLAR3_MASK                       0x8
#define EXTPOLAR_EXTPOLAR3                            0x8
#define EXTPOLAR_EXTPOLAR3_BIT                        3

#define VIC_BASE                                      0xFFFFF000

