FreeRTOS/FreeRTOS/FreeRTOS/Demo/ARM7_LPC2138_Rowley/LPC21xx.h
#define VICIRQStatus                                  ( *( volatile unsigned long * ) 0xFFFFF000 )
#define VICIRQStatus_OFFSET                           0x0

#define VICFIQStatus                                  ( *( volatile unsigned long * ) 0xFFFFF004 )
#define VICFIQStatus_OFFSET                           0x4

#define VICRawIntr                                    ( *( volatile unsigned long * ) 0xFFFFF008 )
#define VICRawIntr_OFFSET                             0x8

#define VICIntSelect                                  ( *( volatile unsigned long * ) 0xFFFFF00C )
#define VICIntSelect_OFFSET                           0xC

#define VICIntEnable                                  ( *( volatile unsigned long * ) 0xFFFFF010 )
#define VICIntEnable_OFFSET                           0x10

#define VICIntEnClr                                   ( *( volatile unsigned long * ) 0xFFFFF014 )
#define VICIntEnClr_OFFSET                            0x14

#define VICSoftInt                                    ( *( volatile unsigned long * ) 0xFFFFF018 )
#define VICSoftInt_OFFSET                             0x18

#define VICSoftIntClear                               ( *( volatile unsigned long * ) 0xFFFFF01C )
#define VICSoftIntClear_OFFSET                        0x1C

#define VICProtection                                 ( *( volatile unsigned long * ) 0xFFFFF020 )
#define VICProtection_OFFSET                          0x20

#define VICVectAddr                                   ( *( volatile unsigned long * ) 0xFFFFF030 )
#define VICVectAddr_OFFSET                            0x30

#define VICDefVectAddr                                ( *( volatile unsigned long * ) 0xFFFFF034 )
#define VICDefVectAddr_OFFSET                         0x34

#define VICVectAddr0                                  ( *( volatile unsigned long * ) 0xFFFFF100 )
#define VICVectAddr0_OFFSET                           0x100

#define VICVectAddr1                                  ( *( volatile unsigned long * ) 0xFFFFF104 )
#define VICVectAddr1_OFFSET                           0x104

#define VICVectAddr2                                  ( *( volatile unsigned long * ) 0xFFFFF108 )
#define VICVectAddr2_OFFSET                           0x108

#define VICVectAddr3                                  ( *( volatile unsigned long * ) 0xFFFFF10C )
#define VICVectAddr3_OFFSET                           0x10C

#define VICVectAddr4                                  ( *( volatile unsigned long * ) 0xFFFFF110 )
#define VICVectAddr4_OFFSET                           0x110

#define VICVectAddr5                                  ( *( volatile unsigned long * ) 0xFFFFF114 )
#define VICVectAddr5_OFFSET                           0x114

#define VICVectAddr6                                  ( *( volatile unsigned long * ) 0xFFFFF118 )
#define VICVectAddr6_OFFSET                           0x118

#define VICVectAddr7                                  ( *( volatile unsigned long * ) 0xFFFFF11C )
#define VICVectAddr7_OFFSET                           0x11C

#define VICVectAddr8                                  ( *( volatile unsigned long * ) 0xFFFFF120 )
#define VICVectAddr8_OFFSET                           0x120

#define VICVectAddr9                                  ( *( volatile unsigned long * ) 0xFFFFF124 )
#define VICVectAddr9_OFFSET                           0x124

#define VICVectAddr10                                 ( *( volatile unsigned long * ) 0xFFFFF128 )
#define VICVectAddr10_OFFSET                          0x128

#define VICVectAddr11                                 ( *( volatile unsigned long * ) 0xFFFFF12C )
#define VICVectAddr11_OFFSET                          0x12C

#define VICVectAddr12                                 ( *( volatile unsigned long * ) 0xFFFFF130 )
#define VICVectAddr12_OFFSET                          0x130

#define VICVectAddr13                                 ( *( volatile unsigned long * ) 0xFFFFF134 )
#define VICVectAddr13_OFFSET                          0x134

#define VICVectAddr14                                 ( *( volatile unsigned long * ) 0xFFFFF138 )
#define VICVectAddr14_OFFSET                          0x138

#define VICVectAddr15                                 ( *( volatile unsigned long * ) 0xFFFFF13C )
#define VICVectAddr15_OFFSET                          0x13C

#define VICVectCntl0                                  ( *( volatile unsigned long * ) 0xFFFFF200 )
#define VICVectCntl0_OFFSET                           0x200

#define VICVectCntl1                                  ( *( volatile unsigned long * ) 0xFFFFF204 )
#define VICVectCntl1_OFFSET                           0x204

#define VICVectCntl2                                  ( *( volatile unsigned long * ) 0xFFFFF208 )
#define VICVectCntl2_OFFSET                           0x208

#define VICVectCntl3                                  ( *( volatile unsigned long * ) 0xFFFFF20C )
#define VICVectCntl3_OFFSET                           0x20C

#define VICVectCntl4                                  ( *( volatile unsigned long * ) 0xFFFFF210 )
#define VICVectCntl4_OFFSET                           0x210

#define VICVectCntl5                                  ( *( volatile unsigned long * ) 0xFFFFF214 )
#define VICVectCntl5_OFFSET                           0x214

#define VICVectCntl6                                  ( *( volatile unsigned long * ) 0xFFFFF218 )
#define VICVectCntl6_OFFSET                           0x218

#define VICVectCntl7                                  ( *( volatile unsigned long * ) 0xFFFFF21C )
#define VICVectCntl7_OFFSET                           0x21C

#define VICVectCntl8                                  ( *( volatile unsigned long * ) 0xFFFFF220 )
#define VICVectCntl8_OFFSET                           0x220

#define VICVectCntl9                                  ( *( volatile unsigned long * ) 0xFFFFF224 )
#define VICVectCntl9_OFFSET                           0x224

#define VICVectCntl10                                 ( *( volatile unsigned long * ) 0xFFFFF228 )
#define VICVectCntl10_OFFSET                          0x228

#define VICVectCntl11                                 ( *( volatile unsigned long * ) 0xFFFFF22C )
#define VICVectCntl11_OFFSET                          0x22C

#define VICVectCntl12                                 ( *( volatile unsigned long * ) 0xFFFFF230 )
#define VICVectCntl12_OFFSET                          0x230

#define VICVectCntl13                                 ( *( volatile unsigned long * ) 0xFFFFF234 )
#define VICVectCntl13_OFFSET                          0x234

#define VICVectCntl14                                 ( *( volatile unsigned long * ) 0xFFFFF238 )
#define VICVectCntl14_OFFSET                          0x238

#define VICVectCntl15                                 ( *( volatile unsigned long * ) 0xFFFFF23C )
#define VICVectCntl15_OFFSET                          0x23C


#endif /* ifndef LPC21xx_h */
